Unificador de JSON de Perguntas
Cole cada um dos três JSONs fornecidos nas áreas de texto abaixo:

JSON 1 (contendo "perguntas"):
{
  "perguntas": [
    {
      "enunciado": "Considerando o princípio da continuidade das leis penais, analise a situação em que uma lei penal é revogada. Qual das seguintes afirmações descreve corretamente uma exceção à regra geral de que uma lei somente é revogada por outra lei?",
      "alternativas": {
        "A": "Qualquer lei penal pode ser tacitamente revogada por desuso, quando a sociedade não mais considera a conduta como criminosa.",
        "B": "Leis temporárias, por terem seu período de vigência predefinido, são consideradas autorrevogáveis, não necessitando de outra lei para sua revogação.",
        "C": "Uma lei penal considerada fundamental para a ordem pública, como as que definem crimes contra a vida, não pode ser revogada, apenas emendada.",
        "D": "A revogação global de uma lei penal só ocorre se uma nova lei expressamente listar todos os artigos da lei anterior que estão sendo retirados do ordenamento."
      },
      "resposta_correta": "B",
      "pagina_pdf": "8",
      "trecho_consulta": "Essa é a regra geral: uma lei somente é revogada por outra lei. Há exceções no Direito Penal. As leis temporárias e excepcionais são autorrevogáveis, ou seja, não precisam ser revogadas por outra lei."
    },
    {
      "enunciado": "No contexto da revogação de leis penais, a distinção entre ab-rogação e derrogação é fundamental. Se uma nova lei penal retira completamente a vigência de uma lei anterior, tratando de forma integralmente nova a matéria, mas mantendo alguns dispositivos semelhantes, qual fenômeno revogatório ocorreu e qual sua principal característica?",
      "alternativas": {
        "A": "Derrogação expressa, pois a nova lei substitui parcialmente a anterior, indicando os pontos de alteração.",
        "B": "Ab-rogação, caracterizada pela revogação total da lei anterior, mesmo que a nova lei aborde o mesmo tema.",
        "C": "Revogação tácita global, onde a lei anterior perde a validade por incompatibilidade total, sendo implicitamente substituída.",
        "D": "Ab-rogação parcial, pois apenas os dispositivos incompatíveis da lei anterior são retirados, mantendo-se os demais."
      },
      "resposta_correta": "B",
      "pagina_pdf": "8",
      "trecho_consulta": "A revogação pode ser: absoluta ou total, conhecida como ab-rogação (ab-rogação absoluta), ou parcial, denominada derrogação."
    },
    {
      "enunciado": "Quanto aos modos de revogação de uma lei penal, se uma nova legislação sobre crimes ambientais é promulgada, disciplinando exaustivamente toda a matéria antes tratada em diversas leis esparsas, sem contudo mencionar explicitamente a revogação das leis anteriores, qual tipo de revogação se configura?",
      "alternativas": {
        "A": "Revogação expressa, pois a nova lei, ao tratar de toda a matéria, implicitamente declara as anteriores revogadas.",
        "B": "Revogação tácita, devido à incompatibilidade material entre a nova lei e as disposições específicas das leis anteriores que com ela conflitem.",
        "C": "Revogação global, pois a nova lei regula inteiramente a matéria antes disciplinada, tornando a legislação anterior ultrapassada e desnecessária.",
        "D": "Ab-rogação, pois se trata da supressão total de múltiplas leis por uma única nova lei, ainda que não expressamente."
      },
      "resposta_correta": "C",
      "pagina_pdf": "9",
      "trecho_consulta": "Global: ocorre quando a nova lei regula inteiramente a matéria disciplinada pela lei anterior, que passa a ser ultrapassada e desnecessária."
    },
    {
      "enunciado": "A respeito da *abolitio criminis*, prevista no Art. 2º do Código Penal, qual das seguintes consequências jurídicas NÃO corresponde aos seus efeitos?",
      "alternativas": {
        "A": "Cessação da execução da pena imposta por fato que deixou de ser crime.",
        "B": "Extinção de todos os efeitos da sentença condenatória, inclusive os extrapenais, como a obrigação de reparar o dano.",
        "C": "Retroatividade da lei nova para alcançar fatos praticados antes de sua vigência que deixaram de ser considerados criminosos.",
        "D": "Desconstituição da coisa julgada em matéria penal, permitindo a libertação de quem cumpre pena por conduta abolida."
      },
      "resposta_correta": "B",
      "pagina_pdf": "10",
      "trecho_consulta": "A abolitio criminis não respeita a coisa julgada, assim, cessa a execução penal e os efeitos penais da condenação, permanecendo os efeitos extrapenais. Ex.: a sentença continua servindo como título executivo judicial para reparação de danos sofridos pela vítima;"
    },
    {
      "enunciado": "Considere a situação em que uma lei revoga o tipo penal de 'atentado violento ao pudor', mas a conduta anteriormente tipificada passa a ser integralmente abrangida pelo tipo penal de 'estupro', que sofreu alteração legislativa. Como se denomina esse fenômeno e qual sua principal implicação?",
      "alternativas": {
        "A": "*Abolitio criminis*, pois o tipo penal específico foi formalmente revogado, extinguindo a punibilidade dos fatos anteriores.",
        "B": "Continuidade normativo-típica, pois, apesar da revogação formal de um tipo, a conduta permanece criminosa sob a égide de outro tipo penal, não havendo extinção da punibilidade.",
        "C": "*Novatio legis in pejus*, pois a conduta migra para um tipo penal potencialmente mais grave, aplicando-se apenas a fatos futuros.",
        "D": "*Lex tertia*, pois se busca uma combinação entre a lei antiga (que previa o atentado violento ao pudor) e a nova (que alterou o estupro) para beneficiar o réu."
      },
      "resposta_correta": "B",
      "pagina_pdf": "10",
      "trecho_consulta": "O princípio da continuidade normativa típica ocorre, segundo o STJ (Info. 518), 'quando uma norma penal é revogada, mas a mesma conduta continua sendo crime no tipo penal revogador, ou seja, a infração penal continua tipificada em outro dispositivo, ainda que topologicamente ou normativamente diverso do originário'."
    },
    {
      "enunciado": "Sobre a *novatio legis incriminadora*, que ocorre quando uma lei nova tipifica um comportamento anteriormente atípico, qual é a regra de aplicação temporal e seu fundamento constitucional?",
      "alternativas": {
        "A": "Retroage para alcançar fatos anteriores se a nova lei for considerada socialmente justa, conforme o princípio da dignidade da pessoa humana.",
        "B": "Aplica-se imediatamente a todos os processos em curso, independentemente da data do fato, visando à pacificação social.",
        "C": "Não retroage, em hipótese alguma, para alcançar fatos praticados antes de sua entrada em vigor, conforme o Art. 5º, XL, da Constituição Federal (princípio da irretroatividade da lei penal mais gravosa).",
        "D": "Retroage apenas se houver previsão expressa na nova lei e se o comportamento já era considerado imoral pela sociedade, mesmo que não criminoso."
      },
      "resposta_correta": "C",
      "pagina_pdf": "10",
      "trecho_consulta": "Como a extra-atividade só atua em benefício do réu, a lei não retroagirá para alcançar os fatos praticados antes da entrada em vigor da nova lei. (...) Não poderá retroagir, em hipótese alguma, conforme determina o art. 5.°, XL, da Constituição Federal."
    },
    {
      "enunciado": "A *lex mitior*, ou lei posterior mais benigna, possui aplicação retroativa. Contudo, o texto menciona uma situação em que ela não seria aplicada. Qual das alternativas reflete uma interpretação crítica dessa ressalva, considerando a natureza da *lex mitior*?",
      "alternativas": {
        "A": "Não se aplica se o agente já tiver cumprido integralmente a pena, pois a finalidade da pena já foi atingida e não haveria benefício prático.",
        "B": "Não se aplica se o processo ainda estiver em fase de inquérito, pois a retroatividade só é analisada pelo juiz sentenciante.",
        "C": "Não se aplica a crimes hediondos, mesmo que a nova lei seja mais benéfica, devido à especial reprovabilidade dessas condutas.",
        "D": "Não se aplica se a sentença condenatória já transitou em julgado, pois a coisa julgada impede a alteração da pena."
      },
      "resposta_correta": "A",
      "pagina_pdf": "10",
      "trecho_consulta": "Ex.: se surgir uma lei que reduz a pena mínima de um delito, esta será aplicada, mesmo que a sentença condenatória tenha transitado em julgado. Só não será aplicada se o agente já tiver cumprido a pena."
    },
    {
      "enunciado": "A Súmula 711 do STF estabelece que 'A lei penal mais grave aplica-se ao crime continuado ou ao crime permanente, se a sua vigência é anterior à cessação da continuidade ou da permanência'. Qual a lógica subjacente a essa súmula em relação ao princípio da irretroatividade da *lex gravior*?",
      "alternativas": {
        "A": "A súmula representa uma exceção ao princípio da irretroatividade da *lex gravior*, permitindo sua aplicação a fatos totalmente pretéritos por razões de política criminal.",
        "B": "A súmula não viola a irretroatividade da *lex gravior*, pois considera-se que o crime (continuado ou permanente) ainda está em execução quando da entrada em vigor da lei mais grave, aplicando-se o princípio *tempus regit actum* à totalidade da conduta que se protrai no tempo.",
        "C": "A súmula permite a retroatividade da lei mais grave, desde que o agente seja beneficiado em algum outro aspecto processual, como a progressão de regime.",
        "D": "A súmula determina que a lei mais grave retroaja apenas para os atos da continuidade delitiva ou da permanência que ocorreram após sua vigência, cindindo-se a aplicação da lei."
      },
      "resposta_correta": "B",
      "pagina_pdf": "11",
      "trecho_consulta": "Os crimes permanente e continuado têm uma especificidade, constante na súmula 711 do STF: 'A lei penal mais grave aplica-se ao crime continuado ou ao crime permanente, se a sua vigência é anterior à cessação da continuidade ou da permanência'. (...) Deverá ser aplicada a lei B, mesmo que configure novatio legis in pejus."
    },
    {
      "enunciado": "Conforme a Súmula 611 do STF, 'Transitada em julgado a sentença condenatória, compete ao juízo das execuções a aplicação de lei mais benéfica'. Se uma lei nova mais benéfica surge após o trânsito em julgado, mas antes do início do cumprimento da pena, a quem compete sua aplicação?",
      "alternativas": {
        "A": "Ao tribunal que proferiu a última decisão, pois a execução ainda não se iniciou.",
        "B": "Ao juiz de primeiro grau que sentenciou o feito, por ser o juiz natural da causa.",
        "C": "Ao juízo da execução, pois a sentença já transitou em julgado, independentemente do início do cumprimento da pena.",
        "D": "Ao Ministério Público, que deverá requerer a aplicação da lei mais benéfica ao juízo sentenciante."
      },
      "resposta_correta": "C",
      "pagina_pdf": "12",
      "trecho_consulta": "Juízo da execução – após o trânsito em julgado, pouco importa a origem da condenação. Se a condenação já tiver sido alcançada pelo trânsito em julgado, a competência será do juízo da Vara das Execuções Criminais. É o que se extrai do art. 66, I, da Lei de Execução Penal, e da Súmula 611 do Supremo Tribunal Federal."
    },
    {
      "enunciado": "A discussão sobre a aplicação da lei penal mais benéfica durante seu período de *vacatio legis* divide a doutrina. Qual alternativa apresenta corretamente a posição majoritária e um de seus fundamentos?",
      "alternativas": {
        "A": "Sim, é possível aplicá-la, pois o objetivo é favorecer o réu, e a lei, embora não vigente, já manifesta a vontade do legislador por uma punição mais branda.",
        "B": "Não, pois nenhuma lei pode ser aplicada durante a *vacatio legis*, período em que sua eficácia está suspensa e não se pode prever se efetivamente entrará em vigor.",
        "C": "Sim, desde que a lei em *vacatio legis* expressamente autorize sua aplicação antecipada em benefício do réu.",
        "D": "Não, a menos que se trate de *abolitio criminis*, caso em que a expectativa de direito à descriminalização já se consolida com a publicação da lei."
      },
      "resposta_correta": "B",
      "pagina_pdf": "12",
      "trecho_consulta": "2ª Corrente. Não, nenhuma lei pode ser aplicada enquanto está no período de vacância, não há lógica (não se sabe até quando uma lei estará em vigor, por exemplo, o CP/69 nunca entrou em vigor). É majoritária."
    },
    {
      "enunciado": "Em relação à *lex gravior* e sua irretroatividade, os tribunais superiores firmaram entendimento sobre a aplicação de novos precedentes jurisprudenciais. Qual a implicação desse entendimento para fatos ocorridos antes da mudança jurisprudencial, caso esta seja mais severa ao réu?",
      "alternativas": {
        "A": "A nova interpretação jurisprudencial mais gravosa não pode ser aplicada a fatos anteriores, pois se equipara à *lex gravior*, violando o princípio da irretroatividade.",
        "B": "A nova interpretação jurisprudencial, mesmo mais gravosa, pode ser aplicada a fatos anteriores, pois o ordenamento jurídico proíbe apenas a retroatividade da lei penal material mais gravosa, não da interpretação judicial.",
        "C": "A aplicação de nova interpretação jurisprudencial mais gravosa a fatos anteriores depende de modulação dos efeitos pelo tribunal, visando à segurança jurídica.",
        "D": "A nova interpretação jurisprudencial mais gravosa só se aplica a fatos anteriores se houver reiteração criminosa por parte do agente após a mudança de entendimento."
      },
      "resposta_correta": "B",
      "pagina_pdf": "13",
      "trecho_consulta": "Não há se falar em irretroatividade de interpretação jurisprudencial, uma vez que o ordenamento jurídico proíbe apenas a retroatividade da lei penal mais gravosa. Os preceitos constitucionais relativos à aplicação retroativa da norma penal benéfica, bem como à irretroatividade da norma mais grave ao acusado (art. 5°, XL, da Constituição Federal), são inaplicáveis aos precedentes jurisprudenciais."
    },
    {
      "enunciado": "No debate sobre a *lex tertia* (combinação de leis penais), Nelson Hungria e José Frederico Marques apresentam posições divergentes. Qual alternativa expõe corretamente a posição de Nelson Hungria e seu principal argumento?",
      "alternativas": {
        "A": "Admite a combinação de leis, desde que o juiz se limite aos dispositivos criados pelo legislador, sem criar uma terceira lei, em homenagem ao princípio da máxima benignidade.",
        "B": "Não admite a combinação de leis penais, pois tal prática configuraria violação ao princípio da separação dos poderes, com o juiz atuando como legislador positivo ao criar uma nova norma a partir de fragmentos de outras.",
        "C": "Admite a combinação de leis (Teoria da Ponderação Diferenciada), argumentando que o juiz não cria lei, mas aplica o direito dentro dos limites estabelecidos, sendo razoável buscar o máximo benefício ao réu.",
        "D": "Não admite a combinação, a menos que a nova lei expressamente permita a aplicação de dispositivos mais favoráveis da lei antiga, caso em que a vedação à atividade legiferante do juiz seria superada."
      },
      "resposta_correta": "B",
      "pagina_pdf": "13",
      "trecho_consulta": "1ª Posição (Nelson Hungria) – não se admite a combinação de leis penais, uma vez que haveria violação ao princípio constitucional da separação dos poderes. Poderá aplicar toda a lei nova ou toda a lei antiga, mas não partes de cada uma."
    },
    {
      "enunciado": "A Súmula 501 do STJ dispõe: 'É cabível a aplicação retroativa da Lei n. 11.343/2006, desde que o resultado da incidência das suas disposições, na íntegra, seja mais favorável ao réu do que o advindo da aplicação da Lei n. 6.368/1976, sendo vedada a combinação de leis.' Como essa súmula se posiciona em relação às teorias da ponderação unitária e diferenciada?",
      "alternativas": {
        "A": "Adota a teoria da ponderação diferenciada, permitindo que o juiz escolha os aspectos mais benéficos de cada lei, desde que o resultado final seja mais favorável.",
        "B": "Adota uma teoria mista, permitindo a combinação apenas em casos excepcionais de tráfico privilegiado, mas, em regra, aplica a ponderação unitária.",
        "C": "Adota a teoria da ponderação unitária ou global, exigindo a aplicação integral de uma das leis (a antiga ou a nova, a que for mais benéfica em seu conjunto) e proibindo a criação de uma terceira lei a partir de partes de ambas.",
        "D": "Rejeita ambas as teorias, propondo que o juiz deve sempre aplicar a lei vigente ao tempo do julgamento, salvo se a lei do tempo do crime for ultrativa por ser mais benéfica."
      },
      "resposta_correta": "C",
      "pagina_pdf": "14",
      "trecho_consulta": "Com igual orientação, o Superior Tribunal de Justiça editou a Súmula n.º 501, que assim dispõe: Súmula n.º 501, STJ: É cabível a aplicação retroativa da Lei n. 11.343/2006, desde que o resultado da incidência das suas disposições, na integra, seja mais favorável ao réu do que o advindo da aplicação da Lei n. 6.368/1976, sendo vedada a combinação de leis."
    },
    {
      "enunciado": "A lei penal intermediária é aquela que, embora não vigente ao tempo do fato nem ao tempo do julgamento, pode ser aplicada se for a mais benéfica. Qual o duplo efeito que caracteriza a aplicação dessa lei?",
      "alternativas": {
        "A": "Retroatividade em relação ao tempo da ação ou omissão e irretroatividade em relação ao tempo do julgamento.",
        "B": "Ultratividade em relação ao tempo da ação ou omissão e retroatividade em relação ao tempo do julgamento.",
        "C": "Retroatividade em relação ao tempo da ação ou omissão e ultratividade em relação ao tempo do julgamento.",
        "D": "Irretroatividade em relação ao tempo da ação ou omissão e ultratividade em relação ao tempo do julgamento."
      },
      "resposta_correta": "C",
      "pagina_pdf": "15",
      "trecho_consulta": "Por fim, é possível notar que a lei penal intermediária é dotada de duplo efeito, possuindo a retroatividade em relação ao tempo da ação ou omissão e ultra-atividade em relação ao tempo do julgamento."
    },
    {
      "enunciado": "No contexto das leis penais em branco, se o complemento normativo é alterado, tornando a conduta anteriormente criminosa atípica, e essa alteração ocorre em um contexto de normalidade legislativa (não excepcionalidade), qual deve ser a consequência jurídica para fatos praticados antes da alteração do complemento?",
      "alternativas": {
        "A": "A alteração do complemento não retroage, pois o núcleo da norma penal em branco permaneceu inalterado, aplicando-se o princípio *tempus regit actum*.",
        "B": "A retroatividade é obrigatória para beneficiar o réu, pois a situação que se buscava incriminar deixou de ser relevante para o ordenamento, configurando uma espécie de *abolitio criminis* material.",
        "C": "A alteração do complemento só retroage se a lei penal em branco expressamente prever essa possibilidade, em respeito à autonomia do complemento.",
        "D": "A alteração do complemento não retroage, em razão da ultratividade do complemento vigente à época do fato, mesmo em contexto de normalidade."
      },
      "resposta_correta": "B",
      "pagina_pdf": "15",
      "trecho_consulta": "No que tange a normalidade, uma situação que se buscava incriminar passa a ser irrelevante. Nesse caso, a retroatividade é obrigatória. (...) Perceba que ocorreu uma descriminalização da maconha, não mais é considera uma droga proibida pelo ordenamento jurídico brasileiro, devendo operar-se a retroatividade, uma vez que não havia situação de anormalidade."
    },
    {
      "enunciado": "Considere uma lei penal em branco cujo complemento foi editado para vigorar durante uma situação de anormalidade econômica, como um tabelamento de preços. Se, após a estabilização econômica, esse complemento é revogado, o agente que praticou o crime durante a vigência do tabelamento (situação de anormalidade) será beneficiado pela revogação do complemento?",
      "alternativas": {
        "A": "Sim, pois a revogação do complemento, mesmo em situação de anormalidade, equipara-se à *abolitio criminis*, devendo retroagir.",
        "B": "Não, pois o complemento editado em situação de anormalidade é dotado de ultratividade, conforme o art. 3º do Código Penal, não podendo sua revogação posterior retroagir para beneficiar o réu que agiu durante a excepcionalidade.",
        "C": "Sim, mas apenas se a revogação do complemento ocorrer antes do trânsito em julgado da sentença condenatória.",
        "D": "Depende: se o complemento era uma lei em sentido formal, sua revogação retroage; se era um ato administrativo, não retroage."
      },
      "resposta_correta": "B",
      "pagina_pdf": "15",
      "trecho_consulta": "Por outro lado, quando o complemento se inserir em um contexto de anormalidade, de excepcionalidade, a sua modificação, ainda que benéfica ao réu, não pode retroagir. Fundamenta-se essa posição na ultratividade das leis penais excepcionais, alicerçada no art. 3.° do Código Penal."
    },
    {
      "enunciado": "As leis penais temporárias e excepcionais, conforme o Art. 3º do Código Penal, possuem uma característica fundamental quanto à sua aplicação no tempo. Qual é essa característica e sua justificativa?",
      "alternativas": {
        "A": "São retroativas, aplicando-se a fatos anteriores à sua vigência se forem mais benéficas, para garantir a isonomia.",
        "B": "São ultrativas e autorrevogáveis, continuando a punir fatos praticados durante sua vigência mesmo após seu término, para evitar a ineficácia preventiva dessas leis de curta duração.",
        "C": "São irretroativas e perdem a eficácia imediatamente após o término de seu prazo ou da situação excepcional, não punindo mais ninguém, como regra geral.",
        "D": "Dependem de uma lei posterior para confirmar sua ultratividade; caso contrário, cessam todos os efeitos com o fim de sua vigência."
      },
      "resposta_correta": "B",
      "pagina_pdf": "16",
      "trecho_consulta": "Ambas são ULTRATIVAS e AUTORREVOÁVEIS: os fatos praticados durante sua vigência continuarão a ser punidos mesmo após o fim de sua vigência. Se assim não fossem, como essas leis são de curtissima duração, seria sancionada uma ineficácia preventiva, ou seja, essas leis não teriam aplicabilidade."
    },
    {
      "enunciado": "Qual é o requisito essencial que distingue o conflito aparente de normas do concurso de crimes, considerando a aplicação dos princípios solucionadores?",
      "alternativas": {
        "A": "No conflito aparente de normas há pluralidade de fatos, enquanto no concurso de crimes há unidade de fato.",
        "B": "No conflito aparente de normas há unidade de fato e pluralidade de leis aparentemente aplicáveis, enquanto no concurso de crimes o agente pratica dois ou mais crimes distintos.",
        "C": "A vigência simultânea das normas é requisito para o concurso de crimes, mas não para o conflito aparente de normas.",
        "D": "O conflito aparente de normas só ocorre entre leis do Código Penal, enquanto o concurso de crimes pode envolver legislação especial."
      },
      "resposta_correta": "B",
      "pagina_pdf": "17",
      "trecho_consulta": "1. Unidade do fato: o agente praticou um único fato (um único crime). Este requisito serve para diferenciar o conflito aparente de normas do concurso de crimes."
    },
    {
      "enunciado": "O princípio da especialidade é um dos critérios para solucionar o conflito aparente de normas. Como ele opera e qual sua relação lógica com a norma geral?",
      "alternativas": {
        "A": "A norma geral, por ser mais abrangente, afasta a aplicação da norma especial, que trata de casos específicos.",
        "B": "A norma especial afasta a aplicação da norma geral (*Lex specialis derogat generali*), pois a lei específica contém todos os elementos da genérica e adiciona características particularizantes (elementos especializantes).",
        "C": "Ambas as normas, geral e especial, são aplicadas conjuntamente, somando-se as penas para refletir a complexidade do fato.",
        "D": "A norma especial só se aplica se for mais benéfica ao réu; caso contrário, prevalece a norma geral, mesmo que o fato se enquadre na especial."
      },
      "resposta_correta": "B",
      "pagina_pdf": "18",
      "trecho_consulta": "Princípio da especialidade: Norma especial afasta a aplicação da norma geral (Lex specialis derrogat generali.). O critério da especialidade reclama duas leis penais em concurso, caracterizadas pela relação de gênero e espécie, na qual esta prefere àquela, excluindo a sua aplicação para fins de tipicidade."
    },
    {
      "enunciado": "No âmbito do princípio da subsidiariedade, a norma subsidiária atua como um 'soldado de reserva'. O que significa a subsidiariedade tácita e como ela se diferencia da expressa?",
      "alternativas": {
        "A": "Subsidiariedade tácita ocorre quando a própria norma declara que só se aplica se o fato não constituir crime mais grave; a expressa é presumida pelo intérprete.",
        "B": "Subsidiariedade tácita é aquela em que a condição de 'soldado de reserva' é extraída da análise do caso concreto e da relação entre os bens jurídicos tutelados, sem menção explícita na lei, enquanto a expressa contém essa cláusula de ressalva.",
        "C": "Subsidiariedade tácita se aplica apenas a crimes de menor potencial ofensivo, enquanto a expressa pode ocorrer em qualquer tipo de crime.",
        "D": "Subsidiariedade tácita significa que a norma menos grave sempre absorve a mais grave, enquanto a expressa faz o contrário."
      },
      "resposta_correta": "B",
      "pagina_pdf": "19",
      "trecho_consulta": "Subsidiariedade tácita ou implícita: a norma penal não se declara subsidiária, mas esta circunstância é extraída da análise do caso concreto. Exemplo: Constrangimento ilegal (CP, art. 146), subsidiário diante do estupro (CP, art. 213)."
    },
    {
      "enunciado": "O princípio da consunção estabelece que o fato mais amplo e grave absorve os demais fatos menos amplos e graves. Em qual das seguintes hipóteses a consunção tipicamente NÃO se aplica, exigindo análise de concurso de crimes?",
      "alternativas": {
        "A": "Crime progressivo, onde o agente, desde o início, visa o resultado mais grave, passando por etapas que configurariam crimes menos graves.",
        "B": "Crime complexo, como o roubo, que funde o furto com a ameaça ou lesão corporal.",
        "C": "Quando o agente pratica um furto para obter recursos e, dias depois, com esses recursos, adquire drogas para uso pessoal, sendo os dois crimes autônomos e com desígnios distintos.",
        "D": "Antefato impunível, como a violação de domicílio para cometer um furto dentro da residência, sendo a violação meio necessário para o crime-fim."
      },
      "resposta_correta": "C",
      "pagina_pdf": "19",
      "trecho_consulta": "São hipóteses em que se aplica o princípio da consunção: Crime complexo... Crime progressivo... Atos impuníveis... (O exemplo C não se encaixa como hipótese de consunção, mas de concurso, pois os crimes são autônomos e com desígnios distintos, não havendo relação de meio-fim ou parte-todo necessária para a consunção)."
    },
    {
      "enunciado": "A teoria da atividade, adotada pelo Art. 4º do Código Penal para definir o tempo do crime, estabelece que se considera praticado o crime no momento da ação ou omissão. Qual a principal implicação dessa teoria para a aferição da imputabilidade penal do agente?",
      "alternativas": {
        "A": "A imputabilidade é aferida no momento do resultado, pois é quando o bem jurídico é efetivamente lesionado.",
        "B": "A imputabilidade é analisada no momento da conduta (ação ou omissão), ainda que o resultado ocorra posteriormente, quando o agente poderia já ter atingido a maioridade penal ou desenvolvido uma doença mental.",
        "C": "A imputabilidade é verificada tanto no momento da conduta quanto no momento do resultado, exigindo-se que o agente seja imputável em ambas as ocasiões.",
        "D": "A teoria da atividade é irrelevante para a imputabilidade, que é sempre analisada no momento do oferecimento da denúncia."
      },
      "resposta_correta": "B",
      "pagina_pdf": "21",
      "trecho_consulta": "Considera-se praticado o crime no momento da ação ou omissão, AINDA QUE outro seja o momento do resultado'. (...) Exemplo: 'A', com a idade de 17 anos, 11 meses e 20 dias, efetua disparos de arma de fogo contra 'B'... Não se aplicará ao autor o Código Penal, em face de sua inimputabilidade ao tempo do crime..."
    },
    {
      "enunciado": "Embora o Código Penal adote a teoria da atividade para o tempo do crime (Art. 4º CP), há uma exceção expressa quanto ao início do prazo da prescrição da pretensão punitiva. Qual teoria é aplicada para este fim específico, conforme o Art. 111, I, do CP?",
      "alternativas": {
        "A": "Teoria da atividade, mantendo a coerência do sistema, contando-se a prescrição a partir da data da ação ou omissão.",
        "B": "Teoria da ubiquidade, permitindo que a prescrição comece a correr tanto da data da conduta quanto da data do resultado, o que ocorrer primeiro.",
        "C": "Teoria do resultado, pois a prescrição da pretensão punitiva começa a correr do dia em que o crime se consumou.",
        "D": "Teoria mista, combinando o momento da conduta para crimes formais e o momento do resultado para crimes materiais."
      },
      "resposta_correta": "C",
      "pagina_pdf": "22",
      "trecho_consulta": "O Código Penal excepciona a Teoria da Atividade para fins de prescrição, eis que adota a Teoria do Resultado, para a contagem do início do prazo da PPP (prescrição da pretensão punitiva). Art. 111 A prescrição, antes de transitar em julgado a sentença final, começa a correr: I do dia em que o crime se consumou;"
    },
    {
      "enunciado": "O Art. 5º do Código Penal estabelece o princípio da territorialidade temperada. O que significa 'temperada' ou 'mitigada' nesse contexto?",
      "alternativas": {
        "A": "Significa que a lei brasileira se aplica apenas a crimes graves cometidos no território nacional, excluindo-se os de menor potencial ofensivo.",
        "B": "Significa que a lei brasileira se aplica aos crimes cometidos no território nacional, mas essa regra é absoluta e não admite exceções de extraterritorialidade.",
        "C": "Significa que, embora a regra seja a aplicação da lei brasileira aos crimes cometidos em seu território, essa regra é excepcionada por convenções, tratados e regras de direito internacional, e também complementada por hipóteses de extraterritorialidade.",
        "D": "Significa que a lei brasileira só se aplica no território nacional se o agente for brasileiro ou residente no Brasil."
      },
      "resposta_correta": "C",
      "pagina_pdf": "23",
      "trecho_consulta": "Aplica-se a lei brasileira aos crimes cometidos no território nacional. Há exceções que ocorrem quando o brasileiro pratica crime no exterior ou quando um estrangeiro comete delito no Brasil. Fala-se, assim, que o Código penal adotou o princípio da territorialidade temperada ou mitigada. Art. 5º, CP Aplica-se a lei brasileira, sem prejuízo de convenções, tratados e regras de direito internacional, ao crime cometido no território nacional."
    },
    {
      "enunciado": "Para efeitos penais, o §1º do Art. 5º do CP considera como extensão do território nacional as embarcações e aeronaves brasileiras de natureza pública. Qual a abrangência territorial da lei brasileira para esses veículos?",
      "alternativas": {
        "A": "Aplica-se a lei brasileira somente quando estiverem em águas territoriais ou espaço aéreo brasileiro.",
        "B": "Aplica-se a lei brasileira onde quer que se encontrem, seja em território nacional, estrangeiro, alto-mar ou espaço aéreo correspondente.",
        "C": "Aplica-se a lei brasileira apenas se o crime for cometido por brasileiro a bordo dessas embarcações ou aeronaves.",
        "D": "Aplica-se a lei brasileira somente se estiverem a serviço do governo brasileiro em missão oficial no exterior."
      },
      "resposta_correta": "B",
      "pagina_pdf": "23",
      "trecho_consulta": "§ 1º Para os efeitos penais, consideram-se como extensão do território nacional as embarcações e aeronaves brasileiras, de natureza pública ou a serviço do governo brasileiro onde quer que se encontrem..."
    },
    {
      "enunciado": "O Art. 6º do Código Penal adota a teoria da ubiquidade para definir o lugar do crime. Em qual das seguintes situações a teoria da ubiquidade, conforme descrita para o Art. 6º CP, prioritariamente NÃO se aplica para definir a lei penal aplicável, sendo solucionada por regras de competência interna ou outras disposições?",
      "alternativas": {
        "A": "Um crime em que a conduta é praticada no Brasil e o resultado ocorre na Argentina (crime à distância).",
        "B": "Um crime em que a conduta é iniciada em um estado brasileiro e o resultado se consuma em outro estado brasileiro (crime plurilocal).",
        "C": "Um crime em que a conduta é praticada de uma aeronave sobrevoando o oceano Atlântico e o resultado se manifesta em um navio em águas internacionais.",
        "D": "Um crime em que um agente no exterior envia uma carta-bomba para o Brasil, que explode e causa o resultado no território nacional."
      },
      "resposta_correta": "B",
      "pagina_pdf": "26",
      "trecho_consulta": "O art. 6º do CP aplica-se apenas aos crimes à distância, também conhecidos como crimes de espaço máximo, em que a conduta e o resultado ocorrem em países diversos. (...) Crimes plurilocais: são aqueles em que a conduta e o resultado ocorrem em comarcas diversas, mas no mesmo país. (Aqui, a teoria da ubiquidade do art. 6º CP não define a lei aplicável, pois já é a brasileira, mas sim influencia a discussão sobre competência, regida pelo CPP, que para crimes plurilocais adota a teoria do resultado - art. 70 CPP, como mencionado na p.51 do PDF em 'Gabarito Questão Desafio')."
    },
    {
      "enunciado": "No tocante à extraterritorialidade incondicionada, prevista no Art. 7º, I, do CP, qual a consequência para o agente que comete um dos crimes ali elencados, caso seja julgado (absolvido ou condenado) no estrangeiro?",
      "alternativas": {
        "A": "O agente não poderá ser punido pela lei brasileira se já tiver sido absolvido no estrangeiro, em respeito ao *ne bis in idem*.",
        "B": "O agente será punido segundo a lei brasileira, ainda que absolvido ou condenado no estrangeiro, conforme o Art. 7º, §1º, do CP, mitigando-se a pena cumprida no exterior.",
        "C": "O agente só será punido pela lei brasileira se a pena no estrangeiro for menor que a prevista no Brasil, para complementação.",
        "D": "O agente só poderá ser processado no Brasil se o país onde ocorreu o crime solicitar, via cooperação internacional."
      },
      "resposta_correta": "B",
      "pagina_pdf": "27",
      "trecho_consulta": "As hipóteses estão previstas no art. 7.º, I, do Código Penal e, no tocante a esses crimes, o agente é punido segundo a lei brasileira, ainda que absolvido ou condenado no estrangeiro (art. 7.°, § 1.°)."
    },
    {
      "enunciado": "A extraterritorialidade condicionada, prevista no Art. 7º, II, e §3º do CP, sujeita a aplicação da lei brasileira a diversas condições. Qual das alternativas NÃO representa uma dessas condições estabelecidas no Art. 7º, §2º, do CP?",
      "alternativas": {
        "A": "Entrar o agente no território nacional.",
        "B": "Ser o fato punível também no país em que foi praticado (princípio da dupla incriminação).",
        "C": "O agente ser primário e de bons antecedentes, conforme avaliação do juiz brasileiro.",
        "D": "Não ter sido o agente absolvido no estrangeiro ou não ter aí cumprido a pena."
      },
      "resposta_correta": "C",
      "pagina_pdf": "28-29",
      "trecho_consulta": "A aplicação da lei penal brasileira aos crimes cometidos no exterior se sujeita às condições cumulativas descritas pelo art. 7.°, § 2.º, alíneas 'a', 'b', 'c', 'd' e 'e' (...) Entrar o agente no território nacional; Ser o fato punível também no país em que foi praticado; Estar o crime incluído entre aqueles pelos quais a lei brasileira autoriza a extradição; Não ter sido o agente absolvido no estrangeiro ou não ter aí cumprido a pena; Não ter sido o agente perdoado no estrangeiro ou, por outro motivo, não estar extinta a punibilidade, segundo a lei mais favorável."
    },
    {
      "enunciado": "O Art. 8º do Código Penal trata da pena cumprida no estrangeiro. Como essa pena influencia a pena imposta no Brasil pelo mesmo crime, nos casos de extraterritorialidade?",
      "alternativas": {
        "A": "A pena cumprida no estrangeiro sempre extingue a punibilidade no Brasil, independentemente de serem idênticas ou diversas.",
        "B": "A pena cumprida no estrangeiro é irrelevante para a justiça brasileira, que aplicará a pena integralmente.",
        "C": "A pena cumprida no estrangeiro atenua a pena imposta no Brasil quando diversas, ou nela é computada (detração) quando idênticas.",
        "D": "A pena cumprida no estrangeiro só é considerada se houver tratado de extradição com o país onde a pena foi cumprida."
      },
      "resposta_correta": "C",
      "pagina_pdf": "29",
      "trecho_consulta": "Conforme o Art. 8°, do Código Penal, a pena cumprida no estrangeiro ATENUA a pena imposta no Brasil pelo mesmo crime, quando DIVERSAS, ou nela é computada, quando idênticas."
    },
    {
      "enunciado": "O Art. 9º do Código Penal estabelece hipóteses em que a sentença penal estrangeira precisa ser homologada pelo Superior Tribunal de Justiça para produzir efeitos no Brasil. Para qual das finalidades abaixo a homologação depende de 'requisição do Ministro da Justiça', na falta de tratado de extradição?",
      "alternativas": {
        "A": "Para gerar quaisquer efeitos civis, como a reparação do dano.",
        "B": "Para sujeitar o condenado a medida de segurança.",
        "C": "Para agravar a pena em caso de reincidência internacional.",
        "D": "Para permitir a transferência do preso para cumprimento de pena no Brasil."
      },
      "resposta_correta": "B",
      "pagina_pdf": "29",
      "trecho_consulta": "A HOMOLOGAÇÃO DEPENDE DE... TRATADO DE EXTRADIÇÃO com o país de cuja autoridade judiciária emanou a sentença, ou, na falta de tratado, de REQUISIÇÃO DO MINISTRO DA JUSTIÇA (para Sujeitar o condenado a MEDIDA DE SEGURANÇA)."
    },
    {
      "enunciado": "A contagem de prazo penal, conforme o Art. 10 do Código Penal, possui uma regra específica quanto ao dia do começo e sua natureza. Qual das afirmações melhor descreve essa sistemática?",
      "alternativas": {
        "A": "O dia do começo é excluído do cômputo, e os prazos são prorrogáveis se terminarem em finais de semana ou feriados.",
        "B": "O dia do começo inclui-se no cômputo do prazo, e os prazos penais são improrrogáveis, mesmo que terminem em sábados, domingos ou feriados.",
        "C": "O dia do começo inclui-se no cômputo, mas os prazos são prorrogáveis até o próximo dia útil se o término ocorrer em dia não útil.",
        "D": "O dia do começo é irrelevante, contando-se apenas os dias subsequentes, e os prazos são sempre contados em dias úteis."
      },
      "resposta_correta": "B",
      "pagina_pdf": "30",
      "trecho_consulta": "Conforme dispõe o Art. 10, Código Penal: 'o dia do começo inclui-se no cômputo do prazo'. (...) OS PRAZOS PENAIS SÃO IMPRORROGÁVEIS, MESMO QUE TERMINEM EM SÁBADOS, DOMINGOS OU FERIADOS."
    },
    {
      "enunciado": "O Art. 11 do Código Penal trata das frações não computáveis da pena. Qual o tratamento dado às frações de dia nas penas privativas de liberdade e restritivas de direitos?",
      "alternativas": {
        "A": "As frações de dia são arredondadas para o dia inteiro subsequente, em prejuízo do réu.",
        "B": "As frações de dia são desprezadas, não sendo computadas na contagem final da pena.",
        "C": "As frações de dia são convertidas em horas e cumpridas proporcionalmente.",
        "D": "As frações de dia são convertidas em pena de multa, aplicando-se uma regra de três."
      },
      "resposta_correta": "B",
      "pagina_pdf": "30",
      "trecho_consulta": "Preceitua o art. 11 do Código Penal: 'Desprezam-se, nas penas privativas de liberdade e nas restritivas de direitos, as frações de dia, e, na pena de multa, as frações de cruzeiro'."
    },
    {
      "enunciado": "Conforme o Art. 12 do Código Penal, as regras gerais do Código Penal aplicam-se aos fatos incriminados por lei especial. Qual a condição para que essa aplicação subsidiária ocorra?",
      "alternativas": {
        "A": "Desde que a lei especial seja anterior ao Código Penal.",
        "B": "Apenas se a lei especial tratar de crimes de menor gravidade.",
        "C": "Se a lei especial não dispuser de modo diverso sobre a matéria.",
        "D": "Somente com autorização expressa do Superior Tribunal de Justiça para cada caso."
      },
      "resposta_correta": "C",
      "pagina_pdf": "30",
      "trecho_consulta": "Prevista no art. 12 do Código Penal: 'As regras gerais deste Código aplicam-se aos fatos incriminados por lei especial, se esta não dispuser de modo diverso'."
    },
    {
      "enunciado": "Sobre a distinção entre 'abolitio criminis' e 'continuidade normativo-típica', analise: se uma lei nova revoga um artigo que previa o crime X, mas simultaneamente introduz um novo artigo Y que descreve e pune exatamente a mesma conduta de X, com a mesma pena, o agente que praticou X sob a lei antiga será beneficiado?",
      "alternativas": {
        "A": "Sim, pois ocorreu *abolitio criminis* formal do artigo X, extinguindo-se a punibilidade, e o novo artigo Y só se aplica a fatos futuros.",
        "B": "Não, pois se trata de continuidade normativo-típica; a conduta não deixou de ser crime, apenas houve um deslocamento topográfico da tipificação, mantendo-se a punibilidade.",
        "C": "Sim, pois a lei nova, mesmo mantendo a conduta como crime, é considerada mais benéfica por ser posterior, implicando a revisão da pena.",
        "D": "Depende: se a lei nova Y tiver um nome diferente para o crime, configura *abolitio criminis*; se mantiver o mesmo nome, há continuidade."
      },
      "resposta_correta": "B",
      "pagina_pdf": "10",
      "trecho_consulta": "ABOLITIO CRIMINIS: Há uma supressão formal e material da figura criminosa. (...) CONTINUIDADE NORMATIVA TÍPICA: Há uma supressão apenas formal da figura criminosa. (...) O fato permanece sendo punível (a conduta criminosa, no entanto, é deslocada para outro tipo penal)."
    },
    {
      "enunciado": "Um indivíduo pratica um crime de furto. Durante o processo, surge uma nova lei que, mantendo a pena máxima do furto, aumenta a pena mínima e extingue uma causa de aumento de pena anteriormente aplicável ao caso. Diante dessa *lex tertia* potencial, qual seria a posição defendida por José Frederico Marques, de acordo com o material?",
      "alternativas": {
        "A": "Deveria aplicar integralmente a lei antiga, pois a nova lei é parcialmente mais gravosa (aumento da pena mínima), vedando-se qualquer combinação.",
        "B": "Deveria aplicar integralmente a lei nova, pois a extinção da causa de aumento pode ser mais benéfica, mesmo com o aumento da pena mínima, vedando-se a combinação.",
        "C": "Seria possível a combinação das leis, aplicando-se a pena mínima da lei antiga (mais benéfica) e excluindo-se a causa de aumento conforme a lei nova (mais benéfica), pois o juiz não estaria criando lei, mas transitando nos limites estabelecidos pelo legislador.",
        "D": "Seria inadmissível a combinação, pois o juiz estaria usurpando a função do legislador, devendo optar pela lei que, em sua totalidade (ponderação global), fosse mais favorável."
      },
      "resposta_correta": "C",
      "pagina_pdf": "13",
      "trecho_consulta": "2ª Posição (José Frederico Marques) é possível a combinação de leis penais. Não haverá violação ao princípio da separação dos poderes, uma vez que o juiz não está criando uma lei, mas transita dentro dos limites previamente estabelecidos pelo legislador."
    },
    {
      "enunciado": "A Lei Geral da Copa (Lei 12.663/2012) estabeleceu tipos penais com vigência até uma data predeterminada. Essa característica classifica tal lei penal como:",
      "alternativas": {
        "A": "Lei excepcional, pois vigorou durante um evento extraordinário.",
        "B": "Lei temporária, pois tinha em seu texto o tempo de vigência prefixado.",
        "C": "Lei penal em branco, pois dependia de regulamentos da FIFA para sua plena aplicação.",
        "D": "Lei intermediária, pois surgiu entre a legislação penal comum anterior e a posterior ao evento."
      },
      "resposta_correta": "B",
      "pagina_pdf": "16",
      "trecho_consulta": "Lei Temporária: Aquela que tem, prefixado em seu texto, o tempo de vigência. Ex.: Lei A estabelece que sua vigência durará do dia 1º de janeiro de 2012 ao dia 1º de junho de 2012; Lei Geral da Copa;"
    },
    {
      "enunciado": "No crime de dano qualificado pelo emprego de substância inflamável (Art. 163, parágrafo único, II, CP), o próprio tipo penal ressalva 'se o fato não constitui crime mais grave'. Essa ressalva é um exemplo clássico de qual princípio solucionador de conflito aparente de normas?",
      "alternativas": {
        "A": "Princípio da especialidade, pois o dano qualificado é especial em relação ao dano simples.",
        "B": "Princípio da consunção, pois o crime mais grave (ex: incêndio) absorveria o dano.",
        "C": "Princípio da subsidiariedade expressa, onde a própria norma se declara aplicável apenas na ausência de um crime mais severo.",
        "D": "Princípio da alternatividade, pois o agente poderia responder por dano ou pelo crime mais grave, à escolha da acusação."
      },
      "resposta_correta": "C",
      "pagina_pdf": "19",
      "trecho_consulta": "Subsidiariedade expressa ou explícita: a própria norma penal se declara subsidiária, ou seja, diz que somente será aplicada se o fato não constituir crime mais grave. Como exemplo, temos o art. 163, p. único, II do CP."
    },
    {
      "enunciado": "Um agente, com o dolo inicial de lesionar gravemente a vítima, desfere facadas. Após constatar a gravidade das lesões, decide matá-la, desferindo novos golpes fatais. Como se classifica essa situação em termos de progressão delitiva e qual princípio se aplica para resolver o aparente concurso de crimes (lesão grave e homicídio)?",
      "alternativas": {
        "A": "Crime progressivo, aplicando-se a consunção, pois o homicídio absorve a lesão corporal grave como etapa necessária.",
        "B": "Progressão criminosa, aplicando-se a consunção, pois o agente, após atingir um resultado menos grave (lesão), altera seu dolo e pratica uma conduta mais grave (homicídio), que absorve a anterior.",
        "C": "Concurso material de crimes, pois houve duas condutas distintas com dois resultados lesivos (lesão e morte), devendo as penas serem somadas.",
        "D": "Crime complexo, pois a lesão e o homicídio se fundem em um único tipo penal, como o latrocínio."
      },
      "resposta_correta": "B",
      "pagina_pdf": "20",
      "trecho_consulta": "Progressão criminosa: quando o agente pretende inicialmente produzir um resultado e, depois de alcança-lo, opta por prosseguir na prática ilícita e reinicia outra conduta, produzindo um evento mais grave. Pluralidade de designios, havendo alteração em seu dolo."
    },
    {
      "enunciado": "O Código Penal Militar (Decreto-Lei 1.001/1969), em seu art. 2º, § 2º, trata da combinação de leis penais. Qual o posicionamento explícito adotado por essa legislação específica?",
      "alternativas": {
        "A": "Permite expressamente a combinação de leis, desde que para beneficiar o réu, adotando a teoria da ponderação diferenciada.",
        "B": "Proíbe expressamente a combinação de leis, alinhando-se à teoria da ponderação unitária ou global.",
        "C": "É omisso quanto à combinação de leis, deixando a critério da jurisprudência militar a decisão.",
        "D": "Permite a combinação de leis apenas em tempos de guerra, como exceção."
      },
      "resposta_correta": "B",
      "pagina_pdf": "14",
      "trecho_consulta": "Por fim, o Código Penal Militar (Decreto-lei 1.001/1969), em seu art. 2.º, § 2.º, proíbe expressamente a combinação de leis."
    },
    {
      "enunciado": "Se uma lei penal em branco ao avesso (preceito primário completo, secundário incompleto) tem seu complemento normativo (que define a sanção ou aspectos da punibilidade) revogado sem substituição, qual a consequência para a punibilidade dos fatos praticados sob sua égide?",
      "alternativas": {
        "A": "A punibilidade é mantida, aplicando-se por analogia a sanção de crime semelhante.",
        "B": "A revogação do complemento inviabiliza a punibilidade, pois, embora a conduta seja criminosa, torna-se impossível a imposição de pena devido à lacuna legislativa.",
        "C": "A punibilidade subsiste, devendo o juiz fixar a pena com base nos princípios gerais do direito e na culpabilidade do agente.",
        "D": "Aplica-se a sanção prevista na lei anterior ao complemento revogado, por ultratividade benéfica."
      },
      "resposta_correta": "B",
      "pagina_pdf": "16",
      "trecho_consulta": "Por fim, quanto a lei penal em branco ao avesso, o preceito primário é completo, mas o preceito secundário depende de complementação. Nesse caso, a revogação do complemento inviabiliza a punibilidade. Embora a conduta criminosa tenha perfeita descrição normativa, não será possível a imposição de pena, diante da lacuna legislativa a seu respeito."
    },
    {
      "enunciado": "Qual a principal diferença entre o 'crime progressivo' e a 'progressão criminosa' no contexto da aplicação do princípio da consunção?",
      "alternativas": {
        "A": "No crime progressivo há unidade de desígnios desde o início para o resultado mais grave, enquanto na progressão criminosa há uma alteração no dolo do agente, que inicialmente queria um resultado menos grave.",
        "B": "No crime progressivo o agente pratica vários crimes autônomos que são somados, enquanto na progressão criminosa um crime absorve o outro.",
        "C": "O crime progressivo sempre envolve crimes contra a pessoa, e a progressão criminosa, crimes contra o patrimônio.",
        "D": "Não há diferença substancial, sendo termos sinônimos para a mesma hipótese de absorção de um crime menos grave por um mais grave."
      },
      "resposta_correta": "A",
      "pagina_pdf": "19-20",
      "trecho_consulta": "Crime progressivo: quando o agente, almejando desde o início alcançar o resultado mais grave, pratica, a reiteração de atos, crescentes violações aos bens jurídicos. (...) Progressão criminosa: quando o agente pretende inicialmente produzir um resultado e, depois de alcança-lo, opta por prosseguir na prática ilícita e reinicia outra conduta, produzindo um evento mais grave. Pluralidade de designios, havendo alteração em seu dolo."
    },
    {
      "enunciado": "Considerando a teoria da atividade (Art. 4º CP) e a Súmula 711 do STF, se um crime permanente tem início sob a vigência da lei A (mais branda) e sua permanência cessa já sob a vigência da lei B (mais gravosa), qual lei será aplicada e por quê?",
      "alternativas": {
        "A": "Lei A, pois a conduta criminosa iniciou-se sob sua égide, aplicando-se a ultratividade da lei mais benéfica.",
        "B": "Lei B (mais gravosa), pois, conforme Súmula 711 do STF, a lei penal mais grave aplica-se se sua vigência é anterior à cessação da permanência, considerando-se o crime praticado também sob sua vigência.",
        "C": "Será feita uma combinação das leis, aplicando-se os aspectos mais favoráveis de A e B.",
        "D": "Lei A para o período anterior à lei B, e Lei B para o período posterior, cindindo-se a aplicação da pena."
      },
      "resposta_correta": "B",
      "pagina_pdf": "22",
      "trecho_consulta": "Por fim, quanto ao crime permanente e continuado, dispõe a Súmula 711 do Supremo Tribunal Federal: 'A lei penal mais grave aplica-se ao crime continuado ou ao crime permanente, se a sua vigência é anterior à cessação da continuidade ou da permanência'."
    },
    {
      "enunciado": "Segundo o princípio da personalidade ou nacionalidade ativa, previsto no Art. 7º, I, 'd' e II, 'b' do CP, em que circunstância um brasileiro que comete crime no exterior pode ser submetido à lei brasileira?",
      "alternativas": {
        "A": "Apenas se o crime também for punível no país onde foi praticado e a vítima for brasileira.",
        "B": "Independentemente da nacionalidade da vítima ou do bem jurídico ofendido, e mesmo que o crime não seja punível no local da prática, se for hipótese de extraterritorialidade incondicionada (ex: genocídio).",
        "C": "Somente se o crime for contra a vida ou a liberdade do Presidente da República.",
        "D": "Apenas se o brasileiro retornar ao Brasil e não tiver sido julgado no exterior, e o crime for punível em ambos os países."
      },
      "resposta_correta": "B",
      "pagina_pdf": "23-24",
      "trecho_consulta": "Princípio da personalidade ou da nacionalidade: autoriza a submissão à lei brasileira dos crimes praticados no estrangeiro por autor brasileiro (ativa) (...). De acordo com a personalidade ativa, o agente é punido de acordo com a lei brasileira, independentemente da nacionalidade do sujeito passivo e do bem jurídico ofendido. É previsto no art. 7.º, I, alínea 'd' ('quando o agente for brasileiro'), e também pelo inciso II, alínea 'b', do Código Penal."
    },
    {
      "enunciado": "O conceito de território brasileiro, para fins de aplicação da lei penal (Art. 5º CP), abrange o mar territorial. Qual a extensão desse mar territorial e qual a principal ressalva ao exercício da soberania brasileira nessa faixa?",
      "alternativas": {
        "A": "200 milhas marítimas, sem qualquer ressalva à soberania plena.",
        "B": "12 milhas marítimas de largura, sendo a soberania brasileira absoluta, impedindo qualquer trânsito de navios estrangeiros.",
        "C": "12 milhas marítimas de largura, medidas a partir da baixa-mar, não obstando o direito de passagem inocente de navios de outros Estados.",
        "D": "Até onde alcançam os rios e lagos internacionais que deságuam no oceano, com soberania exclusiva para exploração econômica."
      },
      "resposta_correta": "C",
      "pagina_pdf": "25",
      "trecho_consulta": "O mar territorial, ou marginal, que corre ao longo da costa como parte integrante do território brasileiro e que tem uma faixa de doze milhas marítimas de largura, medidas a partir da baixa-mar do litoral continental e insular brasileiro (...). O conceito de território não obsta, contudo, o direito de passagem inocente, isto é, a prerrogativa de navios mercantes ou militares de qualquer Estado de transitarem livremente pelo mar territorial..."
    },
    {
      "enunciado": "A teoria da ubiquidade, adotada pelo Art. 6º do CP para o lugar do crime, considera praticado o crime no lugar da ação/omissão ou do resultado. Contudo, para fins de competência interna nos crimes plurilocais (conduta em uma comarca, resultado em outra, dentro do Brasil), qual teoria geralmente prevalece segundo o Código de Processo Penal (Art. 70)?",
      "alternativas": {
        "A": "Teoria da atividade, fixando-se a competência onde a ação ou omissão ocorreu.",
        "B": "Teoria da ubiquidade, permitindo que qualquer das comarcas (da ação ou do resultado) seja competente, à escolha da acusação.",
        "C": "Teoria do resultado, determinando-se a competência, em regra, pelo lugar em que se consumar a infração.",
        "D": "Teoria do domicílio do réu, para facilitar sua defesa."
      },
      "resposta_correta": "C",
      "pagina_pdf": "51 (Gabarito Questão Desafio, citando art. 70 CPP)",
      "trecho_consulta": "A teoria da ubiquidade não se aplica nos casos de (...) crimes plurilocais (aqueles em que a conduta e o resultado ocorrem em comarcas diversas, mas no mesmo país). (...) Portanto, aplica-se a regra, para os crimes plurilocais, do artigo 70, caput, do Código de Processo Penal, ou seja, a competência será determinada pelo lugar em que se consumar a infração..."
    },
    {
      "enunciado": "Em caso de crime cometido por estrangeiro contra brasileiro, fora do Brasil (Art. 7º, §3º, CP), além das condições gerais da extraterritorialidade condicionada (Art. 7º, §2º), quais são as condições adicionais específicas para aplicação da lei penal brasileira?",
      "alternativas": {
        "A": "Entrada do agente no Brasil e ser o fato punível no local da prática.",
        "B": "Não ter sido pedida ou ter sido negada a extradição do agente estrangeiro E ter havido requisição do Ministro da Justiça.",
        "C": "O crime ser considerado hediondo pela lei brasileira E o agente possuir bens no Brasil para reparação do dano.",
        "D": "Haver tratado de cooperação penal com o país onde o crime ocorreu E o agente estrangeiro ser reincidente."
      },
      "resposta_correta": "B",
      "pagina_pdf": "29",
      "trecho_consulta": "De outro lado, no caso de crime cometido por estrangeiro contra brasileiro, fora do Brasil, exigem-se outras duas condições, além das anteriormente indicadas, quais sejam: 1. Não ter sido pedida ou ter sido negada a extradição; 2. Ter havido requisição do Ministro da Justiça."
    },
    {
      "enunciado": "A sentença penal estrangeira, para obrigar o condenado à reparação do dano no Brasil, necessita de homologação pelo STJ. Essa homologação ocorre de ofício ou depende de alguma iniciativa?",
      "alternativas": {
        "A": "Ocorre de ofício pelo STJ, assim que toma conhecimento da sentença estrangeira.",
        "B": "Depende de pedido da parte interessada (ex: a vítima ou seus herdeiros).",
        "C": "Depende de requisição do Ministro da Justiça, em qualquer caso.",
        "D": "Depende de acordo bilateral entre o Brasil e o país que proferiu a sentença."
      },
      "resposta_correta": "B",
      "pagina_pdf": "29",
      "trecho_consulta": "SENTENÇA PENAL PRECISA SER HOMOLOGADA PARA... Gerar EFEITOS CIVIS. A HOMOLOGAÇÃO DEPENDE DE... PEDIDO da parte interessada."
    },
    {
      "enunciado": "Um agente é condenado a uma pena de 3 anos, 2 meses e 15 dias de reclusão. Ao aplicar o Art. 11 do CP, como o juiz deve proceder em relação à fração de '15 dias'?",
      "alternativas": {
        "A": "Arredondar para 1 mês, totalizando 3 anos e 3 meses.",
        "B": "Desprezar os 15 dias, fixando a pena em 3 anos e 2 meses.",
        "C": "Converter os 15 dias em pena de multa.",
        "D": "Manter os 15 dias, pois o desprezo de frações se aplica apenas à pena de multa."
      },
      "resposta_correta": "B",
      "pagina_pdf": "30",
      "trecho_consulta": "Destarte, as frações de dia são desprezadas no momento de aplicação da pena privativa de liberdade."
    },
    {
      "enunciado": "Considere a Lei de Drogas (Lei 11.343/2006) como legislação especial. Se esta lei for omissa quanto a um critério de fixação da pena-base, qual norma deverá ser consultada para suprir tal omissão, de acordo com o Art. 12 do CP?",
      "alternativas": {
        "A": "O Código de Processo Penal, por se tratar de matéria processual.",
        "B": "As regras gerais do Código Penal, especificamente o Art. 59 do CP.",
        "C": "A jurisprudência consolidada dos tribunais superiores sobre a Lei de Drogas.",
        "D": "A lei penal especial mais próxima que trate de matéria semelhante, por analogia."
      },
      "resposta_correta": "B",
      "pagina_pdf": "30",
      "trecho_consulta": "Prevista no art. 12 do Código Penal: 'As regras gerais deste Código aplicam-se aos fatos incriminados por lei especial, se esta não dispuser de modo diverso'. Consagra o princípio da convivência das esferas autônomas, ou seja, o Código Penal será aplicado para toda legislação penal especial, é a regra geral."
    }
  ]
}

JSON 2 (contendo "perguntas_adicionais"):
{
  "perguntas_adicionais": [
    {
      "enunciado": "No que tange à revogação tácita de uma lei penal, qual a principal diferença de sua ocorrência em comparação com a revogação global, mesmo que ambas não sejam expressas?",
      "alternativas": {
        "A": "A revogação tácita ocorre apenas quando a lei nova é hierarquicamente superior, enquanto a global se dá entre leis de mesma hierarquia.",
        "B": "A revogação tácita anula apenas artigos específicos da lei anterior que sejam incompatíveis com a nova, enquanto a revogação global torna toda a lei anterior desnecessária por a nova regular inteiramente a matéria.",
        "C": "A revogação tácita sempre depende de manifestação judicial para ser reconhecida, ao passo que a global tem efeitos imediatos.",
        "D": "A revogação tácita afeta apenas a parte sancionatória da lei penal, enquanto a global atinge tanto o preceito primário quanto o secundário."
      },
      "resposta_correta": "B",
      "pagina_pdf": "8-9",
      "trecho_consulta": "Tácita: ocorre quando um lei se mostra incompatível com a anterior, apesar de não haver menção expressa à revogação. Global: ocorre quando a nova lei regula inteiramente a matéria disciplinada pela lei anterior, que passa a ser ultrapassada e desnecessária."
    },
    {
      "enunciado": "A respeito da *abolitio criminis temporária*, exemplificada no material com o Estatuto do Desarmamento, qual a sua característica distintiva em relação à *abolitio criminis* comum?",
      "alternativas": {
        "A": "A *abolitio criminis temporária* só se aplica a crimes de menor potencial ofensivo, enquanto a comum pode incidir sobre qualquer delito.",
        "B": "A *abolitio criminis temporária* prevê a descriminalização transitória de uma conduta, geralmente condicionada a certas ações do agente dentro de um prazo, enquanto a comum é uma supressão definitiva da figura criminosa do ordenamento.",
        "C": "A *abolitio criminis temporária* não extingue os efeitos penais da condenação, apenas os suspende, diferentemente da comum.",
        "D": "A *abolitio criminis temporária* não precisa de lei para ser instituída, bastando portaria ministerial, ao contrário da comum."
      },
      "resposta_correta": "B",
      "pagina_pdf": "10",
      "trecho_consulta": "Além disso, é possível a o reconhecimento da abolitio criminis temporária, nas situações em que a lei prevê a descriminalização transitória de uma conduta. Exemplo recente foi os arts. 30 a 32 da Lei 10.826/2003 - Estatuto do Desarmamento..."
    },
    {
      "enunciado": "A expressão 'de qualquer modo favorecer o agente', contida no parágrafo único do Art. 2º do CP referente à *lex mitior*, deve ser interpretada de forma restritiva ou ampliativa? Qual exemplo ilustra uma interpretação ampliativa?",
      "alternativas": {
        "A": "Restritiva, limitando-se a casos de redução da pena cominada, não abrangendo, por exemplo, a criação de novas causas de diminuição.",
        "B": "Restritiva, aplicando-se apenas se a lei nova expressamente se declarar mais benéfica.",
        "C": "Ampliativa, abrangendo qualquer alteração que beneficie o réu, como a exclusão de uma qualificadora, a criação de uma causa de diminuição de pena, ou a alteração do prazo prescricional para menor.",
        "D": "Ampliativa, mas apenas para crimes sem violência ou grave ameaça, não se aplicando a crimes hediondos."
      },
      "resposta_correta": "C",
      "pagina_pdf": "11",
      "trecho_consulta": "A expressão 'de qualquer modo' deve ser interpretada de forma ampliativa, ou seja, excluísse uma qualificadora, cria-se uma causa de diminuição etc."
    },
    {
      "enunciado": "O fenômeno da ultratividade da lei penal mais benéfica ocorre quando:",
      "alternativas": {
        "A": "Uma lei mais grave entra em vigor e retroage para alcançar fatos praticados sob a lei anterior mais branda.",
        "B": "Uma lei, mesmo após revogada por outra mais prejudicial ao agente, continua a reger os fatos praticados durante sua vigência por ser mais favorável.",
        "C": "Uma lei nova mais benéfica é aplicada a fatos futuros, não alcançando os fatos pretéritos.",
        "D": "Uma lei temporária continua a produzir efeitos mesmo após seu prazo, independentemente de ser benéfica ou maléfica."
      },
      "resposta_correta": "B",
      "pagina_pdf": "11",
      "trecho_consulta": "Além disso, é possível a ocorrência do fenômeno da Ultratividade da lei mais benéfica. Ora, ocorre quando o crime foi praticado durante a vigência de uma lei, posteriormente revogada por outra prejudicial ao agente. Subsistem, no caso, os efeitos da lei anterior, mais favorável."
    },
    {
      "enunciado": "A posição atual e predominante do Supremo Tribunal Federal e do Superior Tribunal de Justiça (conforme Súmula 501 STJ) sobre a combinação de leis penais (*lex tertia*) é:",
      "alternativas": {
        "A": "Pela admissibilidade irrestrita, com base na teoria da ponderação diferenciada, visando sempre o maior benefício ao réu.",
        "B": "Pela inadmissibilidade, acolhendo a teoria da ponderação unitária ou global, que veda a criação de uma terceira lei pelo julgador, devendo este aplicar uma das leis integralmente.",
        "C": "Pela admissibilidade apenas em casos de crimes de tráfico de drogas, como exceção à regra geral de inadmissibilidade.",
        "D": "Pela admissibilidade condicionada à existência de lacuna na lei e ausência de ofensa à separação dos poderes."
      },
      "resposta_correta": "B",
      "pagina_pdf": "14",
      "trecho_consulta": "Entretanto, a inovação jurisprudencial não foi unânime, pois o Supremo Tribunal Federal rapidamente retomou sua posição tradicional, voltando a acolher a teoria da ponderação unitária, ou global, de modo a repelir a combinação de leis penais. Este é o entendimento atualmente adotado pela Corte Suprema, contrário à combinação de leis penais: (...) Súmula n.º 501, STJ: É cabível a aplicação retroativa da Lei n. 11.343/2006, desde que o resultado da incidência das suas disposições, na integra, seja mais favorável ao réu do que o advindo da aplicação da Lei n. 6.368/1976, sendo vedada a combinação de leis."
    },
    {
      "enunciado": "No contexto do conflito aparente de normas, o princípio da subsidiariedade tácita difere da expressa porque:",
      "alternativas": {
        "A": "Na tácita, a norma principal sempre absorve a subsidiária, enquanto na expressa ocorre o inverso.",
        "B": "Na tácita, a relação de dependência é identificada pelo intérprete através da análise dos bens jurídicos e da gravidade das condutas, sem que a lei contenha uma cláusula de exclusão; na expressa, a própria lei se declara subsidiária.",
        "C": "A subsidiariedade tácita só se aplica entre crimes da mesma espécie, e a expressa entre crimes de espécies diferentes.",
        "D": "A subsidiariedade tácita é uma criação doutrinária não aceita pela jurisprudência, que apenas reconhece a expressa."
      },
      "resposta_correta": "B",
      "pagina_pdf": "19",
      "trecho_consulta": "Subsidiariedade expressa ou explícita: a própria norma penal se declara subsidiária... Subsidiariedade tácita ou implícita: a norma penal não se declara subsidiária, mas esta circunstância é extraída da análise do caso concreto."
    },
    {
      "enunciado": "O crime complexo, como o roubo (furto + ameaça/lesão), é uma hipótese de aplicação do princípio da consunção. Como se dá essa absorção?",
      "alternativas": {
        "A": "Os crimes componentes (furto e ameaça) são punidos em concurso material com o roubo.",
        "B": "O crime complexo (roubo) absorve os delitos autônomos que compõem sua estrutura típica, respondendo o agente apenas pelo crime complexo.",
        "C": "O crime menos grave (ameaça) absorve o mais grave (furto) dentro da estrutura do roubo.",
        "D": "Aplica-se apenas o crime componente que tiver a pena mais alta, desprezando-se o outro."
      },
      "resposta_correta": "B",
      "pagina_pdf": "19",
      "trecho_consulta": "Crime complexo: da fusão de dois ou mais crimes, que passam a desempenhar a função de elementares ou circunstâncias daquele, tal como se dá no roubo, união do furto e ameaça/lesão corporal. O crime complexo absorve os delitos autônomos que compõe a sua estrutura típica."
    },
    {
      "enunciado": "Quanto aos atos impuníveis (anteriores, simultâneos e posteriores) no âmbito da consunção, como se caracterizam os atos anteriores impuníveis?",
      "alternativas": {
        "A": "São condutas praticadas após a consumação do crime principal para assegurar sua vantagem, e são punidas autonomamente.",
        "B": "São atos que funcionam como meios de execução do tipo principal, ficando por este absorvidos, desde que não constituam crimes mais graves.",
        "C": "São atos praticados concomitantemente ao crime principal, mas que possuem punição independente por protegerem bens jurídicos diversos.",
        "D": "São atos que, embora anteriores, não guardam qualquer relação de causalidade com o crime principal, sendo sempre irrelevantes."
      },
      "resposta_correta": "B",
      "pagina_pdf": "20",
      "trecho_consulta": "Atos impuníveis: são divididos em três grupos: anteriores, simultâneos e posteriores. Os anteriores são os que funcionam como meios de execução do tipo principal, ficando por estes absorvidos."
    },
    {
      "enunciado": "O princípio da alternatividade própria (ou nos tipos mistos alternativos) implica que:",
      "alternativas": {
        "A": "Se o agente realizar mais de um núcleo do tipo contra objetos materiais distintos, responderá por um único crime devido à alternatividade.",
        "B": "A realização de múltiplos núcleos do mesmo tipo penal contra o mesmo objeto material configura um único crime, pois as diversas condutas são fungíveis dentro do tipo.",
        "C": "O agente pode escolher por qual núcleo do tipo penal deseja ser processado, caso pratique mais de um.",
        "D": "A alternatividade própria é um princípio que soluciona o conflito entre duas leis distintas que preveem o mesmo fato, aplicando-se a mais específica."
      },
      "resposta_correta": "B",
      "pagina_pdf": "20",
      "trecho_consulta": "Alternatividade Própria: ocorre nos tipos mistos alternativos (ação múltipla ou conteúdo variado), são aqueles que possuem dois ou mais núcleos e se o agente realizar mais de um núcleo, contra o mesmo objeto material, estará realizado um único crime."
    },
    {
      "enunciado": "Existe previsão legal expressa no Código Penal brasileiro para a solução do conflito aparente de leis penais e os princípios que o regem?",
      "alternativas": {
        "A": "Sim, o Código Penal dedica um capítulo específico para tratar do conflito aparente de normas e elenca os princípios da especialidade, subsidiariedade e consunção.",
        "B": "Não, o Código Penal não disciplinou expressamente o assunto, sendo os princípios solucionadores construções doutrinárias e jurisprudenciais.",
        "C": "Sim, o Art. 1º do Código Penal estabelece a prevalência da norma mais específica em caso de conflito.",
        "D": "Não, mas a Lei de Introdução às Normas do Direito Brasileiro (LINDB) traz as regras para solucionar esses conflitos no âmbito penal."
      },
      "resposta_correta": "B",
      "pagina_pdf": "20",
      "trecho_consulta": "O conflito aparente de leis penais não tem previsão legal. O Código Penal não disciplinou expressamente o assunto."
    },
    {
      "enunciado": "No crime habitual, caracterizado pela reiteração de condutas, se durante a prática delitiva sobrevém lei nova mais severa e o agente persiste na conduta criminosa sob a égide da nova lei, qual lei se aplica?",
      "alternativas": {
        "A": "Aplica-se a lei anterior mais branda, pois o início da atividade criminosa se deu sob sua vigência.",
        "B": "Aplica-se a nova lei mais severa a toda a conduta habitual, inclusive aos atos praticados antes de sua vigência, por ficção jurídica.",
        "C": "Aplica-se a nova lei mais severa, pois a reiteração da conduta sob seu império configura a prática do crime também sob a nova legislação.",
        "D": "Cinde-se a aplicação: a lei antiga para os atos anteriores e a nova para os atos posteriores à sua vigência, calculando-se a pena proporcionalmente."
      },
      "resposta_correta": "C",
      "pagina_pdf": "21",
      "trecho_consulta": "No crime habitual em que haja sucessão de leis, deve ser aplicada a nova, ainda que mais severa, se o agente insistir em reiterar a conduta criminosa."
    },
    {
      "enunciado": "O Art. 5º, §2º, do CP estabelece a aplicabilidade da lei brasileira a crimes praticados a bordo de aeronaves ou embarcações estrangeiras de propriedade privada sob certas condições. Quais são essas condições?",
      "alternativas": {
        "A": "Apenas se o crime for cometido contra brasileiro ou por brasileiro, independentemente da localização da aeronave/embarcação.",
        "B": "Se as aeronaves estiverem em pouso no território nacional ou em voo no espaço aéreo correspondente, e as embarcações em porto ou mar territorial do Brasil.",
        "C": "Somente se houver tratado de reciprocidade com o país de bandeira da aeronave/embarcação.",
        "D": "Independentemente de sua localização, desde que o comandante solicite a intervenção das autoridades brasileiras."
      },
      "resposta_correta": "B",
      "pagina_pdf": "23",
      "trecho_consulta": "§ 2º - É também aplicável a lei brasileira aos crimes praticados a bordo de aeronaves ou embarcações estrangeiras de propriedade privada, achando-se aquelas em pouso no território nacional ou em vôo no espaço aéreo correspondente, e estas em porto ou mar territorial do Brasil."
    },
    {
      "enunciado": "O princípio da personalidade passiva, como forma de extraterritorialidade, permite a aplicação da lei brasileira quando:",
      "alternativas": {
        "A": "O agente do crime é brasileiro, não importando a nacionalidade da vítima.",
        "B": "O crime é cometido no Brasil por agente estrangeiro contra vítima estrangeira.",
        "C": "A vítima do crime é brasileira, mesmo que o crime tenha sido cometido no exterior por agente estrangeiro, observadas as condições legais (ex: Art. 7º, §3º CP).",
        "D": "O agente é domiciliado no Brasil, ainda que estrangeiro, e o crime ocorre no exterior."
      },
      "resposta_correta": "C",
      "pagina_pdf": "24",
      "trecho_consulta": "Já o princípio da personalidade passiva aplica-se nos casos em que a vítima é brasileira. O autor do delito que se encontrar em território brasileiro, embora seja estrangeiro, deverá ser julgado de acordo com a nossa lei penal. É adotado pelo art. 7.º, § 3.º, do Código Penal."
    },
    {
      "enunciado": "O princípio da defesa (real ou da proteção) fundamenta a extraterritorialidade da lei brasileira em quais situações principais?",
      "alternativas": {
        "A": "Quando o crime é cometido por brasileiro no exterior contra qualquer bem jurídico.",
        "B": "Quando o crime é praticado no estrangeiro, por qualquer agente, e ofende bens jurídicos relevantes para o Estado brasileiro, como a vida do Presidente, o patrimônio público ou a fé pública.",
        "C": "Quando a vítima do crime é brasileira e o delito ocorre em país que não o pune adequadamente.",
        "D": "Quando o Brasil se obriga, por tratado, a reprimir determinado crime, independentemente do local ou da nacionalidade do agente/vítima."
      },
      "resposta_correta": "B",
      "pagina_pdf": "24",
      "trecho_consulta": "Princípio da defesa, real ou da proteção: permite submeter à lei penal brasileira os crimes praticados no estrangeiro que ofendam bens jurídicos pertencentes ao Brasil, qualquer que seja a nacionalidade do agente e o local do delito. Adotado pelo Código Penal, em seu art. 7.º, I, alíneas 'a', 'b' e 'c'..."
    },
    {
      "enunciado": "O princípio da justiça universal (ou cosmopolita) autoriza a aplicação da lei penal brasileira a crimes que, por sua natureza, afetam a comunidade internacional. Qual hipótese do Art. 7º, II, do CP exemplifica sua adoção?",
      "alternativas": {
        "A": "Crimes praticados por brasileiro no exterior (Art. 7º, II, 'b').",
        "B": "Crimes cometidos em aeronaves ou embarcações brasileiras privadas no estrangeiro e aí não julgados (Art. 7º, II, 'c').",
        "C": "Os crimes que, por tratado ou convenção, o Brasil se obrigou a reprimir (Art. 7º, II, 'a').",
        "D": "Crimes contra a administração pública, por quem está a seu serviço, mesmo no exterior (Art. 7º, I, 'c')."
      },
      "resposta_correta": "C",
      "pagina_pdf": "24",
      "trecho_consulta": "Princípio da justiça universal: (...) Fundamenta-se no dever de solidariedade na repressão de certos delitos cuja punição interessa a todos os povos. É adotado no art. 7.º, II, 'a', do Código Penal: 'os crimes que, por tratado ou convenção, o Brasil se obrigou a reprimir'."
    },
    {
      "enunciado": "O princípio da representação (pavilhão ou bandeira) aplica-se especificamente a qual situação de extraterritorialidade condicionada, prevista no Art. 7º, II, 'c', do CP?",
      "alternativas": {
        "A": "Crimes cometidos por brasileiros no exterior, independentemente do local exato.",
        "B": "Crimes contra a vida ou liberdade do Presidente da República, onde quer que ocorram.",
        "C": "Crimes cometidos em aeronaves ou embarcações brasileiras, mercantes ou de propriedade privada, quando em território estrangeiro e aí não sejam julgados.",
        "D": "Crimes de genocídio, quando o agente for brasileiro ou domiciliado no Brasil."
      },
      "resposta_correta": "C",
      "pagina_pdf": "24",
      "trecho_consulta": "Princípio da representação: também denominado princípio do pavilhão, da bandeira, subsidiário ou da substituição. Segundo esse princípio, deve ser aplicada a lei penal brasileira aos crimes cometidos em aeronaves ou embarcações brasileiras, mercantes ou de propriedade privada, quando estiverem em território estrangeiro e aí não sejam julgados. É adotado pelo art. 7.º, II, 'c', do Código Penal."
    },
    {
      "enunciado": "Além do espaço territorial físico e do mar territorial, o que mais o conceito de território brasileiro abrange para fins de aplicação da lei penal, segundo a descrição de Cleber Masson citada no material?",
      "alternativas": {
        "A": "Apenas as embaixadas e consulados brasileiros no exterior.",
        "B": "A plataforma continental, o espaço aéreo correspondente, e navios e aeronaves públicas onde quer que se encontrem, além de navios/aeronaves particulares em alto-mar ou espaço aéreo correspondente.",
        "C": "Qualquer local onde um cidadão brasileiro esteja presente, por extensão da soberania pessoal.",
        "D": "Exclusivamente o solo continental e as ilhas, excluindo-se o mar e o espaço aéreo por serem de uso internacional."
      },
      "resposta_correta": "B",
      "pagina_pdf": "25",
      "trecho_consulta": "O território brasileiro compreende (Cleber Masson): O espaço territorial delimitado... O mar territorial... A plataforma continental... O espaço aéreo... Os navios e aeronaves, de natureza particular, em alto-mar ou no espaço aéreo correspondente ao alto-mar; Os navios e aeronaves, de natureza pública, onde quer que se encontrem..."
    },
    {
      "enunciado": "A teoria da ubiquidade, adotada pelo Art. 6º do CP para o lugar do crime, tem especial relevância para os chamados 'crimes à distância' ou 'de espaço máximo'. O que caracteriza esses crimes?",
      "alternativas": {
        "A": "São crimes em que a conduta e o resultado ocorrem no mesmo país, mas em comarcas muito distantes entre si.",
        "B": "São crimes em que a conduta é praticada em um país e o resultado ocorre em outro país diverso.",
        "C": "São crimes cometidos exclusivamente por meio da internet, transcendendo fronteiras físicas.",
        "D": "São crimes cuja investigação é extremamente complexa devido à distância entre o local do fato e a sede do juízo."
      },
      "resposta_correta": "B",
      "pagina_pdf": "26",
      "trecho_consulta": "O art. 6º do CP aplica-se apenas aos crimes à distância, também conhecidos como crimes de espaço máximo, em que a conduta e o resultado ocorrem em países diversos."
    },
    {
      "enunciado": "Uma das exceções à aplicação da teoria da ubiquidade do Art. 6º CP para fins de definição da lei aplicável ou competência refere-se aos atos infracionais. Qual critério o Estatuto da Criança e do Adolescente (Lei 8.069/1990, Art. 147, §1º) estabelece para determinar a competência nesses casos?",
      "alternativas": {
        "A": "O lugar onde o resultado do ato infracional se produziu.",
        "B": "O lugar da ação ou da omissão, independentemente do resultado (teoria da atividade).",
        "C": "Tanto o lugar da ação/omissão quanto o do resultado (teoria da ubiquidade), à escolha do representante do Ministério Público.",
        "D": "O domicílio dos pais ou responsável pelo adolescente."
      },
      "resposta_correta": "B",
      "pagina_pdf": "27",
      "trecho_consulta": "Atos infracionais: para os crimes ou contravenções penais praticados por crianças e adolescentes, será competente a autoridade do lugar da ação ou da omissão (Lei 8.069/1990 ECA, art. 147, § 1.°)."
    },
    {
      "enunciado": "Conforme o Art. 2º do Decreto-Lei nº 3.688/1941 (Lei das Contravenções Penais), qual é a regra de aplicabilidade da lei brasileira às contravenções penais praticadas no estrangeiro?",
      "alternativas": {
        "A": "Aplica-se a lei brasileira, desde que o autor da contravenção seja brasileiro e retorne ao Brasil.",
        "B": "Não se admite a aplicação da lei penal brasileira às contravenções penais praticadas no estrangeiro.",
        "C": "Aplica-se a lei brasileira apenas se a contravenção também for punível no país onde foi praticada.",
        "D": "Aplica-se a lei brasileira se a contravenção for cometida contra patrimônio público brasileiro no exterior."
      },
      "resposta_correta": "B",
      "pagina_pdf": "27",
      "trecho_consulta": "Não se admite a aplicação da lei penal brasileira às contravenções penais praticadas no estrangeiro, de acordo com a regra estabelecida pelo art. 2.º do Decreto-lei 3.688/1941 Lei das Contravenções Penais."
    },
    {
      "enunciado": "Dentre as hipóteses de extraterritorialidade incondicionada (Art. 7º, I, CP), qual delas se refere a crimes contra bens jurídicos da administração pública brasileira?",
      "alternativas": {
        "A": "Crimes contra a vida ou a liberdade do Presidente da República.",
        "B": "Crimes de genocídio, quando o agente for brasileiro ou domiciliado no Brasil.",
        "C": "Crimes contra a administração pública, por quem está a seu serviço, e crimes contra o patrimônio ou a fé pública da União, DF, Estados, Municípios, ou entidades da administração indireta.",
        "D": "Crimes que, por tratado ou convenção, o Brasil se obrigou a reprimir."
      },
      "resposta_correta": "C",
      "pagina_pdf": "28",
      "trecho_consulta": "Art. 7º Ficam sujeitos à lei brasileira, embora cometidos no estrangeiro: I - os crimes: (...) b) contra o patrimônio ou a fé pública da União, do Distrito Federal, de Estado, de Território, de Município, de empresa pública, sociedade de economia mista, autarquia ou fundação instituída pelo Poder Público; c) contra a administração pública, por quem está a seu serviço;"
    },
    {
      "enunciado": "Na extraterritorialidade condicionada, uma das condições é que o crime esteja 'incluído entre aqueles pelos quais a lei brasileira autoriza a extradição' (Art. 7º, §2º, 'c', CP). Qual a implicação lógica dessa condição?",
      "alternativas": {
        "A": "Significa que o Brasil só pode punir crimes que ele próprio extraditaria, indicando uma reciprocidade de gravidade delitiva.",
        "B": "Impede que o Brasil julgue crimes políticos ou de opinião cometidos no exterior por brasileiros.",
        "C": "Exige que o país onde o crime ocorreu formalmente solicite a extradição do agente ao Brasil.",
        "D": "Limita a aplicação da lei brasileira a crimes que tenham pena mínima superior a 2 anos, que é o critério para extradição."
      },
      "resposta_correta": "A",
      "pagina_pdf": "29",
      "trecho_consulta": "c) estar o crime incluído entre aqueles pelos quais a lei brasileira autoriza a extradição;"
    },
    {
      "enunciado": "Em que situação específica a homologação de sentença penal estrangeira pelo STJ depende de 'pedido da parte interessada', conforme o Art. 9º do CP?",
      "alternativas": {
        "A": "Para sujeitar o condenado a medida de segurança.",
        "B": "Para gerar efeitos civis, como a obrigação de reparar o dano ou a restituições.",
        "C": "Para que a pena cumprida no exterior seja computada na pena brasileira.",
        "D": "Para reconhecer a reincidência do agente em território nacional."
      },
      "resposta_correta": "B",
      "pagina_pdf": "29",
      "trecho_consulta": "SENTENÇA PENAL PRECISA SER HOMOLOGADA PARA... Gerar EFEITOS CIVIS. A HOMOLOGAÇÃO DEPENDE DE... PEDIDO da parte interessada."
    },
    {
      "enunciado": "Um prazo decadencial para oferecimento de queixa-crime, que é de natureza penal, encerra-se em um domingo. Considerando a regra do Art. 10 do CP sobre contagem de prazos penais, qual o último dia para o exercício desse direito?",
      "alternativas": {
        "A": "O próprio domingo, pois o prazo penal é fatal e improrrogável.",
        "B": "A segunda-feira subsequente, por aplicação subsidiária das regras processuais civis.",
        "C": "A sexta-feira anterior ao domingo, pois o direito deve ser exercido antes do vencimento do prazo improrrogável.",
        "D": "O sábado, se houver expediente forense; caso contrário, a sexta-feira."
      },
      "resposta_correta": "C",
      "pagina_pdf": "30",
      "trecho_consulta": "OS PRAZOS PENAIS SÃO IMPRORROGÁVEIS, MESMO QUE TERMINEM EM SÁBADOS, DOMINGOS OU FERIADOS. Assim, se o prazo decadencial para o oferecimento de queixa-crime encerrar em um domingo, o titular do direito de queixa ou de representação deverá exercê-lo até a sexta-feira anterior."
    },
    {
      "enunciado": "No que se refere à aplicação da lei penal no tempo, se uma lei nova diminui a pena de um crime, mas o agente já iniciou o cumprimento da pena fixada com base na lei antiga (mais gravosa) após o trânsito em julgado, qual o procedimento correto?",
      "alternativas": {
        "A": "A lei nova não se aplica, pois a sentença já transitou em julgado e a execução foi iniciada, prevalecendo a coisa julgada.",
        "B": "A lei nova é aplicada retroativamente pelo juízo da execução, que fará a adequação da pena, mesmo com a execução em curso (Súmula 611 STF).",
        "C": "A aplicação da lei nova dependerá de ação revisional proposta pela defesa perante o tribunal superior.",
        "D": "A lei nova só se aplicará se o agente ainda não tiver cumprido 1/3 da pena imposta pela lei antiga."
      },
      "resposta_correta": "B",
      "pagina_pdf": "12",
      "trecho_consulta": "Art. 2º, parágrafo único, Código Penal - A lei posterior, que de qualquer modo favorecer o agente, aplica-se aos fatos anteriores, ainda que decididos por sentença condenatória transitada em julgado. (...) Súmula n.º 611, STF. Transitada em julgado a sentença condenatória, compete ao juízo das execuções a aplicação de lei mais benéfica."
    },
    {
      "enunciado": "Considere um crime de sequestro (crime permanente) iniciado sob a lei X, que previa pena de 2 a 8 anos. Durante o cativeiro, entra em vigor a lei Y, que eleva a pena para 5 a 10 anos. A vítima é libertada já na vigência da lei Y. Qual pena será considerada para o agente, conforme a Súmula 711 do STF?",
      "alternativas": {
        "A": "A pena da lei X (2 a 8 anos), pois foi a lei vigente no início da execução do crime.",
        "B": "A pena da lei Y (5 a 10 anos), pois sua vigência é anterior à cessação da permanência.",
        "C": "Uma média entre as penas das leis X e Y, por critério de equidade.",
        "D": "A pena da lei X, a menos que a lei Y expressamente determine sua aplicação a crimes em curso."
      },
      "resposta_correta": "B",
      "pagina_pdf": "11",
      "trecho_consulta": "Os crimes permanente e continuado têm uma especificidade, constante na súmula 711 do STF: 'A lei penal mais grave aplica-se ao crime continuado ou ao crime permanente, se a sua vigência é anterior à cessação da continuidade ou da permanência'."
    },
    {
      "enunciado": "A irretroatividade de novo entendimento jurisprudencial mais gravoso (STF HC 161452 AgR) significa que:",
      "alternativas": {
        "A": "Uma mudança na interpretação da lei penal pelos tribunais, se mais severa ao réu, só se aplica a fatos ocorridos após essa nova orientação.",
        "B": "Uma nova súmula vinculante que agrave a situação do réu não pode retroagir para atingir atos pretéritos.",
        "C": "A proibição de retroatividade da lei penal mais gravosa (Art. 5º, XL, CF) não se estende às mudanças de interpretação jurisprudencial, que podem ser aplicadas a fatos passados mesmo que desfavoráveis.",
        "D": "Apenas leis em sentido estrito são irretroativas se mais gravosas; a jurisprudência, por não ser lei, pode retroagir livremente."
      },
      "resposta_correta": "C",
      "pagina_pdf": "13",
      "trecho_consulta": "Os preceitos constitucionais relativos à aplicação retroativa da norma penal benéfica, bem como à irretroatividade da norma mais grave ao acusado (art. 5°, XL, da Constituição Federal), são inaplicáveis aos precedentes jurisprudenciais. STF. 1ª Turma. HC 161452 AgR..."
    },
    {
      "enunciado": "Se um agente furta um objeto (Art. 155 CP) e, para assegurar a posse da coisa, emprega violência contra a vítima que tenta recuperá-la, transformando a conduta em roubo impróprio (Art. 157, §1º CP), qual princípio de solução de conflito aparente de normas se aplica?",
      "alternativas": {
        "A": "Especialidade, pois o roubo impróprio é uma forma especial de furto.",
        "B": "Subsidiariedade, pois o furto é subsidiário em relação ao roubo.",
        "C": "Consunção, pois o roubo impróprio (fato mais complexo e grave) absorve o furto inicial e a violência subsequente como fases de sua constituição.",
        "D": "Alternatividade, pois o agente responderia por furto ou por roubo, conforme o momento da violência."
      },
      "resposta_correta": "C",
      "pagina_pdf": "19 (por analogia à estrutura do crime complexo e progressão)",
      "trecho_consulta": "Princípio da consunção: o fato mais amplo e grave absorve os demais fatos menos amplos e graves. (...) Crime complexo: da fusão de dois ou mais crimes... (O roubo impróprio, embora não seja um crime complexo clássico no sentido de fusão de tipos autônomos preexistentes na sua definição, envolve uma progressão da conduta de furto para roubo mediante violência/grave ameaça, sendo a consunção o princípio aplicável para que o agente responda apenas pelo roubo)."
    },
    {
      "enunciado": "Qual o critério adotado pelo Código Penal para definir o 'tempo do crime' em relação a um menor que pratica um ato infracional análogo a crime aos 17 anos, 11 meses e 29 dias, cujo resultado (morte da vítima) ocorre quando ele já completou 18 anos?",
      "alternativas": {
        "A": "Teoria do resultado: considera-se a data da morte da vítima; logo, responderia como adulto.",
        "B": "Teoria da ubiquidade: considera-se tanto a data da conduta quanto a do resultado; por ter completado 18 antes do resultado, responde como adulto.",
        "C": "Teoria da atividade: considera-se o momento da ação ou omissão; logo, por ser menor à época da conduta, submete-se ao ECA.",
        "D": "Teoria da intenção: avalia-se a capacidade de entendimento no momento do planejamento do ato, independentemente da idade na conduta ou resultado."
      },
      "resposta_correta": "C",
      "pagina_pdf": "21",
      "trecho_consulta": "O Código Penal adotou a TEORIA DA ATIVIDADE (tempus regit actum), em seu Art. 4.°: 'Considera-se praticado o crime no momento da ação ou omissão, AINDA QUE outro seja o momento do resultado'. (...) Exemplo: 'A', com a idade de 17 anos, 11 meses e 20 dias, efetua disparos... Não se aplicará ao autor o Código Penal, em face de sua inimputabilidade ao tempo do crime..."
    },
    {
      "enunciado": "A aplicação da lei penal brasileira a crimes cometidos no espaço aéreo sobrejacente ao mar territorial brasileiro fundamenta-se em qual aspecto da territorialidade?",
      "alternativas": {
        "A": "Território por extensão, aplicando-se apenas se a aeronave for brasileira.",
        "B": "Soberania do Estado sobre seu espaço aéreo, que é parte integrante do território nacional, conforme a teoria da absoluta soberania do país subjacente.",
        "C": "Princípio da justiça universal, se o crime afetar a segurança da aviação internacional.",
        "D": "Princípio da representação, se a aeronave for de propriedade de empresa com sede no Brasil."
      },
      "resposta_correta": "B",
      "pagina_pdf": "25",
      "trecho_consulta": "O espaço aéreo, compreendido como a dimensão estatal da altitude. Em relação ao domínio aéreo, adotou-se a teoria da absoluta soberania do país subjacente, pela qual o Brasil exerce completa e exclusiva soberania sobre o espaço aéreo acima de seu território e mar territorial (art. 11 da Lei 7.565/1986);"
    },
    {
      "enunciado": "A teoria da ubiquidade para o lugar do crime (Art. 6º CP) não se aplica para definir a competência nos crimes de competência do Juizado Especial Criminal (Lei 9.099/95). Qual teoria é adotada pelo Art. 63 da Lei 9.099/95 para este fim?",
      "alternativas": {
        "A": "Teoria do resultado, sendo competente o juizado do local onde ocorreu o resultado da infração.",
        "B": "Teoria da atividade, determinando-se a competência pelo lugar em que foi praticada a infração penal.",
        "C": "Teoria da ubiquidade, mantendo a regra do Código Penal.",
        "D": "Teoria do domicílio da vítima, para facilitar o acesso à justiça."
      },
      "resposta_correta": "B",
      "pagina_pdf": "27",
      "trecho_consulta": "Infrações penais de menor potencial ofensivo: o art. 63 da Lei 9.099/1995 adotou a teoria da atividade: 'A competência do Juizado será determinada pelo lugar em que foi praticada a infração penal'."
    },
    {
      "enunciado": "Um crime de genocídio é cometido no exterior por um agente estrangeiro, porém domiciliado no Brasil. Qual princípio de extraterritorialidade permite a aplicação da lei brasileira, e essa extraterritorialidade é condicionada ou incondicionada?",
      "alternativas": {
        "A": "Princípio da justiça universal; extraterritorialidade condicionada.",
        "B": "Princípio do domicílio (aplicado ao agente) e da defesa (pela natureza do crime); extraterritorialidade incondicionada, conforme Art. 7º, I, 'd', CP.",
        "C": "Princípio da personalidade ativa; extraterritorialidade condicionada à entrada do agente no Brasil.",
        "D": "Princípio da representação; extraterritorialidade incondicionada se houver tratado específico."
      },
      "resposta_correta": "B",
      "pagina_pdf": "24 (Princípio do Domicílio) e 28 (Art. 7º, I, d)",
      "trecho_consulta": "Princípio do domicílio: o autor do crime deve ser julgado em consonância com a lei do país em que for domiciliado... Previsto no art. 7.º, I, alínea 'd' ('domiciliado no Brasil'), do Código Penal, no tocante ao crime de genocídio... (E o Art. 7º, I elenca hipóteses de extraterritorialidade incondicionada)."
    },
    {
      "enunciado": "Se um brasileiro pratica um crime no exterior que também é punível lá, e posteriormente ingressa no Brasil, mas já foi absolvido no país estrangeiro por sentença transitada em julgado, a lei brasileira ainda poderá ser aplicada sob a hipótese de extraterritorialidade condicionada (Art. 7º, II, 'b' c/c §2º)?",
      "alternativas": {
        "A": "Sim, pois a absolvição no estrangeiro não impede novo julgamento no Brasil, pela soberania nacional.",
        "B": "Não, pois uma das condições para a extraterritorialidade condicionada é 'não ter sido o agente absolvido no estrangeiro' (Art. 7º, §2º, 'd').",
        "C": "Sim, mas apenas se o Ministério Público brasileiro discordar dos fundamentos da absolvição estrangeira.",
        "D": "Depende: se o crime for grave, como tráfico de drogas, a absolvição estrangeira pode ser desconsiderada."
      },
      "resposta_correta": "B",
      "pagina_pdf": "29",
      "trecho_consulta": "d) não ter sido o agente absolvido no estrangeiro ou não ter aí cumprido a pena;"
    },
    {
      "enunciado": "Qual o efeito de uma pena de multa cumprida integralmente no estrangeiro sobre uma pena de multa idêntica imposta no Brasil pelo mesmo crime, conforme o Art. 8º do CP?",
      "alternativas": {
        "A": "A pena de multa cumprida no estrangeiro atenua a multa brasileira.",
        "B": "A pena de multa cumprida no estrangeiro é nela computada, resultando na extinção da exigibilidade da multa brasileira.",
        "C": "A pena de multa cumprida no estrangeiro é irrelevante, devendo a multa brasileira ser paga integralmente.",
        "D": "A pena de multa cumprida no estrangeiro só é considerada se o valor for superior ao da multa brasileira."
      },
      "resposta_correta": "B",
      "pagina_pdf": "29",
      "trecho_consulta": "Conforme o Art. 8°, do Código Penal, a pena cumprida no estrangeiro ATENUA a pena imposta no Brasil pelo mesmo crime, quando DIVERSAS, ou nela é computada, quando idênticas."
    },
    {
      "enunciado": "A contagem de um prazo prescricional penal de 2 anos, iniciado em 10 de maio de 2023, se encerra em qual data, considerando a regra do Art. 10 do CP?",
      "alternativas": {
        "A": "10 de maio de 2025.",
        "B": "09 de maio de 2025.",
        "C": "11 de maio de 2025.",
        "D": "31 de dezembro de 2024."
      },
      "resposta_correta": "B",
      "pagina_pdf": "30",
      "trecho_consulta": "Para calcular na prova, diminui um dia. Ex.: se a pena é de um ano e se iniciou em 10/10, estará integralmente cumprida no dia 09/10 do ano subsequente."
    },
    {
      "enunciado": "A revogação expressa de uma lei penal ocorre quando:",
      "alternativas": {
        "A": "A nova lei é implicitamente incompatível com a lei anterior.",
        "B": "A nova lei regula inteiramente a matéria da lei anterior, tornando-a desnecessária.",
        "C": "A lei nova indica taxativamente quais dispositivos da lei anterior estão sendo revogados.",
        "D": "A lei anterior cai em desuso pela não aplicação reiterada pelos tribunais."
      },
      "resposta_correta": "C",
      "pagina_pdf": "8",
      "trecho_consulta": "Expressa: ocorre quando a lei indica quais dispositivos estão revogados."
    },
    {
      "enunciado": "Se uma lei posterior transforma um crime afiançável em inafiançável, essa alteração é considerada *lex gravior* ou *lex mitior*?",
      "alternativas": {
        "A": "*Lex mitior*, pois não altera a pena, apenas um aspecto processual.",
        "B": "*Lex gravior*, pois agrava a situação do réu ao dificultar sua liberdade provisória, e, portanto, não retroage.",
        "C": "Não se classifica nem como *lex gravior* nem *mitior*, pois trata de matéria puramente processual sem impacto na punição.",
        "D": "*Lex gravior*, mas retroage por se tratar de norma de natureza processual penal com aplicação imediata."
      },
      "resposta_correta": "B",
      "pagina_pdf": "11 (por inferência da amplitude de 'de qualquer modo favorecer' para lex mitior, o contrário seria 'de qualquer modo prejudicar' para lex gravior) e 12 (para lex gravior não retroagir)",
      "trecho_consulta": "A expressão 'de qualquer modo' deve ser interpretada de forma ampliativa (para lex mitior). (...) É a lei posterior que prejudica a situação do agente. Como a extra-atividade da lei penal só ocorre benefício do réu, a lex gravior não o prejudica. Não retroage."
    },
    {
      "enunciado": "A teoria da ponderação diferenciada, defendida por José Frederico Marques em relação à *lex tertia*, sustenta que:",
      "alternativas": {
        "A": "O juiz deve aplicar integralmente a lei mais benéfica, sem combinar dispositivos de leis diferentes.",
        "B": "O juiz pode combinar os aspectos mais favoráveis de leis sucessivas, pois não está criando uma nova lei, mas aplicando o direito dentro dos limites postos pelo legislador.",
        "C": "A combinação de leis é vedada por violar a separação de poderes, devendo-se escolher a lei globalmente mais vantajosa.",
        "D": "Apenas o legislador pode criar uma 'terceira lei' que combine aspectos de normas anteriores."
      },
      "resposta_correta": "B",
      "pagina_pdf": "13",
      "trecho_consulta": "2ª Posição (José Frederico Marques) é possível a combinação de leis penais. Não haverá violação ao princípio da separação dos poderes, uma vez que o juiz não está criando uma lei, mas transita dentro dos limites previamente estabelecidos pelo legislador."
    },
    {
      "enunciado": "Qual é a principal razão para a ultratividade das leis penais excepcionais, como aquelas editadas em tempos de calamidade pública?",
      "alternativas": {
        "A": "Garantir que sejam sempre mais benéficas ao réu, mesmo após cessada a excepcionalidade.",
        "B": "Evitar que, devido à sua curta duração, se tornem ineficazes na prevenção e punição de condutas praticadas durante o período de excepcionalidade.",
        "C": "Permitir que retroajam para punir fatos anteriores à sua vigência, dada a gravidade da situação.",
        "D": "Assegurar que sejam revogadas apenas por outra lei expressa, e não por cessarem as circunstâncias que as determinaram."
      },
      "resposta_correta": "B",
      "pagina_pdf": "16",
      "trecho_consulta": "Se assim não fossem, como essas leis são de curtissima duração, seria sancionada uma ineficácia preventiva, ou seja, essas leis não teriam aplicabilidade."
    },
    {
      "enunciado": "No conflito aparente de normas, se o crime de infanticídio (Art. 123 CP) é comparado ao homicídio (Art. 121 CP), qual princípio é aplicado para determinar a norma incidente, considerando as particularidades do infanticídio (estado puerperal, contra o próprio filho)?",
      "alternativas": {
        "A": "Subsidiariedade, pois o homicídio é subsidiário ao infanticídio.",
        "B": "Consunção, pois o infanticídio é uma forma de progressão do homicídio.",
        "C": "Especialidade, pois o infanticídio contém todos os elementos do homicídio e acrescenta elementos especializantes.",
        "D": "Alternatividade, pois a mãe poderia responder por um ou outro, dependendo da interpretação."
      },
      "resposta_correta": "C",
      "pagina_pdf": "18",
      "trecho_consulta": "Ex.: Homicídio e Infanticídio. (Contextualizado no Princípio da especialidade)."
    },
    {
      "enunciado": "O agente que viola o domicílio de alguém (Art. 150 CP) com o fim exclusivo de cometer um furto (Art. 155 CP) no seu interior, responde pelos dois crimes em concurso ou aplica-se algum princípio de solução de conflito aparente de normas?",
      "alternativas": {
        "A": "Responde por violação de domicílio e furto em concurso material, pois são bens jurídicos distintos.",
        "B": "Aplica-se o princípio da consunção (crime-meio), sendo a violação de domicílio (antefato impunível) absorvida pelo furto (crime-fim), respondendo apenas pelo furto.",
        "C": "Aplica-se o princípio da especialidade, pois o furto qualificado pela invasão seria especial.",
        "D": "Responde apenas pela violação de domicílio se o furto não se consumar."
      },
      "resposta_correta": "B",
      "pagina_pdf": "20 (contexto de atos anteriores impuníveis) e 19 (consunção)",
      "trecho_consulta": "Os anteriores são os que funcionam como meios de execução do tipo principal, ficando por estes absorvidos."
    },
    {
      "enunciado": "A alternatividade imprópria, mencionada no material como uma situação de falta de técnica legislativa, ocorreria quando:",
      "alternativas": {
        "A": "Um tipo penal possui vários verbos nucleares e a prática de mais de um contra o mesmo objeto configura crime único.",
        "B": "O legislador disciplina o mesmo fato criminoso mediante duas ou mais leis penais distintas e simultaneamente vigentes, gerando uma duplicidade desnecessária.",
        "C": "Duas leis tratam de fatos completamente diferentes, mas usam nomenclaturas semelhantes, causando confusão.",
        "D": "A lei permite ao juiz escolher alternativamente qual pena aplicar dentre um rol previsto no tipo."
      },
      "resposta_correta": "B",
      "pagina_pdf": "20",
      "trecho_consulta": "Alternatividade imprópria: a qual se verifica quando o legislador disciplina o mesmo fato mediante o emprego de duas ou mais leis penais, deve ser rechaçada de plano. É uma situação clara de falta de técnica legislativa."
    },
    {
      "enunciado": "Para fins de aplicação da Súmula 711 do STF em crime continuado, se uma série de furtos (crime continuado) se inicia sob a lei A (pena X) e, durante a continuidade, entra em vigor a lei B (pena Y, mais grave), e alguns furtos da série ainda ocorrem sob a lei B, qual lei rege toda a unidade delitiva?",
      "alternativas": {
        "A": "A lei A, por ser a lei do primeiro ato da continuidade e mais benéfica.",
        "B": "A lei B, pois sua vigência é anterior à cessação da continuidade, aplicando-se a toda a série de crimes.",
        "C": "A lei A para os crimes sob sua vigência e a lei B para os crimes sob a vigência desta, somando-se as frações de aumento.",
        "D": "A lei mais benéfica após análise global de ambas, aplicando-a integralmente."
      },
      "resposta_correta": "B",
      "pagina_pdf": "22",
      "trecho_consulta": "No crime continuado em que os fatos anteriores eram punidos por uma lei, operando-se o aumento da pena por lei nova, aplica-se esta última toda a unidade delitiva, desde que sob a sua vigência continue a ser praticada. (...) Súmula 711 do Supremo Tribunal Federal: 'A lei penal mais grave aplica-se ao crime continuado...'"
    },
    {
      "enunciado": "O 'território brasileiro por extensão' inclui embarcações e aeronaves brasileiras mercantes ou de propriedade privada. Qual a condição para que a lei brasileira se aplique a crimes cometidos a bordo desses veículos quando não estão em águas/espaço aéreo brasileiros?",
      "alternativas": {
        "A": "Devem estar em águas internacionais (alto-mar) ou no espaço aéreo correspondente; se em território estrangeiro, a lei brasileira não se aplica.",
        "B": "Devem estar, respectivamente, no espaço aéreo correspondente ao território estrangeiro ou em porto estrangeiro, e o crime deve ser contra brasileiro.",
        "C": "Devem achar-se, respectivamente, no espaço aéreo correspondente (a qualquer localidade, inclusive estrangeira, se não houver sobreposição de soberania) ou em alto-mar.",
        "D": "Devem estar a serviço de missão diplomática brasileira, mesmo sendo privadas."
      },
      "resposta_correta": "C",
      "pagina_pdf": "23 e 26",
      "trecho_consulta": "§ 1º Para os efeitos penais, consideram-se como extensão do território nacional (...) bem como as aeronaves e as embarcações brasileiras, mercantes ou de propriedade privada, que se achem, respectivamente, no espaço aéreo correspondente ou em alto-mar."
    },
    {
      "enunciado": "No caso de crimes conexos praticados em parte no Brasil e em parte no estrangeiro, a teoria da ubiquidade (Art. 6º CP) é suficiente para determinar o julgamento de todos os fatos pela justiça brasileira?",
      "alternativas": {
        "A": "Sim, a teoria da ubiquidade atrai a competência para todos os crimes conexos para o Brasil.",
        "B": "Não, pois em crimes conexos, cada delito deve ser processado e julgado no país onde foi cometido, não se aplicando a ubiquidade para unificar a jurisdição sobre todos eles.",
        "C": "Sim, desde que o crime principal tenha ocorrido no Brasil.",
        "D": "Não, a menos que todas as vítimas sejam brasileiras."
      },
      "resposta_correta": "B",
      "pagina_pdf": "26",
      "trecho_consulta": "1. Crimes conexos: são aqueles que de algum modo estão relacionados entre si. Não se aplica a teoria da ubiquidade, eis que os diversos crimes não constituem unidade jurídica. Deve cada um deles, portanto, ser processado e julgado no país em que foi cometido."
    },
    {
      "enunciado": "Qual a regra para a aplicação da lei penal brasileira a crimes falimentares quanto ao lugar do crime, conforme a Lei 11.101/2005?",
      "alternativas": {
        "A": "Aplica-se a teoria da ubiquidade, sendo competente tanto o foro da sede da empresa quanto o local da prática dos atos fraudulentos.",
        "B": "Será competente o foro do local em que foi decretada a falência, concedida a recuperação judicial ou homologado o plano de recuperação extrajudicial.",
        "C": "Aplica-se a teoria da atividade, sendo competente o local do primeiro ato de gestão fraudulenta.",
        "D": "A competência é da Justiça Federal, independentemente do local."
      },
      "resposta_correta": "B",
      "pagina_pdf": "27",
      "trecho_consulta": "Crimes falimentares: será competente o foro do local em que foi decretada a falência, concedida a recuperação judicial ou homologado o plano de recuperação extrajudicial (art. 183 da Lei 11.101/2005)."
    },
    {
      "enunciado": "Na hipótese de extraterritorialidade incondicionada de crime contra o patrimônio de uma empresa pública federal, cometido no exterior (Art. 7º, I, 'b', CP), a aplicação da pena cumprida no estrangeiro pelo mesmo fato (Art. 8º CP) representa uma exceção ao 'ne bis in idem' ou uma forma de observá-lo?",
      "alternativas": {
        "A": "É uma exceção total ao 'ne bis in idem', pois o agente é punido duas vezes integralmente.",
        "B": "É uma forma de observância mitigada do 'ne bis in idem', pois embora o agente possa ser processado e condenado no Brasil (Art. 7º, §1º), a pena cumprida no exterior será atenuada ou computada, evitando uma dupla punição efetiva integral.",
        "C": "Ignora completamente o 'ne bis in idem', pois a soberania brasileira se sobrepõe a qualquer julgamento estrangeiro.",
        "D": "Só se observa o 'ne bis in idem' se a condenação no estrangeiro for por crime idêntico e com pena maior que a brasileira."
      },
      "resposta_correta": "B",
      "pagina_pdf": "28 (referência ao Art. 8º no contexto da extraterritorialidade incondicionada) e 29 (Art. 8º)",
      "trecho_consulta": "Por fim, é importante saber que há proibição do bis in idem, em relação a previsão do Art. 8.º do CP. Desse modo, em face da detração penal determinada pelo art. 8.º do Código Penal, no caso de extraterritorialidade incondicionada, a pena cumprida no estrangeiro atenua a pena imposta no Brasil pelo mesmo crime, quando diversas, ou nela é computada, quando idênticas."
    },
    {
      "enunciado": "Uma das condições para a aplicação da lei brasileira nos casos de extraterritorialidade condicionada (Art. 7º, §2º, CP) é 'ser o fato punível também no país em que foi praticado'. Como se denomina essa exigência?",
      "alternativas": {
        "A": "Condição de procedibilidade.",
        "B": "Princípio da dupla incriminação ou da identidade de normas.",
        "C": "Requisito da nacionalidade do agente.",
        "D": "Cláusula de reciprocidade."
      },
      "resposta_correta": "B",
      "pagina_pdf": "29",
      "trecho_consulta": "b) ser o fato punível também no país em que foi praticado;"
    },
    {
      "enunciado": "Se a pena de um crime é fixada em 5 anos e 10 dias de reclusão, como o Art. 11 do CP impacta essa fração de '10 dias'?",
      "alternativas": {
        "A": "Os 10 dias são arredondados para 1 mês.",
        "B": "Os 10 dias são integralmente cumpridos.",
        "C": "Os 10 dias são desprezados, fixando-se a pena em 5 anos.",
        "D": "Os 10 dias são convertidos em medida restritiva de direitos."
      },
      "resposta_correta": "C",
      "pagina_pdf": "30",
      "trecho_consulta": "Preceitua o art. 11 do Código Penal: 'Desprezam-se, nas penas privativas de liberdade e nas restritivas de direitos, as frações de dia...'"
    },
    {
      "enunciado": "O Art. 12 do CP, que trata da aplicação subsidiária das regras gerais do Código Penal à legislação especial, consagra qual princípio?",
      "alternativas": {
        "A": "Princípio da especialidade da lei penal especial.",
        "B": "Princípio da hierarquia das normas penais.",
        "C": "Princípio da convivência das esferas autônomas (ou da subsidiariedade do Código Penal geral).",
        "D": "Princípio da irretroatividade da lei penal geral sobre a especial."
      },
      "resposta_correta": "C",
      "pagina_pdf": "30",
      "trecho_consulta": "Consagra o princípio da convivência das esferas autônomas, ou seja, o Código Penal será aplicado para toda legislação penal especial, é a regra geral. Havendo previsão específica, será aplicada a lei especial."
    },
    {
      "enunciado": "A derrogação de uma lei penal ocorre quando:",
      "alternativas": {
        "A": "A lei é integralmente revogada por uma nova lei.",
        "B": "A lei é parcialmente revogada, com alguns de seus dispositivos sendo retirados do ordenamento por uma nova lei.",
        "C": "A lei deixa de ser aplicada pelos tribunais por longo período.",
        "D": "A lei tem sua constitucionalidade questionada perante o STF."
      },
      "resposta_correta": "B",
      "pagina_pdf": "8",
      "trecho_consulta": "A revogação pode ser: absoluta ou total, conhecida como ab-rogação (ab-rogação absoluta), ou parcial, denominada derrogação."
    },
    {
      "enunciado": "Se uma lei nova, além de reduzir a pena de um delito, também cria uma nova modalidade de flagrante para esse mesmo delito, como essa alteração processual é tratada em relação ao tempo?",
      "alternativas": {
        "A": "Retroage integralmente, pois a lei é predominantemente mais benéfica.",
        "B": "A parte penal (redução da pena) retroage; a parte processual (nova modalidade de flagrante) tem aplicação imediata (*tempus regit actum* processual), respeitados os atos já praticados.",
        "C": "Não retroage em nenhuma hipótese, pois a alteração processual impede a retroatividade da parte penal.",
        "D": "Retroage apenas a parte processual, por ser mais favorável à eficiência da persecução penal."
      },
      "resposta_correta": "B",
      "pagina_pdf": "11 (para a retroatividade da parte penal) e conhecimento geral sobre aplicação da lei processual penal no tempo (não explicitamente detalhado nesta seção do PDF, mas inferível pelo tratamento separado)",
      "trecho_consulta": "A lei posterior, que de qualquer modo favorecer o agente, aplica-se aos fatos anteriores... (para a parte penal). (A parte processual, por regra geral, tem aplicação imediata - *tempus regit actum*)."
    },
    {
      "enunciado": "Se o complemento de uma lei penal em branco é considerado editado em 'contexto de anormalidade' e sua alteração posterior beneficia o réu, por que, segundo a doutrina de Masson citada, essa alteração não retroage?",
      "alternativas": {
        "A": "Porque o complemento em si não é lei penal, não se sujeitando à retroatividade.",
        "B": "Em razão da ultratividade das leis penais excepcionais (Art. 3º CP), que se estende a esses complementos, visando preservar a eficácia da norma durante a situação de anormalidade.",
        "C": "Porque a retroatividade só é admitida para leis penais em branco homogêneas (complemento da mesma fonte legislativa).",
        "D": "Apenas se a alteração do complemento ocorrer após o trânsito em julgado da condenação."
      },
      "resposta_correta": "B",
      "pagina_pdf": "15",
      "trecho_consulta": "Por outro lado, quando o complemento se inserir em um contexto de anormalidade, de excepcionalidade, a sua modificação, ainda que benéfica ao réu, não pode retroagir. Fundamenta-se essa posição na ultratividade das leis penais excepcionais, alicerçada no art. 3.° do Código Penal."
    },
    {
      "enunciado": "No crime de estelionato (Art. 171 CP), se o agente utiliza um documento falso (crime do Art. 304 c/c Art. 297/298 CP) como meio exclusivo para induzir a vítima a erro e obter a vantagem ilícita, qual a solução comum para o conflito aparente entre o uso de documento falso e o estelionato?",
      "alternativas": {
        "A": "Concurso material entre uso de documento falso e estelionato, pois são crimes distintos.",
        "B": "Consunção, sendo o uso de documento falso (crime-meio) absorvido pelo estelionato (crime-fim), desde que a potencialidade lesiva do falso se esgote no estelionato (Súmula 17 STJ).",
        "C": "Aplica-se apenas o uso de documento falso, por ter pena mais grave em algumas modalidades.",
        "D": "Concurso formal, pois com uma só conduta (uso do falso) o agente pratica dois crimes."
      },
      "resposta_correta": "B",
      "pagina_pdf": "19 (princípio da consunção) - A Súmula 17 do STJ é conhecimento correlato fundamental para essa questão.",
      "trecho_consulta": "Princípio da consunção: o fato mais amplo e grave absorve os demais fatos menos amplos e graves."
    },
    {
      "enunciado": "Um navio de guerra brasileiro está ancorado em um porto estrangeiro. Um crime é cometido a bordo por um tripulante brasileiro contra outro tripulante brasileiro. Qual lei se aplica?",
      "alternativas": {
        "A": "A lei do país estrangeiro onde o navio está ancorado, por cortesia internacional.",
        "B": "A lei brasileira, pois navios públicos são considerados extensão do território nacional onde quer que se encontrem (Art. 5º, §1º CP).",
        "C": "Aplica-se a lei mais favorável ao réu entre a brasileira e a estrangeira.",
        "D": "A lei do país estrangeiro, a menos que o Brasil solicite a extradição do agente."
      },
      "resposta_correta": "B",
      "pagina_pdf": "23",
      "trecho_consulta": "§ 1º Para os efeitos penais, consideram-se como extensão do território nacional as embarcações e aeronaves brasileiras, de natureza pública ou a serviço do governo brasileiro onde quer que se encontrem..."
    },
    {
      "enunciado": "Um cidadão suíço, em viagem pela França, comete um crime contra o patrimônio da União (Brasil). Posteriormente, ele é detido na Alemanha. A lei penal brasileira pode ser aplicada? Se sim, sob qual hipótese de extraterritorialidade?",
      "alternativas": {
        "A": "Não, pois o agente é estrangeiro e o crime ocorreu no exterior.",
        "B": "Sim, pela extraterritorialidade incondicionada (Art. 7º, I, 'b', CP - princípio real ou de defesa), sendo irrelevante sua nacionalidade ou local de detenção para a aplicabilidade da lei brasileira, embora sua punição dependa de outros fatores (ex: presença no Brasil).",
        "C": "Sim, pela extraterritorialidade condicionada, desde que a Suíça ou a França solicitem.",
        "D": "Não, a menos que ele seja encontrado no Brasil."
      },
      "resposta_correta": "B",
      "pagina_pdf": "28",
      "trecho_consulta": "Art. 7º Ficam sujeitos à lei brasileira, embora cometidos no estrangeiro: I - os crimes: (...) b) contra o patrimônio ou a fé pública da União..."
    }
  ]
}

JSON 3 (contendo "perguntas_finais"):
{
  "perguntas_finais": [
    {
      "enunciado": "Considerando a revogação de uma lei penal, se uma nova lei trata da mesma matéria de forma exaustiva, mas é omissa quanto à revogação da lei anterior, e alguns dispositivos da lei antiga não são explicitamente incompatíveis com a nova, mas se tornam redundantes ou desnecessários, qual modalidade de revogação ocorre preponderantemente em relação a esses dispositivos?",
      "alternativas": {
        "A": "Revogação expressa parcial, pois a nova lei implicitamente aponta os dispositivos substituídos.",
        "B": "Derrogação tácita, apenas para os dispositivos que apresentem conflito direto e insanável com a nova lei.",
        "C": "Revogação global, pois a nova lei, ao regular inteiramente a matéria, torna a lei anterior como um todo ultrapassada, mesmo que alguns de seus dispositivos pudessem, isoladamente, coexistir.",
        "D": "Não há revogação desses dispositivos, que permanecem válidos como direito consuetudinário."
      },
      "resposta_correta": "C",
      "pagina_pdf": "9",
      "trecho_consulta": "Global: ocorre quando a nova lei regula inteiramente a matéria disciplinada pela lei anterior, que passa a ser ultrapassada e desnecessária."
    },
    {
      "enunciado": "No caso de *abolitio criminis* (Art. 2º, caput, CP), qual o impacto sobre os registros criminais e antecedentes do indivíduo que havia sido condenado pelo fato agora descriminalizado?",
      "alternativas": {
        "A": "Os registros criminais são mantidos para fins de reincidência em outros crimes, mas a pena é extinta.",
        "B": "Cessam os efeitos penais da condenação, o que inclui a consideração do fato como antecedente criminal ou para fins de reincidência, devendo os registros serem baixados nesse aspecto.",
        "C": "Os registros são mantidos, mas com uma anotação de que o crime foi abolido, servindo apenas para fins civis.",
        "D": "A *abolitio criminis* não afeta os registros criminais, apenas a execução da pena."
      },
      "resposta_correta": "B",
      "pagina_pdf": "10",
      "trecho_consulta": "Art. 2º, CP Ninguém pode ser punido por fato que lei posterior deixa de considerar crime, cessando em virtude dela a execução e os efeitos penais da sentença condenatória."
    },
    {
      "enunciado": "Se uma nova lei penal (lex mitior) reduz a pena de um crime e também altera o prazo prescricional da pretensão punitiva para este crime, tornando-o menor, como essa alteração no prazo prescricional deve ser tratada em relação a fatos anteriores ainda não prescritos pela lei antiga?",
      "alternativas": {
        "A": "O novo prazo prescricional, por ser mais benéfico, retroage para alcançar os fatos anteriores, podendo extinguir a punibilidade.",
        "B": "O novo prazo prescricional não retroage, pois as regras de prescrição são de natureza processual e têm aplicação imediata apenas para o futuro.",
        "C": "A retroatividade do novo prazo prescricional só ocorre se houver expressa previsão na lei nova.",
        "D": "O prazo prescricional da lei antiga continua a correr, e o da lei nova só se aplica aos fatos ocorridos após sua vigência."
      },
      "resposta_correta": "A",
      "pagina_pdf": "11",
      "trecho_consulta": "A expressão 'de qualquer modo' deve ser interpretada de forma ampliativa, ou seja, excluísse uma qualificadora, cria-se uma causa de diminuição etc. Nos termos do art. 5.°, XL, da Constituição Federal, a abolitio criminis e a novatio legis in mellius devem retroagir, por configurar nítido benefício ao réu. (A redução do prazo prescricional é um benefício)."
    },
    {
      "enunciado": "A Súmula 611 do STF estabelece a competência do juízo da execução para aplicar lei mais benéfica após o trânsito em julgado. Se a lei nova mais benéfica surge durante o prazo para interposição de um recurso extraordinário já admitido, mas ainda não julgado, a quem compete, prioritariamente, analisar sua aplicação?",
      "alternativas": {
        "A": "Ao juízo da execução, pois a sentença de primeiro e segundo grau já transitaram em julgado formalmente.",
        "B": "Ao tribunal superior que julgará o recurso (STF/STJ), pois a relação processual ainda não se encerrou em definitivo.",
        "C": "Ao juiz de primeiro grau, que deve ser provocado para readequar a pena antes da subida do recurso.",
        "D": "Apenas ao juízo da execução, após o esgotamento de todos os recursos possíveis."
      },
      "resposta_correta": "B",
      "pagina_pdf": "12",
      "trecho_consulta": "Tribunal – será aplicado pelo tribunal respectivo. No caso de ação penal em grau de recurso, ou ainda na hipótese de crime de competência originária dos Tribunais, tal mister será tarefa do Tribunal respectivo."
    },
    {
      "enunciado": "Considerando a oscilação histórica do STF sobre a *lex tertia*, mas sua posição atual (e a Súmula 501 do STJ), se um réu foi condenado pela Lei A e surge a Lei B, com alguns aspectos mais brandos e outros mais severos, o que o juiz deve fazer?",
      "alternativas": {
        "A": "Criar uma terceira norma combinando os aspectos favoráveis da Lei A e da Lei B.",
        "B": "Analisar qual das duas leis, aplicada em sua integralidade, é mais benéfica ao réu e aplicá-la por completo, vedando a combinação.",
        "C": "Sempre aplicar a Lei B, por ser posterior, independentemente de ser mais gravosa em alguns pontos.",
        "D": "Aplicar a Lei A, pois a Lei B, sendo parcialmente mais gravosa, não pode retroagir em nenhum aspecto."
      },
      "resposta_correta": "B",
      "pagina_pdf": "14",
      "trecho_consulta": "Este é o entendimento atualmente adotado pela Corte Suprema, contrário à combinação de leis penais: (...) Súmula n.º 501, STJ: É cabível a aplicação retroativa da Lei n. 11.343/2006, desde que o resultado da incidência das suas disposições, na integra, seja mais favorável ao réu..."
    },
    {
      "enunciado": "Em um caso de lei penal em branco cujo complemento é uma portaria administrativa que define substâncias entorpecentes. Se uma nova portaria retira uma substância da lista, em um contexto de política criminal ordinária (normalidade), qual o efeito sobre quem respondia por tráfico daquela substância específica?",
      "alternativas": {
        "A": "Nenhum efeito, pois a lei penal em branco não foi alterada, apenas seu complemento.",
        "B": "A conduta se torna atípica retroativamente, pois a alteração do complemento em normalidade, se benéfica, retroage para favorecer o réu.",
        "C": "A retroatividade só ocorre se a lei penal em branco (tipo penal) também for expressamente modificada.",
        "D": "Aplica-se a ultratividade da portaria antiga, mais gravosa, por se tratar de crime de perigo abstrato."
      },
      "resposta_correta": "B",
      "pagina_pdf": "15",
      "trecho_consulta": "No que tange a normalidade, uma situação que se buscava incriminar passa a ser irrelevante. Nesse caso, a retroatividade é obrigatória."
    },
    {
      "enunciado": "O crime de homicídio qualificado por motivo fútil (Art. 121, §2º, II, CP) e o crime de homicídio simples (Art. 121, caput, CP) apresentam um conflito aparente de normas. Qual princípio o soluciona e por quê?",
      "alternativas": {
        "A": "Subsidiariedade, pois o homicídio simples é um 'soldado de reserva' para o qualificado.",
        "B": "Especialidade, pois o homicídio qualificado contém todos os elementos do simples e acrescenta a circunstância especializante do 'motivo fútil'.",
        "C": "Consunção, pois o motivo fútil absorve a conduta de matar.",
        "D": "Alternatividade, pois o promotor pode escolher qual tipo imputar."
      },
      "resposta_correta": "B",
      "pagina_pdf": "18",
      "trecho_consulta": "Princípio da especialidade: Norma especial afasta a aplicação da norma geral (Lex specialis derrogat generali.). (...) A lei específica deve abrigar todos os elementos da genérica, apresentando ainda outras particulares características que podem ser denominadas elementos especializantes..."
    },
    {
      "enunciado": "No contexto da consunção, a 'progressão criminosa' se diferencia do 'crime progressivo' fundamentalmente pela:",
      "alternativas": {
        "A": "Inexistência de dolo inicial para o resultado mais grave na progressão criminosa, havendo uma alteração do desígnio no curso da ação.",
        "B": "Maior gravidade do resultado na progressão criminosa em comparação com o crime progressivo.",
        "C": "Necessidade de representação da vítima na progressão criminosa, o que não ocorre no crime progressivo.",
        "D": "Aplicação exclusiva da progressão criminosa a crimes patrimoniais, enquanto o crime progressivo se aplica a crimes contra a pessoa."
      },
      "resposta_correta": "A",
      "pagina_pdf": "20",
      "trecho_consulta": "Crime progressivo: quando o agente, almejando desde o início alcançar o resultado mais grave... Progressão criminosa: quando o agente pretende inicialmente produzir um resultado e, depois de alcança-lo, opta por prosseguir na prática ilícita e reinicia outra conduta, produzindo um evento mais grave. Pluralidade de designios, havendo alteração em seu dolo."
    },
    {
      "enunciado": "A Súmula 711 do STF, ao tratar da aplicação da lei penal mais grave ao crime continuado ou permanente, pressupõe que a vigência da lei mais gravosa seja anterior à cessação da continuidade ou permanência. Se uma lei intermediária mais branda vigorou durante parte da continuidade delitiva, mas foi revogada antes da cessação por outra ainda mais grave que a inicial, qual lei deve ser aplicada?",
      "alternativas": {
        "A": "A lei inicial, por ser a vigente no começo da atividade criminosa.",
        "B": "A lei intermediária mais branda, por ter sido a mais favorável em algum momento, aplicando-se o princípio da retroatividade e ultratividade da lei mais benigna.",
        "C": "A última lei (a mais grave de todas), pois a continuidade delitiva cessou sob sua vigência.",
        "D": "Faz-se uma combinação das três leis, aplicando-se os dispositivos mais favoráveis de cada uma."
      },
      "resposta_correta": "B",
      "pagina_pdf": "14 (Lei Penal Intermediária) e 22 (Súmula 711) - A questão combina os institutos. A lei intermediária mais benéfica deve ser aplicada, mesmo que a Súmula 711 trate da lei mais grave. A Súmula não impede a aplicação de lei intermediária mais benéfica, mas sim disciplina a aplicação da mais grave quando esta é a que vige na cessação. Se houve uma intermediária mais favorável, esta prevalece sobre a lei do início e sobre a lei do fim, se esta for mais grave que a intermediária.",
      "trecho_consulta": "A lei intermediária (ou intermédia) é aquela que deverá ser aplicada porque benéfica ao réu, muito embora não fosse a lei vigente ao tempo do fato, tampouco seja a lei vigente no momento do julgamento. (...) Nada impede a aplicação da lei 'B', desde que se trate, entre todas, da mais favorável ao agente."
    },
    {
      "enunciado": "O conceito de território brasileiro abrange rios e lagos internacionais. Se um rio serve de fronteira entre o Brasil e outro país (rio simultâneo ou fronteiriço), como se define a parte pertencente ao Brasil para fins de aplicação da lei penal?",
      "alternativas": {
        "A": "Todo o rio é considerado território brasileiro se a margem brasileira for mais extensa.",
        "B": "Aplica-se a lei do país que primeiro reivindicou soberania sobre o rio.",
        "C": "A delimitação da parte pertencente ao Brasil é fixada por tratados ou convenções internacionais entre os Estados interessados.",
        "D": "Aplica-se a lei brasileira até a metade do rio, por presunção."
      },
      "resposta_correta": "C",
      "pagina_pdf": "25",
      "trecho_consulta": "Caso sejam simultâneos ou fronteiriços, isto é, separarem os territórios de dois ou mais países, a delimitação da parte pertencente ao Brasil é fixada por tratados ou convenções internacionais entre os Estados interessados."
    },
    {
      "enunciado": "Um crime é praticado a bordo de uma aeronave brasileira a serviço do governo brasileiro, enquanto sobrevoava território argentino. Qual princípio e regra de aplicação da lei penal brasileira incide?",
      "alternativas": {
        "A": "Territorialidade por extensão (Art. 5º, §1º CP), aplicando-se a lei brasileira, pois a aeronave é considerada território nacional onde quer que se encontre.",
        "B": "Extraterritorialidade condicionada pelo princípio da representação, dependendo de não julgamento na Argentina.",
        "C": "Extraterritorialidade incondicionada pelo princípio da defesa, se o crime afetar a função governamental.",
        "D": "Lei argentina, por estar sobrevoando seu território, salvo se o crime for contra brasileiro."
      },
      "resposta_correta": "A",
      "pagina_pdf": "26",
      "trecho_consulta": "Conforme o art. 5.º, § 1.º, do CP, consideram-se como extensão do território nacional as embarcações e aeronaves brasileiras, de natureza pública ou a serviço do governo brasileiro onde quer que se encontrem..."
    },
    {
      "enunciado": "No caso de um crime à distância, onde a conduta (ex: disparo de arma de fogo) ocorre no país A e o resultado (morte) no país B (Brasil), e o agente é encontrado no país C, qual teoria sobre o lugar do crime o Art. 6º do CP consagra para definir a aplicabilidade da lei penal brasileira?",
      "alternativas": {
        "A": "Teoria da atividade, aplicando-se a lei brasileira apenas se o agente estivesse no Brasil ao agir.",
        "B": "Teoria do resultado, aplicando-se a lei brasileira porque o resultado ocorreu no Brasil.",
        "C": "Teoria da ubiquidade, considerando-se o crime praticado tanto no local da ação (país A) quanto onde se produziu o resultado (país B - Brasil), tornando a lei brasileira aplicável.",
        "D": "Teoria da intencionalidade, aplicando-se a lei do país que o agente pretendia lesar."
      },
      "resposta_correta": "C",
      "pagina_pdf": "26",
      "trecho_consulta": "Art. 6º. Considera-se praticado o crime no lugar em que ocorreu a ação ou omissão, no todo ou em parte, bem como onde se produziu ou deveria produzir-se o resultado."
    },
    {
      "enunciado": "Um agente comete no estrangeiro um crime que, por tratado internacional, o Brasil se obrigou a reprimir (Art. 7º, II, 'a', CP). Para que a lei brasileira seja aplicada, essa hipótese de extraterritorialidade é incondicionada ou condicionada? E qual uma das condições, se houver?",
      "alternativas": {
        "A": "Incondicionada, bastando a existência do tratado.",
        "B": "Condicionada, exigindo-se, entre outras, que o agente entre no território nacional.",
        "C": "Incondicionada, desde que a vítima seja brasileira.",
        "D": "Condicionada, dependendo exclusivamente da requisição do Ministro da Justiça."
      },
      "resposta_correta": "B",
      "pagina_pdf": "28",
      "trecho_consulta": "II – os crimes: a) que, por tratado ou convenção, o Brasil se obrigou a reprimir; (...) A aplicação da lei penal brasileira aos crimes cometidos no exterior se sujeita às condições cumulativas descritas pelo art. 7.°, § 2.º (...) Entrar o agente no território nacional;"
    },
    {
      "enunciado": "Se um brasileiro comete um crime comum (ex: lesão corporal grave) na Argentina e retorna ao Brasil, para que a lei brasileira seja aplicada (Art. 7º, II, 'b', CP), qual das seguintes NÃO é uma condição exigida pelo §2º do Art. 7º?",
      "alternativas": {
        "A": "Ser o fato punível também na Argentina.",
        "B": "O crime estar incluído entre aqueles pelos quais a lei brasileira autoriza a extradição.",
        "C": "Haver requisição do Ministro da Justiça ou representação da vítima.",
        "D": "Não ter sido o agente absolvido na Argentina ou não ter lá cumprido a pena."
      },
      "resposta_correta": "C",
      "pagina_pdf": "28-29",
      "trecho_consulta": "A aplicação da lei penal brasileira aos crimes cometidos no exterior se sujeita às condições cumulativas descritas pelo art. 7.°, § 2.º, alíneas 'a', 'b', 'c', 'd' e 'e'... (A requisição do Ministro da Justiça é para o §3º, ou seja, estrangeiro contra brasileiro no exterior)."
    },
    {
      "enunciado": "A aplicação da lei brasileira a crimes praticados em aeronaves ou embarcações brasileiras, mercantes ou de propriedade privada, quando em território estrangeiro e aí não sejam julgados (Art. 7º, II, 'c', CP), configura qual princípio de extraterritorialidade e qual sua natureza (condicionada/incondicionada)?",
      "alternativas": {
        "A": "Princípio da defesa; incondicionada.",
        "B": "Princípio da representação (ou do pavilhão); condicionada.",
        "C": "Princípio da justiça universal; incondicionada.",
        "D": "Princípio da personalidade ativa; condicionada."
      },
      "resposta_correta": "B",
      "pagina_pdf": "24 (princípio da representação) e 28 (localização no Art. 7º, II, c, que é condicionada)",
      "trecho_consulta": "Princípio da representação: (...) deve ser aplicada a lei penal brasileira aos crimes cometidos em aeronaves ou embarcações brasileiras, mercantes ou de propriedade privada, quando estiverem em território estrangeiro e aí não sejam julgados. É adotado pelo art. 7.º, II, 'c', do Código Penal."
    },
    {
      "enunciado": "A Lei das Contravenções Penais (Decreto-Lei 3.688/1941) veda a aplicação da lei brasileira a contravenções praticadas no estrangeiro. Essa vedação é absoluta ou admite exceções por tratados internacionais?",
      "alternativas": {
        "A": "Admite exceções, se houver tratado específico de repressão à contravenção.",
        "B": "É absoluta, não havendo extraterritorialidade para contravenções penais brasileiras.",
        "C": "Admite exceção se a contravenção for praticada por brasileiro contra patrimônio público.",
        "D": "É relativa, podendo o juiz aplicar a lei brasileira se considerar a contravenção grave."
      },
      "resposta_correta": "B",
      "pagina_pdf": "27",
      "trecho_consulta": "Não se admite a aplicação da lei penal brasileira às contravenções penais praticadas no estrangeiro, de acordo com a regra estabelecida pelo art. 2.º do Decreto-lei 3.688/1941 Lei das Contravenções Penais."
    },
    {
      "enunciado": "Conforme o Art. 8º do CP, se um agente cumpre pena no exterior por um crime e, posteriormente, é julgado no Brasil pelo mesmo fato, e as penas são de naturezas diversas (ex: prisão no exterior e restritiva de direitos no Brasil), como a pena estrangeira impacta a brasileira?",
      "alternativas": {
        "A": "A pena estrangeira é desconsiderada, pois são de naturezas diferentes.",
        "B": "A pena estrangeira atenua a pena brasileira, devendo o juiz considerar o tempo de prisão ao fixar a duração da restritiva de direitos ou até mesmo substituí-la.",
        "C": "A pena brasileira é extinta automaticamente.",
        "D": "A pena estrangeira só é computada se for idêntica (prisão com prisão)."
      },
      "resposta_correta": "B",
      "pagina_pdf": "29",
      "trecho_consulta": "Conforme o Art. 8°, do Código Penal, a pena cumprida no estrangeiro ATENUA a pena imposta no Brasil pelo mesmo crime, quando DIVERSAS, ou nela é computada, quando idênticas."
    },
    {
      "enunciado": "Além da reparação do dano e da sujeição à medida de segurança, a homologação de sentença penal estrangeira pelo STJ (Art. 9º CP) pode ser necessária para outros efeitos. Qual alternativa apresenta outro efeito que dependeria dessa homologação?",
      "alternativas": {
        "A": "Para caracterizar a reincidência no Brasil.",
        "B": "Para gerar 'outros efeitos civis' além da reparação do dano, como a perda de um bem em favor da União, se previsto na sentença estrangeira e compatível com a lei brasileira.",
        "C": "Para permitir a transferência do preso para cumprir pena no Brasil.",
        "D": "Para instruir um processo de extradição contra o condenado."
      },
      "resposta_correta": "B",
      "pagina_pdf": "29",
      "trecho_consulta": "O art. 9º traz duas exceções, ou seja, duas situações em que a sentença penal estrangeira precisa ser homologada no Brasil para gerar: Gerar EFEITOS CIVIS (...) Sujeitar o condenado a MEDIDA DE SEGURANÇA. (A tabela indica 'Gerar EFEITOS CIVIS', que é mais amplo que apenas 'reparação de danos')."
    },
    {
      "enunciado": "A regra de contagem de prazo penal do Art. 10 do CP, que inclui o dia do começo e considera o calendário comum, aplica-se a que tipo de prazos no âmbito criminal?",
      "alternativas": {
        "A": "Apenas a prazos prescricionais, não se aplicando a prazos de cumprimento de pena.",
        "B": "A todos os prazos de natureza penal (material), como os prescricionais, decadenciais e de cumprimento de pena, mas não aos prazos processuais puros.",
        "C": "Apenas a prazos recursais no processo penal.",
        "D": "Exclusivamente a prazos para pagamento de fiança ou multa."
      },
      "resposta_correta": "B",
      "pagina_pdf": "30",
      "trecho_consulta": "O prazo sempre terá natureza penal quando guardar pertinência com o jus puniendi."
    },
    {
      "enunciado": "O Art. 11 do CP determina que se desprezem as frações de cruzeiro na pena de multa. Considerando a obsolescência do 'cruzeiro', qual a interpretação atual e lógica dessa disposição para a moeda vigente (Real)?",
      "alternativas": {
        "A": "A disposição perdeu totalmente a eficácia, devendo as frações de Real serem integralmente cobradas.",
        "B": "Desprezam-se as frações de Real (centavos) na pena de multa, por analogia à intenção do legislador de evitar cobranças de valores irrisórios ou complexos.",
        "C": "As frações de Real são sempre arredondadas para a unidade inteira superior.",
        "D": "Aplica-se apenas se a multa for fixada em dias-multa, não em valor monetário direto."
      },
      "resposta_correta": "B",
      "pagina_pdf": "30",
      "trecho_consulta": "...e, na pena de multa, as frações de cruzeiro. (A lógica é o desprezo de frações da unidade monetária)."
    },
    {
      "enunciado": "Uma lei especial de crimes ambientais estabelece um rito processual próprio e prazos prescricionais específicos, divergentes do Código Penal. Conforme o Art. 12 do CP, como se resolve essa situação?",
      "alternativas": {
        "A": "As regras do Código Penal sempre prevalecem sobre a lei especial, por ser a norma geral.",
        "B": "Aplicam-se as disposições da lei especial, pois esta dispôs de modo diverso do Código Penal sobre a matéria.",
        "C": "O juiz deve combinar as regras do Código Penal e da lei especial, aplicando as mais favoráveis ao réu.",
        "D": "A lei especial só se aplica se for posterior ao Código Penal; caso contrário, prevalece o CP."
      },
      "resposta_correta": "B",
      "pagina_pdf": "30",
      "trecho_consulta": "As regras gerais deste Código aplicam-se aos fatos incriminados por lei especial, se esta não dispuser de modo diverso. (...) Havendo previsão específica, será aplicada a lei especial."
    },
    {
      "enunciado": "A irretroatividade da *lex gravior* é um princípio fundamental. Se uma nova lei aumenta a pena para um crime, mas também introduz uma nova causa de diminuição de pena não existente antes, essa lei pode ser considerada integralmente gravosa e, portanto, totalmente irretroativa?",
      "alternativas": {
        "A": "Sim, o aumento da pena máxima sempre a torna integralmente gravosa, impedindo qualquer retroatividade.",
        "B": "Não necessariamente. A lei seria uma *lex tertia* (híbrida). Conforme a posição majoritária (vedação à combinação), o juiz teria que analisar se a lei, em sua totalidade (com o aumento de pena e a nova causa de diminuição), é mais benéfica ou mais gravosa que a anterior para decidir sobre sua aplicação integral.",
        "C": "A parte que aumenta a pena não retroage, mas a parte que introduz a causa de diminuição retroage por ser benéfica, permitindo-se a cisão da lei.",
        "D": "A lei só retroagirá se a causa de diminuição compensar totalmente o aumento da pena."
      },
      "resposta_correta": "B",
      "pagina_pdf": "13 (Lex Tertia) e 14 (Súmula 501 STJ)",
      "trecho_consulta": "Ocorre quando, por exemplo, partes da lei antiga são benéficas ao réu e partes da lei nova também são benéficas. (A situação inversa é quando a nova lei tem partes mais gravosas e partes mais brandas). (...) sendo vedada a combinação de leis."
    },
    {
      "enunciado": "Um crime de dano (Art. 163 CP) é cometido para possibilitar a prática de um furto (Art. 155 CP) subsequente no mesmo contexto fático (ex: quebrar uma janela para entrar e furtar). Se o agente responde apenas pelo furto, qual princípio explica a não punição autônoma do dano?",
      "alternativas": {
        "A": "Princípio da especialidade, sendo o furto especial em relação ao dano.",
        "B": "Princípio da subsidiariedade, sendo o dano menos grave que o furto.",
        "C": "Princípio da consunção, considerando o dano como antefato impunível (crime-meio) absorvido pelo furto (crime-fim).",
        "D": "Princípio da alternatividade, pois o agente optou pelo furto."
      },
      "resposta_correta": "C",
      "pagina_pdf": "19-20",
      "trecho_consulta": "Princípio da consunção: o fato mais amplo e grave absorve os demais fatos menos amplos e graves. (...) Atos impuníveis: (...) Os anteriores são os que funcionam como meios de execução do tipo principal, ficando por estes absorvidos."
    },
    {
      "enunciado": "Se um indivíduo está sendo processado por um crime (fato A). Durante o processo, surge a lei X, que é mais benéfica. Antes do julgamento, a lei X é revogada pela lei Y, que é idêntica à lei original do tempo do crime (lei do fato A) ou até mais gravosa. Qual lei deve ser aplicada ao caso?",
      "alternativas": {
        "A": "A lei do tempo do fato A, pois a lei X foi revogada.",
        "B": "A lei Y, por ser a lei vigente ao tempo do julgamento.",
        "C": "A lei X (intermediária mais benéfica), pois, mesmo revogada, ela retroage para alcançar o fato praticado sob a lei A e possui ultratividade em relação à lei Y.",
        "D": "Nenhuma das leis, devendo o processo ser extinto por atipicidade temporária."
      },
      "resposta_correta": "C",
      "pagina_pdf": "14",
      "trecho_consulta": "A lei intermediária (ou intermédia) é aquela que deverá ser aplicada porque benéfica ao réu, muito embora não fosse a lei vigente ao tempo do fato, tampouco seja a lei vigente no momento do julgamento. (...) Nada impede a aplicação da lei 'B' [intermediária], desde que se trate, entre todas, da mais favorável ao agente."
    },
    {
      "enunciado": "A Súmula 711 do STF aplica-se ao crime continuado ou permanente se a vigência da lei penal mais grave é anterior à cessação da continuidade ou permanência. Esta súmula conflita com o princípio da irretroatividade da lei penal mais gravosa?",
      "alternativas": {
        "A": "Sim, é uma exceção expressa ao princípio da irretroatividade.",
        "B": "Não, pois se entende que o crime ainda está sendo praticado sob a égide da nova lei mais grave, não havendo propriamente retroatividade.",
        "C": "Sim, mas só se aplica se houver benefício para a sociedade, mesmo prejudicando o réu.",
        "D": "Não, porque a súmula se refere apenas a aspectos processuais da aplicação da pena."
      },
      "resposta_correta": "B",
      "pagina_pdf": "11 (explicação da aplicação da lei B mesmo sendo novatio legis in pejus) e 40 (comentário da questão 3 sobre a Súmula 711)",
      "trecho_consulta": "Deverá ser aplicada a lei B, mesmo que configure novatio legis in pejus. (p.11) (...) Nesses casos, não configura-se a violação do princípio da irretroatividade da lei penal mais grave. (p.40, Q3-Comentário)."
    }
  ]
}

Unificar JSONs
JSON Unificado:
{
  "perguntas_unificadas": [
    {
      "enunciado": "Considerando o princípio da continuidade das leis penais, analise a situação em que uma lei penal é revogada. Qual das seguintes afirmações descreve corretamente uma exceção à regra geral de que uma lei somente é revogada por outra lei?",
      "alternativas": {
        "A": "Qualquer lei penal pode ser tacitamente revogada por desuso, quando a sociedade não mais considera a conduta como criminosa.",
        "B": "Leis temporárias, por terem seu período de vigência predefinido, são consideradas autorrevogáveis, não necessitando de outra lei para sua revogação.",
        "C": "Uma lei penal considerada fundamental para a ordem pública, como as que definem crimes contra a vida, não pode ser revogada, apenas emendada.",
        "D": "A revogação global de uma lei penal só ocorre se uma nova lei expressamente listar todos os artigos da lei anterior que estão sendo retirados do ordenamento."
      },
      "resposta_correta": "B",
      "pagina_pdf": "8",
      "trecho_consulta": "Essa é a regra geral: uma lei somente é revogada por outra lei. Há exceções no Direito Penal. As leis temporárias e excepcionais são autorrevogáveis, ou seja, não precisam ser revogadas por outra lei."
    },
    {
      "enunciado": "No contexto da revogação de leis penais, a distinção entre ab-rogação e derrogação é fundamental. Se uma nova lei penal retira completamente a vigência de uma lei anterior, tratando de forma integralmente nova a matéria, mas mantendo alguns dispositivos semelhantes, qual fenômeno revogatório ocorreu e qual sua principal característica?",
      "alternativas": {
        "A": "Derrogação expressa, pois a nova lei substitui parcialmente a anterior, indicando os pontos de alteração.",
        "B": "Ab-rogação, caracterizada pela revogação total da lei anterior, mesmo que a nova lei aborde o mesmo tema.",
        "C": "Revogação tácita global, onde a lei anterior perde a validade por incompatibilidade total, sendo implicitamente substituída.",
        "D": "Ab-rogação parcial, pois apenas os dispositivos incompatíveis da lei anterior são retirados, mantendo-se os demais."
      },
      "resposta_correta": "B",
      "pagina_pdf": "8",
      "trecho_consulta": "A revogação pode ser: absoluta ou total, conhecida como ab-rogação (ab-rogação absoluta), ou parcial, denominada derrogação."
    },
    {
      "enunciado": "Quanto aos modos de revogação de uma lei penal, se uma nova legislação sobre crimes ambientais é promulgada, disciplinando exaustivamente toda a matéria antes tratada em diversas leis esparsas, sem contudo mencionar explicitamente a revogação das leis anteriores, qual tipo de revogação se configura?",
      "alternativas": {
        "A": "Revogação expressa, pois a nova lei, ao tratar de toda a matéria, implicitamente declara as anteriores revogadas.",
        "B": "Revogação tácita, devido à incompatibilidade material entre a nova lei e as disposições específicas das leis anteriores que com ela conflitem.",
        "C": "Revogação global, pois a nova lei regula inteiramente a matéria antes disciplinada, tornando a legislação anterior ultrapassada e desnecessária.",
        "D": "Ab-rogação, pois se trata da supressão total de múltiplas leis por uma única nova lei, ainda que não expressamente."
      },
      "resposta_correta": "C",
      "pagina_pdf": "9",
      "trecho_consulta": "Global: ocorre quando a nova lei regula inteiramente a matéria disciplinada pela lei anterior, que passa a ser ultrapassada e desnecessária."
    },
    {
      "enunciado": "A respeito da *abolitio criminis*, prevista no Art. 2º do Código Penal, qual das seguintes consequências jurídicas NÃO corresponde aos seus efeitos?",
      "alternativas": {
        "A": "Cessação da execução da pena imposta por fato que deixou de ser crime.",
        "B": "Extinção de todos os efeitos da sentença condenatória, inclusive os extrapenais, como a obrigação de reparar o dano.",
        "C": "Retroatividade da lei nova para alcançar fatos praticados antes de sua vigência que deixaram de ser considerados criminosos.",
        "D": "Desconstituição da coisa julgada em matéria penal, permitindo a libertação de quem cumpre pena por conduta abolida."
      },
      "resposta_correta": "B",
      "pagina_pdf": "10",
      "trecho_consulta": "A abolitio criminis não respeita a coisa julgada, assim, cessa a execução penal e os efeitos penais da condenação, permanecendo os efeitos extrapenais. Ex.: a sentença continua servindo como título executivo judicial para reparação de danos sofridos pela vítima;"
    },
    {
      "enunciado": "Considere a situação em que uma lei revoga o tipo penal de 'atentado violento ao pudor', mas a conduta anteriormente tipificada passa a ser integralmente abrangida pelo tipo penal de 'estupro', que sofreu alteração legislativa. Como se denomina esse fenômeno e qual sua principal implicação?",
      "alternativas": {
        "A": "*Abolitio criminis*, pois o tipo penal específico foi formalmente revogado, extinguindo a punibilidade dos fatos anteriores.",
        "B": "Continuidade normativo-típica, pois, apesar da revogação formal de um tipo, a conduta permanece criminosa sob a égide de outro tipo penal, não havendo extinção da punibilidade.",
        "C": "*Novatio legis in pejus*, pois a conduta migra para um tipo penal potencialmente mais grave, aplicando-se apenas a fatos futuros.",
        "D": "*Lex tertia*, pois se busca uma combinação entre a lei antiga (que previa o atentado violento ao pudor) e a nova (que alterou o estupro) para beneficiar o réu."
      },
      "resposta_correta": "B",
      "pagina_pdf": "10",
      "trecho_consulta": "O princípio da continuidade normativa típica ocorre, segundo o STJ (Info. 518), 'quando uma norma penal é revogada, mas a mesma conduta continua sendo crime no tipo penal revogador, ou seja, a infração penal continua tipificada em outro dispositivo, ainda que topologicamente ou normativamente diverso do originário'."
    },
    {
      "enunciado": "Sobre a *novatio legis incriminadora*, que ocorre quando uma lei nova tipifica um comportamento anteriormente atípico, qual é a regra de aplicação temporal e seu fundamento constitucional?",
      "alternativas": {
        "A": "Retroage para alcançar fatos anteriores se a nova lei for considerada socialmente justa, conforme o princípio da dignidade da pessoa humana.",
        "B": "Aplica-se imediatamente a todos os processos em curso, independentemente da data do fato, visando à pacificação social.",
        "C": "Não retroage, em hipótese alguma, para alcançar fatos praticados antes de sua entrada em vigor, conforme o Art. 5º, XL, da Constituição Federal (princípio da irretroatividade da lei penal mais gravosa).",
        "D": "Retroage apenas se houver previsão expressa na nova lei e se o comportamento já era considerado imoral pela sociedade, mesmo que não criminoso."
      },
      "resposta_correta": "C",
      "pagina_pdf": "10",
      "trecho_consulta": "Como a extra-atividade só atua em benefício do réu, a lei não retroagirá para alcançar os fatos praticados antes da entrada em vigor da nova lei. (...) Não poderá retroagir, em hipótese alguma, conforme determina o art. 5.°, XL, da Constituição Federal."
    },
    {
      "enunciado": "A *lex mitior*, ou lei posterior mais benigna, possui aplicação retroativa. Contudo, o texto menciona uma situação em que ela não seria aplicada. Qual das alternativas reflete uma interpretação crítica dessa ressalva, considerando a natureza da *lex mitior*?",
      "alternativas": {
        "A": "Não se aplica se o agente já tiver cumprido integralmente a pena, pois a finalidade da pena já foi atingida e não haveria benefício prático.",
        "B": "Não se aplica se o processo ainda estiver em fase de inquérito, pois a retroatividade só é analisada pelo juiz sentenciante.",
        "C": "Não se aplica a crimes hediondos, mesmo que a nova lei seja mais benéfica, devido à especial reprovabilidade dessas condutas.",
        "D": "Não se aplica se a sentença condenatória já transitou em julgado, pois a coisa julgada impede a alteração da pena."
      },
      "resposta_correta": "A",
      "pagina_pdf": "10",
      "trecho_consulta": "Ex.: se surgir uma lei que reduz a pena mínima de um delito, esta será aplicada, mesmo que a sentença condenatória tenha transitado em julgado. Só não será aplicada se o agente já tiver cumprido a pena."
    },
    {
      "enunciado": "A Súmula 711 do STF estabelece que 'A lei penal mais grave aplica-se ao crime continuado ou ao crime permanente, se a sua vigência é anterior à cessação da continuidade ou da permanência'. Qual a lógica subjacente a essa súmula em relação ao princípio da irretroatividade da *lex gravior*?",
      "alternativas": {
        "A": "A súmula representa uma exceção ao princípio da irretroatividade da *lex gravior*, permitindo sua aplicação a fatos totalmente pretéritos por razões de política criminal.",
        "B": "A súmula não viola a irretroatividade da *lex gravior*, pois considera-se que o crime (continuado ou permanente) ainda está em execução quando da entrada em vigor da lei mais grave, aplicando-se o princípio *tempus regit actum* à totalidade da conduta que se protrai no tempo.",
        "C": "A súmula permite a retroatividade da lei mais grave, desde que o agente seja beneficiado em algum outro aspecto processual, como a progressão de regime.",
        "D": "A súmula determina que a lei mais grave retroaja apenas para os atos da continuidade delitiva ou da permanência que ocorreram após sua vigência, cindindo-se a aplicação da lei."
      },
      "resposta_correta": "B",
      "pagina_pdf": "11",
      "trecho_consulta": "Os crimes permanente e continuado têm uma especificidade, constante na súmula 711 do STF: 'A lei penal mais grave aplica-se ao crime continuado ou ao crime permanente, se a sua vigência é anterior à cessação da continuidade ou da permanência'. (...) Deverá ser aplicada a lei B, mesmo que configure novatio legis in pejus."
    },
    {
      "enunciado": "Conforme a Súmula 611 do STF, 'Transitada em julgado a sentença condenatória, compete ao juízo das execuções a aplicação de lei mais benéfica'. Se uma lei nova mais benéfica surge após o trânsito em julgado, mas antes do início do cumprimento da pena, a quem compete sua aplicação?",
      "alternativas": {
        "A": "Ao tribunal que proferiu a última decisão, pois a execução ainda não se iniciou.",
        "B": "Ao juiz de primeiro grau que sentenciou o feito, por ser o juiz natural da causa.",
        "C": "Ao juízo da execução, pois a sentença já transitou em julgado, independentemente do início do cumprimento da pena.",
        "D": "Ao Ministério Público, que deverá requerer a aplicação da lei mais benéfica ao juízo sentenciante."
      },
      "resposta_correta": "C",
      "pagina_pdf": "12",
      "trecho_consulta": "Juízo da execução – após o trânsito em julgado, pouco importa a origem da condenação. Se a condenação já tiver sido alcançada pelo trânsito em julgado, a competência será do juízo da Vara das Execuções Criminais. É o que se extrai do art. 66, I, da Lei de Execução Penal, e da Súmula 611 do Supremo Tribunal Federal."
    },
    {
      "enunciado": "A discussão sobre a aplicação da lei penal mais benéfica durante seu período de *vacatio legis* divide a doutrina. Qual alternativa apresenta corretamente a posição majoritária e um de seus fundamentos?",
      "alternativas": {
        "A": "Sim, é possível aplicá-la, pois o objetivo é favorecer o réu, e a lei, embora não vigente, já manifesta a vontade do legislador por uma punição mais branda.",
        "B": "Não, pois nenhuma lei pode ser aplicada durante a *vacatio legis*, período em que sua eficácia está suspensa e não se pode prever se efetivamente entrará em vigor.",
        "C": "Sim, desde que a lei em *vacatio legis* expressamente autorize sua aplicação antecipada em benefício do réu.",
        "D": "Não, a menos que se trate de *abolitio criminis*, caso em que a expectativa de direito à descriminalização já se consolida com a publicação da lei."
      },
      "resposta_correta": "B",
      "pagina_pdf": "12",
      "trecho_consulta": "2ª Corrente. Não, nenhuma lei pode ser aplicada enquanto está no período de vacância, não há lógica (não se sabe até quando uma lei estará em vigor, por exemplo, o CP/69 nunca entrou em vigor). É majoritária."
    },
    {
      "enunciado": "Em relação à *lex gravior* e sua irretroatividade, os tribunais superiores firmaram entendimento sobre a aplicação de novos precedentes jurisprudenciais. Qual a implicação desse entendimento para fatos ocorridos antes da mudança jurisprudencial, caso esta seja mais severa ao réu?",
      "alternativas": {
        "A": "A nova interpretação jurisprudencial mais gravosa não pode ser aplicada a fatos anteriores, pois se equipara à *lex gravior*, violando o princípio da irretroatividade.",
        "B": "A nova interpretação jurisprudencial, mesmo mais gravosa, pode ser aplicada a fatos anteriores, pois o ordenamento jurídico proíbe apenas a retroatividade da lei penal material mais gravosa, não da interpretação judicial.",
        "C": "A aplicação de nova interpretação jurisprudencial mais gravosa a fatos anteriores depende de modulação dos efeitos pelo tribunal, visando à segurança jurídica.",
        "D": "A nova interpretação jurisprudencial mais gravosa só se aplica a fatos anteriores se houver reiteração criminosa por parte do agente após a mudança de entendimento."
      },
      "resposta_correta": "B",
      "pagina_pdf": "13",
      "trecho_consulta": "Não há se falar em irretroatividade de interpretação jurisprudencial, uma vez que o ordenamento jurídico proíbe apenas a retroatividade da lei penal mais gravosa. Os preceitos constitucionais relativos à aplicação retroativa da norma penal benéfica, bem como à irretroatividade da norma mais grave ao acusado (art. 5°, XL, da Constituição Federal), são inaplicáveis aos precedentes jurisprudenciais."
    },
    {
      "enunciado": "No debate sobre a *lex tertia* (combinação de leis penais), Nelson Hungria e José Frederico Marques apresentam posições divergentes. Qual alternativa expõe corretamente a posição de Nelson Hungria e seu principal argumento?",
      "alternativas": {
        "A": "Admite a combinação de leis, desde que o juiz se limite aos dispositivos criados pelo legislador, sem criar uma terceira lei, em homenagem ao princípio da máxima benignidade.",
        "B": "Não admite a combinação de leis penais, pois tal prática configuraria violação ao princípio da separação dos poderes, com o juiz atuando como legislador positivo ao criar uma nova norma a partir de fragmentos de outras.",
        "C": "Admite a combinação de leis (Teoria da Ponderação Diferenciada), argumentando que o juiz não cria lei, mas aplica o direito dentro dos limites estabelecidos, sendo razoável buscar o máximo benefício ao réu.",
        "D": "Não admite a combinação, a menos que a nova lei expressamente permita a aplicação de dispositivos mais favoráveis da lei antiga, caso em que a vedação à atividade legiferante do juiz seria superada."
      },
      "resposta_correta": "B",
      "pagina_pdf": "13",
      "trecho_consulta": "1ª Posição (Nelson Hungria) – não se admite a combinação de leis penais, uma vez que haveria violação ao princípio constitucional da separação dos poderes. Poderá aplicar toda a lei nova ou toda a lei antiga, mas não partes de cada uma."
    },
    {
      "enunciado": "A Súmula 501 do STJ dispõe: 'É cabível a aplicação retroativa da Lei n. 11.343/2006, desde que o resultado da incidência das suas disposições, na íntegra, seja mais favorável ao réu do que o advindo da aplicação da Lei n. 6.368/1976, sendo vedada a combinação de leis.' Como essa súmula se posiciona em relação às teorias da ponderação unitária e diferenciada?",
      "alternativas": {
        "A": "Adota a teoria da ponderação diferenciada, permitindo que o juiz escolha os aspectos mais benéficos de cada lei, desde que o resultado final seja mais favorável.",
        "B": "Adota uma teoria mista, permitindo a combinação apenas em casos excepcionais de tráfico privilegiado, mas, em regra, aplica a ponderação unitária.",
        "C": "Adota a teoria da ponderação unitária ou global, exigindo a aplicação integral de uma das leis (a antiga ou a nova, a que for mais benéfica em seu conjunto) e proibindo a criação de uma terceira lei a partir de partes de ambas.",
        "D": "Rejeita ambas as teorias, propondo que o juiz deve sempre aplicar a lei vigente ao tempo do julgamento, salvo se a lei do tempo do crime for ultrativa por ser mais benéfica."
      },
      "resposta_correta": "C",
      "pagina_pdf": "14",
      "trecho_consulta": "Com igual orientação, o Superior Tribunal de Justiça editou a Súmula n.º 501, que assim dispõe: Súmula n.º 501, STJ: É cabível a aplicação retroativa da Lei n. 11.343/2006, desde que o resultado da incidência das suas disposições, na integra, seja mais favorável ao réu do que o advindo da aplicação da Lei n. 6.368/1976, sendo vedada a combinação de leis."
    },
    {
      "enunciado": "A lei penal intermediária é aquela que, embora não vigente ao tempo do fato nem ao tempo do julgamento, pode ser aplicada se for a mais benéfica. Qual o duplo efeito que caracteriza a aplicação dessa lei?",
      "alternativas": {
        "A": "Retroatividade em relação ao tempo da ação ou omissão e irretroatividade em relação ao tempo do julgamento.",
        "B": "Ultratividade em relação ao tempo da ação ou omissão e retroatividade em relação ao tempo do julgamento.",
        "C": "Retroatividade em relação ao tempo da ação ou omissão e ultratividade em relação ao tempo do julgamento.",
        "D": "Irretroatividade em relação ao tempo da ação ou omissão e ultratividade em relação ao tempo do julgamento."
      },
      "resposta_correta": "C",
      "pagina_pdf": "15",
      "trecho_consulta": "Por fim, é possível notar que a lei penal intermediária é dotada de duplo efeito, possuindo a retroatividade em relação ao tempo da ação ou omissão e ultra-atividade em relação ao tempo do julgamento."
    },
    {
      "enunciado": "No contexto das leis penais em branco, se o complemento normativo é alterado, tornando a conduta anteriormente criminosa atípica, e essa alteração ocorre em um contexto de normalidade legislativa (não excepcionalidade), qual deve ser a consequência jurídica para fatos praticados antes da alteração do complemento?",
      "alternativas": {
        "A": "A alteração do complemento não retroage, pois o núcleo da norma penal em branco permaneceu inalterado, aplicando-se o princípio *tempus regit actum*.",
        "B": "A retroatividade é obrigatória para beneficiar o réu, pois a situação que se buscava incriminar deixou de ser relevante para o ordenamento, configurando uma espécie de *abolitio criminis* material.",
        "C": "A alteração do complemento só retroage se a lei penal em branco expressamente prever essa possibilidade, em respeito à autonomia do complemento.",
        "D": "A alteração do complemento não retroage, em razão da ultratividade do complemento vigente à época do fato, mesmo em contexto de normalidade."
      },
      "resposta_correta": "B",
      "pagina_pdf": "15",
      "trecho_consulta": "No que tange a normalidade, uma situação que se buscava incriminar passa a ser irrelevante. Nesse caso, a retroatividade é obrigatória. (...) Perceba que ocorreu uma descriminalização da maconha, não mais é considera uma droga proibida pelo ordenamento jurídico brasileiro, devendo operar-se a retroatividade, uma vez que não havia situação de anormalidade."
    },
    {
      "enunciado": "Considere uma lei penal em branco cujo complemento foi editado para vigorar durante uma situação de anormalidade econômica, como um tabelamento de preços. Se, após a estabilização econômica, esse complemento é revogado, o agente que praticou o crime durante a vigência do tabelamento (situação de anormalidade) será beneficiado pela revogação do complemento?",
      "alternativas": {
        "A": "Sim, pois a revogação do complemento, mesmo em situação de anormalidade, equipara-se à *abolitio criminis*, devendo retroagir.",
        "B": "Não, pois o complemento editado em situação de anormalidade é dotado de ultratividade, conforme o art. 3º do Código Penal, não podendo sua revogação posterior retroagir para beneficiar o réu que agiu durante a excepcionalidade.",
        "C": "Sim, mas apenas se a revogação do complemento ocorrer antes do trânsito em julgado da sentença condenatória.",
        "D": "Depende: se o complemento era uma lei em sentido formal, sua revogação retroage; se era um ato administrativo, não retroage."
      },
      "resposta_correta": "B",
      "pagina_pdf": "15",
      "trecho_consulta": "Por outro lado, quando o complemento se inserir em um contexto de anormalidade, de excepcionalidade, a sua modificação, ainda que benéfica ao réu, não pode retroagir. Fundamenta-se essa posição na ultratividade das leis penais excepcionais, alicerçada no art. 3.° do Código Penal."
    },
    {
      "enunciado": "As leis penais temporárias e excepcionais, conforme o Art. 3º do Código Penal, possuem uma característica fundamental quanto à sua aplicação no tempo. Qual é essa característica e sua justificativa?",
      "alternativas": {
        "A": "São retroativas, aplicando-se a fatos anteriores à sua vigência se forem mais benéficas, para garantir a isonomia.",
        "B": "São ultrativas e autorrevogáveis, continuando a punir fatos praticados durante sua vigência mesmo após seu término, para evitar a ineficácia preventiva dessas leis de curta duração.",
        "C": "São irretroativas e perdem a eficácia imediatamente após o término de seu prazo ou da situação excepcional, não punindo mais ninguém, como regra geral.",
        "D": "Dependem de uma lei posterior para confirmar sua ultratividade; caso contrário, cessam todos os efeitos com o fim de sua vigência."
      },
      "resposta_correta": "B",
      "pagina_pdf": "16",
      "trecho_consulta": "Ambas são ULTRATIVAS e AUTORREVOÁVEIS: os fatos praticados durante sua vigência continuarão a ser punidos mesmo após o fim de sua vigência. Se assim não fossem, como essas leis são de curtissima duração, seria sancionada uma ineficácia preventiva, ou seja, essas leis não teriam aplicabilidade."
    },
    {
      "enunciado": "Qual é o requisito essencial que distingue o conflito aparente de normas do concurso de crimes, considerando a aplicação dos princípios solucionadores?",
      "alternativas": {
        "A": "No conflito aparente de normas há pluralidade de fatos, enquanto no concurso de crimes há unidade de fato.",
        "B": "No conflito aparente de normas há unidade de fato e pluralidade de leis aparentemente aplicáveis, enquanto no concurso de crimes o agente pratica dois ou mais crimes distintos.",
        "C": "A vigência simultânea das normas é requisito para o concurso de crimes, mas não para o conflito aparente de normas.",
        "D": "O conflito aparente de normas só ocorre entre leis do Código Penal, enquanto o concurso de crimes pode envolver legislação especial."
      },
      "resposta_correta": "B",
      "pagina_pdf": "17",
      "trecho_consulta": "1. Unidade do fato: o agente praticou um único fato (um único crime). Este requisito serve para diferenciar o conflito aparente de normas do concurso de crimes."
    },
    {
      "enunciado": "O princípio da especialidade é um dos critérios para solucionar o conflito aparente de normas. Como ele opera e qual sua relação lógica com a norma geral?",
      "alternativas": {
        "A": "A norma geral, por ser mais abrangente, afasta a aplicação da norma especial, que trata de casos específicos.",
        "B": "A norma especial afasta a aplicação da norma geral (*Lex specialis derogat generali*), pois a lei específica contém todos os elementos da genérica e adiciona características particularizantes (elementos especializantes).",
        "C": "Ambas as normas, geral e especial, são aplicadas conjuntamente, somando-se as penas para refletir a complexidade do fato.",
        "D": "A norma especial só se aplica se for mais benéfica ao réu; caso contrário, prevalece a norma geral, mesmo que o fato se enquadre na especial."
      },
      "resposta_correta": "B",
      "pagina_pdf": "18",
      "trecho_consulta": "Princípio da especialidade: Norma especial afasta a aplicação da norma geral (Lex specialis derrogat generali.). O critério da especialidade reclama duas leis penais em concurso, caracterizadas pela relação de gênero e espécie, na qual esta prefere àquela, excluindo a sua aplicação para fins de tipicidade."
    },
    {
      "enunciado": "No âmbito do princípio da subsidiariedade, a norma subsidiária atua como um 'soldado de reserva'. O que significa a subsidiariedade tácita e como ela se diferencia da expressa?",
      "alternativas": {
        "A": "Subsidiariedade tácita ocorre quando a própria norma declara que só se aplica se o fato não constituir crime mais grave; a expressa é presumida pelo intérprete.",
        "B": "Subsidiariedade tácita é aquela em que a condição de 'soldado de reserva' é extraída da análise do caso concreto e da relação entre os bens jurídicos tutelados, sem menção explícita na lei, enquanto a expressa contém essa cláusula de ressalva.",
        "C": "Subsidiariedade tácita se aplica apenas a crimes de menor potencial ofensivo, enquanto a expressa pode ocorrer em qualquer tipo de crime.",
        "D": "Subsidiariedade tácita significa que a norma menos grave sempre absorve a mais grave, enquanto a expressa faz o contrário."
      },
      "resposta_correta": "B",
      "pagina_pdf": "19",
      "trecho_consulta": "Subsidiariedade tácita ou implícita: a norma penal não se declara subsidiária, mas esta circunstância é extraída da análise do caso concreto. Exemplo: Constrangimento ilegal (CP, art. 146), subsidiário diante do estupro (CP, art. 213)."
    },
    {
      "enunciado": "O princípio da consunção estabelece que o fato mais amplo e grave absorve os demais fatos menos amplos e graves. Em qual das seguintes hipóteses a consunção tipicamente NÃO se aplica, exigindo análise de concurso de crimes?",
      "alternativas": {
        "A": "Crime progressivo, onde o agente, desde o início, visa o resultado mais grave, passando por etapas que configurariam crimes menos graves.",
        "B": "Crime complexo, como o roubo, que funde o furto com a ameaça ou lesão corporal.",
        "C": "Quando o agente pratica um furto para obter recursos e, dias depois, com esses recursos, adquire drogas para uso pessoal, sendo os dois crimes autônomos e com desígnios distintos.",
        "D": "Antefato impunível, como a violação de domicílio para cometer um furto dentro da residência, sendo a violação meio necessário para o crime-fim."
      },
      "resposta_correta": "C",
      "pagina_pdf": "19",
      "trecho_consulta": "São hipóteses em que se aplica o princípio da consunção: Crime complexo... Crime progressivo... Atos impuníveis... (O exemplo C não se encaixa como hipótese de consunção, mas de concurso, pois os crimes são autônomos e com desígnios distintos, não havendo relação de meio-fim ou parte-todo necessária para a consunção)."
    },
    {
      "enunciado": "A teoria da atividade, adotada pelo Art. 4º do Código Penal para definir o tempo do crime, estabelece que se considera praticado o crime no momento da ação ou omissão. Qual a principal implicação dessa teoria para a aferição da imputabilidade penal do agente?",
      "alternativas": {
        "A": "A imputabilidade é aferida no momento do resultado, pois é quando o bem jurídico é efetivamente lesionado.",
        "B": "A imputabilidade é analisada no momento da conduta (ação ou omissão), ainda que o resultado ocorra posteriormente, quando o agente poderia já ter atingido a maioridade penal ou desenvolvido uma doença mental.",
        "C": "A imputabilidade é verificada tanto no momento da conduta quanto no momento do resultado, exigindo-se que o agente seja imputável em ambas as ocasiões.",
        "D": "A teoria da atividade é irrelevante para a imputabilidade, que é sempre analisada no momento do oferecimento da denúncia."
      },
      "resposta_correta": "B",
      "pagina_pdf": "21",
      "trecho_consulta": "Considera-se praticado o crime no momento da ação ou omissão, AINDA QUE outro seja o momento do resultado'. (...) Exemplo: 'A', com a idade de 17 anos, 11 meses e 20 dias, efetua disparos de arma de fogo contra 'B'... Não se aplicará ao autor o Código Penal, em face de sua inimputabilidade ao tempo do crime..."
    },
    {
      "enunciado": "Embora o Código Penal adote a teoria da atividade para o tempo do crime (Art. 4º CP), há uma exceção expressa quanto ao início do prazo da prescrição da pretensão punitiva. Qual teoria é aplicada para este fim específico, conforme o Art. 111, I, do CP?",
      "alternativas": {
        "A": "Teoria da atividade, mantendo a coerência do sistema, contando-se a prescrição a partir da data da ação ou omissão.",
        "B": "Teoria da ubiquidade, permitindo que a prescrição comece a correr tanto da data da conduta quanto da data do resultado, o que ocorrer primeiro.",
        "C": "Teoria do resultado, pois a prescrição da pretensão punitiva começa a correr do dia em que o crime se consumou.",
        "D": "Teoria mista, combinando o momento da conduta para crimes formais e o momento do resultado para crimes materiais."
      },
      "resposta_correta": "C",
      "pagina_pdf": "22",
      "trecho_consulta": "O Código Penal excepciona a Teoria da Atividade para fins de prescrição, eis que adota a Teoria do Resultado, para a contagem do início do prazo da PPP (prescrição da pretensão punitiva). Art. 111 A prescrição, antes de transitar em julgado a sentença final, começa a correr: I do dia em que o crime se consumou;"
    },
    {
      "enunciado": "O Art. 5º do Código Penal estabelece o princípio da territorialidade temperada. O que significa 'temperada' ou 'mitigada' nesse contexto?",
      "alternativas": {
        "A": "Significa que a lei brasileira se aplica apenas a crimes graves cometidos no território nacional, excluindo-se os de menor potencial ofensivo.",
        "B": "Significa que a lei brasileira se aplica aos crimes cometidos no território nacional, mas essa regra é absoluta e não admite exceções de extraterritorialidade.",
        "C": "Significa que, embora a regra seja a aplicação da lei brasileira aos crimes cometidos em seu território, essa regra é excepcionada por convenções, tratados e regras de direito internacional, e também complementada por hipóteses de extraterritorialidade.",
        "D": "Significa que a lei brasileira só se aplica no território nacional se o agente for brasileiro ou residente no Brasil."
      },
      "resposta_correta": "C",
      "pagina_pdf": "23",
      "trecho_consulta": "Aplica-se a lei brasileira aos crimes cometidos no território nacional. Há exceções que ocorrem quando o brasileiro pratica crime no exterior ou quando um estrangeiro comete delito no Brasil. Fala-se, assim, que o Código penal adotou o princípio da territorialidade temperada ou mitigada. Art. 5º, CP Aplica-se a lei brasileira, sem prejuízo de convenções, tratados e regras de direito internacional, ao crime cometido no território nacional."
    },
    {
      "enunciado": "Para efeitos penais, o §1º do Art. 5º do CP considera como extensão do território nacional as embarcações e aeronaves brasileiras de natureza pública. Qual a abrangência territorial da lei brasileira para esses veículos?",
      "alternativas": {
        "A": "Aplica-se a lei brasileira somente quando estiverem em águas territoriais ou espaço aéreo brasileiro.",
        "B": "Aplica-se a lei brasileira onde quer que se encontrem, seja em território nacional, estrangeiro, alto-mar ou espaço aéreo correspondente.",
        "C": "Aplica-se a lei brasileira apenas se o crime for cometido por brasileiro a bordo dessas embarcações ou aeronaves.",
        "D": "Aplica-se a lei brasileira somente se estiverem a serviço do governo brasileiro em missão oficial no exterior."
      },
      "resposta_correta": "B",
      "pagina_pdf": "23",
      "trecho_consulta": "§ 1º Para os efeitos penais, consideram-se como extensão do território nacional as embarcações e aeronaves brasileiras, de natureza pública ou a serviço do governo brasileiro onde quer que se encontrem..."
    },
    {
      "enunciado": "O Art. 6º do Código Penal adota a teoria da ubiquidade para definir o lugar do crime. Em qual das seguintes situações a teoria da ubiquidade, conforme descrita para o Art. 6º CP, prioritariamente NÃO se aplica para definir a lei penal aplicável, sendo solucionada por regras de competência interna ou outras disposições?",
      "alternativas": {
        "A": "Um crime em que a conduta é praticada no Brasil e o resultado ocorre na Argentina (crime à distância).",
        "B": "Um crime em que a conduta é iniciada em um estado brasileiro e o resultado se consuma em outro estado brasileiro (crime plurilocal).",
        "C": "Um crime em que a conduta é praticada de uma aeronave sobrevoando o oceano Atlântico e o resultado se manifesta em um navio em águas internacionais.",
        "D": "Um crime em que um agente no exterior envia uma carta-bomba para o Brasil, que explode e causa o resultado no território nacional."
      },
      "resposta_correta": "B",
      "pagina_pdf": "26",
      "trecho_consulta": "O art. 6º do CP aplica-se apenas aos crimes à distância, também conhecidos como crimes de espaço máximo, em que a conduta e o resultado ocorrem em países diversos. (...) Crimes plurilocais: são aqueles em que a conduta e o resultado ocorrem em comarcas diversas, mas no mesmo país. (Aqui, a teoria da ubiquidade do art. 6º CP não define a lei aplicável, pois já é a brasileira, mas sim influencia a discussão sobre competência, regida pelo CPP, que para crimes plurilocais adota a teoria do resultado - art. 70 CPP, como mencionado na p.51 do PDF em 'Gabarito Questão Desafio')."
    },
    {
      "enunciado": "No tocante à extraterritorialidade incondicionada, prevista no Art. 7º, I, do CP, qual a consequência para o agente que comete um dos crimes ali elencados, caso seja julgado (absolvido ou condenado) no estrangeiro?",
      "alternativas": {
        "A": "O agente não poderá ser punido pela lei brasileira se já tiver sido absolvido no estrangeiro, em respeito ao *ne bis in idem*.",
        "B": "O agente será punido segundo a lei brasileira, ainda que absolvido ou condenado no estrangeiro, conforme o Art. 7º, §1º, do CP, mitigando-se a pena cumprida no exterior.",
        "C": "O agente só será punido pela lei brasileira se a pena no estrangeiro for menor que a prevista no Brasil, para complementação.",
        "D": "O agente só poderá ser processado no Brasil se o país onde ocorreu o crime solicitar, via cooperação internacional."
      },
      "resposta_correta": "B",
      "pagina_pdf": "27",
      "trecho_consulta": "As hipóteses estão previstas no art. 7.º, I, do Código Penal e, no tocante a esses crimes, o agente é punido segundo a lei brasileira, ainda que absolvido ou condenado no estrangeiro (art. 7.°, § 1.°)."
    },
    {
      "enunciado": "A extraterritorialidade condicionada, prevista no Art. 7º, II, e §3º do CP, sujeita a aplicação da lei brasileira a diversas condições. Qual das alternativas NÃO representa uma dessas condições estabelecidas no Art. 7º, §2º, do CP?",
      "alternativas": {
        "A": "Entrar o agente no território nacional.",
        "B": "Ser o fato punível também no país em que foi praticado (princípio da dupla incriminação).",
        "C": "O agente ser primário e de bons antecedentes, conforme avaliação do juiz brasileiro.",
        "D": "Não ter sido o agente absolvido no estrangeiro ou não ter aí cumprido a pena."
      },
      "resposta_correta": "C",
      "pagina_pdf": "28-29",
      "trecho_consulta": "A aplicação da lei penal brasileira aos crimes cometidos no exterior se sujeita às condições cumulativas descritas pelo art. 7.°, § 2.º, alíneas 'a', 'b', 'c', 'd' e 'e' (...) Entrar o agente no território nacional; Ser o fato punível também no país em que foi praticado; Estar o crime incluído entre aqueles pelos quais a lei brasileira autoriza a extradição; Não ter sido o agente absolvido no estrangeiro ou não ter aí cumprido a pena; Não ter sido o agente perdoado no estrangeiro ou, por outro motivo, não estar extinta a punibilidade, segundo a lei mais favorável."
    },
    {
      "enunciado": "O Art. 8º do Código Penal trata da pena cumprida no estrangeiro. Como essa pena influencia a pena imposta no Brasil pelo mesmo crime, nos casos de extraterritorialidade?",
      "alternativas": {
        "A": "A pena cumprida no estrangeiro sempre extingue a punibilidade no Brasil, independentemente de serem idênticas ou diversas.",
        "B": "A pena cumprida no estrangeiro é irrelevante para a justiça brasileira, que aplicará a pena integralmente.",
        "C": "A pena cumprida no estrangeiro atenua a pena imposta no Brasil quando diversas, ou nela é computada (detração) quando idênticas.",
        "D": "A pena cumprida no estrangeiro só é considerada se houver tratado de extradição com o país onde a pena foi cumprida."
      },
      "resposta_correta": "C",
      "pagina_pdf": "29",
      "trecho_consulta": "Conforme o Art. 8°, do Código Penal, a pena cumprida no estrangeiro ATENUA a pena imposta no Brasil pelo mesmo crime, quando DIVERSAS, ou nela é computada, quando idênticas."
    },
    {
      "enunciado": "O Art. 9º do Código Penal estabelece hipóteses em que a sentença penal estrangeira precisa ser homologada pelo Superior Tribunal de Justiça para produzir efeitos no Brasil. Para qual das finalidades abaixo a homologação depende de 'requisição do Ministro da Justiça', na falta de tratado de extradição?",
      "alternativas": {
        "A": "Para gerar quaisquer efeitos civis, como a reparação do dano.",
        "B": "Para sujeitar o condenado a medida de segurança.",
        "C": "Para agravar a pena em caso de reincidência internacional.",
        "D": "Para permitir a transferência do preso para cumprimento de pena no Brasil."
      },
      "resposta_correta": "B",
      "pagina_pdf": "29",
      "trecho_consulta": "A HOMOLOGAÇÃO DEPENDE DE... TRATADO DE EXTRADIÇÃO com o país de cuja autoridade judiciária emanou a sentença, ou, na falta de tratado, de REQUISIÇÃO DO MINISTRO DA JUSTIÇA (para Sujeitar o condenado a MEDIDA DE SEGURANÇA)."
    },
    {
      "enunciado": "A contagem de prazo penal, conforme o Art. 10 do Código Penal, possui uma regra específica quanto ao dia do começo e sua natureza. Qual das afirmações melhor descreve essa sistemática?",
      "alternativas": {
        "A": "O dia do começo é excluído do cômputo, e os prazos são prorrogáveis se terminarem em finais de semana ou feriados.",
        "B": "O dia do começo inclui-se no cômputo do prazo, e os prazos penais são improrrogáveis, mesmo que terminem em sábados, domingos ou feriados.",
        "C": "O dia do começo inclui-se no cômputo, mas os prazos são prorrogáveis até o próximo dia útil se o término ocorrer em dia não útil.",
        "D": "O dia do começo é irrelevante, contando-se apenas os dias subsequentes, e os prazos são sempre contados em dias úteis."
      },
      "resposta_correta": "B",
      "pagina_pdf": "30",
      "trecho_consulta": "Conforme dispõe o Art. 10, Código Penal: 'o dia do começo inclui-se no cômputo do prazo'. (...) OS PRAZOS PENAIS SÃO IMPRORROGÁVEIS, MESMO QUE TERMINEM EM SÁBADOS, DOMINGOS OU FERIADOS."
    },
    {
      "enunciado": "O Art. 11 do Código Penal trata das frações não computáveis da pena. Qual o tratamento dado às frações de dia nas penas privativas de liberdade e restritivas de direitos?",
      "alternativas": {
        "A": "As frações de dia são arredondadas para o dia inteiro subsequente, em prejuízo do réu.",
        "B": "As frações de dia são desprezadas, não sendo computadas na contagem final da pena.",
        "C": "As frações de dia são convertidas em horas e cumpridas proporcionalmente.",
        "D": "As frações de dia são convertidas em pena de multa, aplicando-se uma regra de três."
      },
      "resposta_correta": "B",
      "pagina_pdf": "30",
      "trecho_consulta": "Preceitua o art. 11 do Código Penal: 'Desprezam-se, nas penas privativas de liberdade e nas restritivas de direitos, as frações de dia, e, na pena de multa, as frações de cruzeiro'."
    },
    {
      "enunciado": "Conforme o Art. 12 do Código Penal, as regras gerais do Código Penal aplicam-se aos fatos incriminados por lei especial. Qual a condição para que essa aplicação subsidiária ocorra?",
      "alternativas": {
        "A": "Desde que a lei especial seja anterior ao Código Penal.",
        "B": "Apenas se a lei especial tratar de crimes de menor gravidade.",
        "C": "Se a lei especial não dispuser de modo diverso sobre a matéria.",
        "D": "Somente com autorização expressa do Superior Tribunal de Justiça para cada caso."
      },
      "resposta_correta": "C",
      "pagina_pdf": "30",
      "trecho_consulta": "Prevista no art. 12 do Código Penal: 'As regras gerais deste Código aplicam-se aos fatos incriminados por lei especial, se esta não dispuser de modo diverso'."
    },
    {
      "enunciado": "Sobre a distinção entre 'abolitio criminis' e 'continuidade normativo-típica', analise: se uma lei nova revoga um artigo que previa o crime X, mas simultaneamente introduz um novo artigo Y que descreve e pune exatamente a mesma conduta de X, com a mesma pena, o agente que praticou X sob a lei antiga será beneficiado?",
      "alternativas": {
        "A": "Sim, pois ocorreu *abolitio criminis* formal do artigo X, extinguindo-se a punibilidade, e o novo artigo Y só se aplica a fatos futuros.",
        "B": "Não, pois se trata de continuidade normativo-típica; a conduta não deixou de ser crime, apenas houve um deslocamento topográfico da tipificação, mantendo-se a punibilidade.",
        "C": "Sim, pois a lei nova, mesmo mantendo a conduta como crime, é considerada mais benéfica por ser posterior, implicando a revisão da pena.",
        "D": "Depende: se a lei nova Y tiver um nome diferente para o crime, configura *abolitio criminis*; se mantiver o mesmo nome, há continuidade."
      },
      "resposta_correta": "B",
      "pagina_pdf": "10",
      "trecho_consulta": "ABOLITIO CRIMINIS: Há uma supressão formal e material da figura criminosa. (...) CONTINUIDADE NORMATIVA TÍPICA: Há uma supressão apenas formal da figura criminosa. (...) O fato permanece sendo punível (a conduta criminosa, no entanto, é deslocada para outro tipo penal)."
    },
    {
      "enunciado": "Um indivíduo pratica um crime de furto. Durante o processo, surge uma nova lei que, mantendo a pena máxima do furto, aumenta a pena mínima e extingue uma causa de aumento de pena anteriormente aplicável ao caso. Diante dessa *lex tertia* potencial, qual seria a posição defendida por José Frederico Marques, de acordo com o material?",
      "alternativas": {
        "A": "Deveria aplicar integralmente a lei antiga, pois a nova lei é parcialmente mais gravosa (aumento da pena mínima), vedando-se qualquer combinação.",
        "B": "Deveria aplicar integralmente a lei nova, pois a extinção da causa de aumento pode ser mais benéfica, mesmo com o aumento da pena mínima, vedando-se a combinação.",
        "C": "Seria possível a combinação das leis, aplicando-se a pena mínima da lei antiga (mais benéfica) e excluindo-se a causa de aumento conforme a lei nova (mais benéfica), pois o juiz não estaria criando lei, mas transitando nos limites estabelecidos pelo legislador.",
        "D": "Seria inadmissível a combinação, pois o juiz estaria usurpando a função do legislador, devendo optar pela lei que, em sua totalidade (ponderação global), fosse mais favorável."
      },
      "resposta_correta": "C",
      "pagina_pdf": "13",
      "trecho_consulta": "2ª Posição (José Frederico Marques) é possível a combinação de leis penais. Não haverá violação ao princípio da separação dos poderes, uma vez que o juiz não está criando uma lei, mas transita dentro dos limites previamente estabelecidos pelo legislador."
    },
    {
      "enunciado": "A Lei Geral da Copa (Lei 12.663/2012) estabeleceu tipos penais com vigência até uma data predeterminada. Essa característica classifica tal lei penal como:",
      "alternativas": {
        "A": "Lei excepcional, pois vigorou durante um evento extraordinário.",
        "B": "Lei temporária, pois tinha em seu texto o tempo de vigência prefixado.",
        "C": "Lei penal em branco, pois dependia de regulamentos da FIFA para sua plena aplicação.",
        "D": "Lei intermediária, pois surgiu entre a legislação penal comum anterior e a posterior ao evento."
      },
      "resposta_correta": "B",
      "pagina_pdf": "16",
      "trecho_consulta": "Lei Temporária: Aquela que tem, prefixado em seu texto, o tempo de vigência. Ex.: Lei A estabelece que sua vigência durará do dia 1º de janeiro de 2012 ao dia 1º de junho de 2012; Lei Geral da Copa;"
    },
    {
      "enunciado": "No crime de dano qualificado pelo emprego de substância inflamável (Art. 163, parágrafo único, II, CP), o próprio tipo penal ressalva 'se o fato não constitui crime mais grave'. Essa ressalva é um exemplo clássico de qual princípio solucionador de conflito aparente de normas?",
      "alternativas": {
        "A": "Princípio da especialidade, pois o dano qualificado é especial em relação ao dano simples.",
        "B": "Princípio da consunção, pois o crime mais grave (ex: incêndio) absorveria o dano.",
        "C": "Princípio da subsidiariedade expressa, onde a própria norma se declara aplicável apenas na ausência de um crime mais severo.",
        "D": "Princípio da alternatividade, pois o agente poderia responder por dano ou pelo crime mais grave, à escolha da acusação."
      },
      "resposta_correta": "C",
      "pagina_pdf": "19",
      "trecho_consulta": "Subsidiariedade expressa ou explícita: a própria norma penal se declara subsidiária, ou seja, diz que somente será aplicada se o fato não constituir crime mais grave. Como exemplo, temos o art. 163, p. único, II do CP."
    },
    {
      "enunciado": "Um agente, com o dolo inicial de lesionar gravemente a vítima, desfere facadas. Após constatar a gravidade das lesões, decide matá-la, desferindo novos golpes fatais. Como se classifica essa situação em termos de progressão delitiva e qual princípio se aplica para resolver o aparente concurso de crimes (lesão grave e homicídio)?",
      "alternativas": {
        "A": "Crime progressivo, aplicando-se a consunção, pois o homicídio absorve a lesão corporal grave como etapa necessária.",
        "B": "Progressão criminosa, aplicando-se a consunção, pois o agente, após atingir um resultado menos grave (lesão), altera seu dolo e pratica uma conduta mais grave (homicídio), que absorve a anterior.",
        "C": "Concurso material de crimes, pois houve duas condutas distintas com dois resultados lesivos (lesão e morte), devendo as penas serem somadas.",
        "D": "Crime complexo, pois a lesão e o homicídio se fundem em um único tipo penal, como o latrocínio."
      },
      "resposta_correta": "B",
      "pagina_pdf": "20",
      "trecho_consulta": "Progressão criminosa: quando o agente pretende inicialmente produzir um resultado e, depois de alcança-lo, opta por prosseguir na prática ilícita e reinicia outra conduta, produzindo um evento mais grave. Pluralidade de designios, havendo alteração em seu dolo."
    },
    {
      "enunciado": "O Código Penal Militar (Decreto-Lei 1.001/1969), em seu art. 2º, § 2º, trata da combinação de leis penais. Qual o posicionamento explícito adotado por essa legislação específica?",
      "alternativas": {
        "A": "Permite expressamente a combinação de leis, desde que para beneficiar o réu, adotando a teoria da ponderação diferenciada.",
        "B": "Proíbe expressamente a combinação de leis, alinhando-se à teoria da ponderação unitária ou global.",
        "C": "É omisso quanto à combinação de leis, deixando a critério da jurisprudência militar a decisão.",
        "D": "Permite a combinação de leis apenas em tempos de guerra, como exceção."
      },
      "resposta_correta": "B",
      "pagina_pdf": "14",
      "trecho_consulta": "Por fim, o Código Penal Militar (Decreto-lei 1.001/1969), em seu art. 2.º, § 2.º, proíbe expressamente a combinação de leis."
    },
    {
      "enunciado": "Se uma lei penal em branco ao avesso (preceito primário completo, secundário incompleto) tem seu complemento normativo (que define a sanção ou aspectos da punibilidade) revogado sem substituição, qual a consequência para a punibilidade dos fatos praticados sob sua égide?",
      "alternativas": {
        "A": "A punibilidade é mantida, aplicando-se por analogia a sanção de crime semelhante.",
        "B": "A revogação do complemento inviabiliza a punibilidade, pois, embora a conduta seja criminosa, torna-se impossível a imposição de pena devido à lacuna legislativa.",
        "C": "A punibilidade subsiste, devendo o juiz fixar a pena com base nos princípios gerais do direito e na culpabilidade do agente.",
        "D": "Aplica-se a sanção prevista na lei anterior ao complemento revogado, por ultratividade benéfica."
      },
      "resposta_correta": "B",
      "pagina_pdf": "16",
      "trecho_consulta": "Por fim, quanto a lei penal em branco ao avesso, o preceito primário é completo, mas o preceito secundário depende de complementação. Nesse caso, a revogação do complemento inviabiliza a punibilidade. Embora a conduta criminosa tenha perfeita descrição normativa, não será possível a imposição de pena, diante da lacuna legislativa a seu respeito."
    },
    {
      "enunciado": "Qual a principal diferença entre o 'crime progressivo' e a 'progressão criminosa' no contexto da aplicação do princípio da consunção?",
      "alternativas": {
        "A": "No crime progressivo há unidade de desígnios desde o início para o resultado mais grave, enquanto na progressão criminosa há uma alteração no dolo do agente, que inicialmente queria um resultado menos grave.",
        "B": "No crime progressivo o agente pratica vários crimes autônomos que são somados, enquanto na progressão criminosa um crime absorve o outro.",
        "C": "O crime progressivo sempre envolve crimes contra a pessoa, e a progressão criminosa, crimes contra o patrimônio.",
        "D": "Não há diferença substancial, sendo termos sinônimos para a mesma hipótese de absorção de um crime menos grave por um mais grave."
      },
      "resposta_correta": "A",
      "pagina_pdf": "19-20",
      "trecho_consulta": "Crime progressivo: quando o agente, almejando desde o início alcançar o resultado mais grave, pratica, a reiteração de atos, crescentes violações aos bens jurídicos. (...) Progressão criminosa: quando o agente pretende inicialmente produzir um resultado e, depois de alcança-lo, opta por prosseguir na prática ilícita e reinicia outra conduta, produzindo um evento mais grave. Pluralidade de designios, havendo alteração em seu dolo."
    },
    {
      "enunciado": "Considerando a teoria da atividade (Art. 4º CP) e a Súmula 711 do STF, se um crime permanente tem início sob a vigência da lei A (mais branda) e sua permanência cessa já sob a vigência da lei B (mais gravosa), qual lei será aplicada e por quê?",
      "alternativas": {
        "A": "Lei A, pois a conduta criminosa iniciou-se sob sua égide, aplicando-se a ultratividade da lei mais benéfica.",
        "B": "Lei B (mais gravosa), pois, conforme Súmula 711 do STF, a lei penal mais grave aplica-se se sua vigência é anterior à cessação da permanência, considerando-se o crime praticado também sob sua vigência.",
        "C": "Será feita uma combinação das leis, aplicando-se os aspectos mais favoráveis de A e B.",
        "D": "Lei A para o período anterior à lei B, e Lei B para o período posterior, cindindo-se a aplicação da pena."
      },
      "resposta_correta": "B",
      "pagina_pdf": "22",
      "trecho_consulta": "Por fim, quanto ao crime permanente e continuado, dispõe a Súmula 711 do Supremo Tribunal Federal: 'A lei penal mais grave aplica-se ao crime continuado ou ao crime permanente, se a sua vigência é anterior à cessação da continuidade ou da permanência'."
    },
    {
      "enunciado": "Segundo o princípio da personalidade ou nacionalidade ativa, previsto no Art. 7º, I, 'd' e II, 'b' do CP, em que circunstância um brasileiro que comete crime no exterior pode ser submetido à lei brasileira?",
      "alternativas": {
        "A": "Apenas se o crime também for punível no país onde foi praticado e a vítima for brasileira.",
        "B": "Independentemente da nacionalidade da vítima ou do bem jurídico ofendido, e mesmo que o crime não seja punível no local da prática, se for hipótese de extraterritorialidade incondicionada (ex: genocídio).",
        "C": "Somente se o crime for contra a vida ou a liberdade do Presidente da República.",
        "D": "Apenas se o brasileiro retornar ao Brasil e não tiver sido julgado no exterior, e o crime for punível em ambos os países."
      },
      "resposta_correta": "B",
      "pagina_pdf": "23-24",
      "trecho_consulta": "Princípio da personalidade ou da nacionalidade: autoriza a submissão à lei brasileira dos crimes praticados no estrangeiro por autor brasileiro (ativa) (...). De acordo com a personalidade ativa, o agente é punido de acordo com a lei brasileira, independentemente da nacionalidade do sujeito passivo e do bem jurídico ofendido. É previsto no art. 7.º, I, alínea 'd' ('quando o agente for brasileiro'), e também pelo inciso II, alínea 'b', do Código Penal."
    },
    {
      "enunciado": "O conceito de território brasileiro, para fins de aplicação da lei penal (Art. 5º CP), abrange o mar territorial. Qual a extensão desse mar territorial e qual a principal ressalva ao exercício da soberania brasileira nessa faixa?",
      "alternativas": {
        "A": "200 milhas marítimas, sem qualquer ressalva à soberania plena.",
        "B": "12 milhas marítimas de largura, sendo a soberania brasileira absoluta, impedindo qualquer trânsito de navios estrangeiros.",
        "C": "12 milhas marítimas de largura, medidas a partir da baixa-mar, não obstando o direito de passagem inocente de navios de outros Estados.",
        "D": "Até onde alcançam os rios e lagos internacionais que deságuam no oceano, com soberania exclusiva para exploração econômica."
      },
      "resposta_correta": "C",
      "pagina_pdf": "25",
      "trecho_consulta": "O mar territorial, ou marginal, que corre ao longo da costa como parte integrante do território brasileiro e que tem uma faixa de doze milhas marítimas de largura, medidas a partir da baixa-mar do litoral continental e insular brasileiro (...). O conceito de território não obsta, contudo, o direito de passagem inocente, isto é, a prerrogativa de navios mercantes ou militares de qualquer Estado de transitarem livremente pelo mar territorial..."
    },
    {
      "enunciado": "A teoria da ubiquidade, adotada pelo Art. 6º do CP para o lugar do crime, considera praticado o crime no lugar da ação/omissão ou do resultado. Contudo, para fins de competência interna nos crimes plurilocais (conduta em uma comarca, resultado em outra, dentro do Brasil), qual teoria geralmente prevalece segundo o Código de Processo Penal (Art. 70)?",
      "alternativas": {
        "A": "Teoria da atividade, fixando-se a competência onde a ação ou omissão ocorreu.",
        "B": "Teoria da ubiquidade, permitindo que qualquer das comarcas (da ação ou do resultado) seja competente, à escolha da acusação.",
        "C": "Teoria do resultado, determinando-se a competência, em regra, pelo lugar em que se consumar a infração.",
        "D": "Teoria do domicílio do réu, para facilitar sua defesa."
      },
      "resposta_correta": "C",
      "pagina_pdf": "51 (Gabarito Questão Desafio, citando art. 70 CPP)",
      "trecho_consulta": "A teoria da ubiquidade não se aplica nos casos de (...) crimes plurilocais (aqueles em que a conduta e o resultado ocorrem em comarcas diversas, mas no mesmo país). (...) Portanto, aplica-se a regra, para os crimes plurilocais, do artigo 70, caput, do Código de Processo Penal, ou seja, a competência será determinada pelo lugar em que se consumar a infração..."
    },
    {
      "enunciado": "Em caso de crime cometido por estrangeiro contra brasileiro, fora do Brasil (Art. 7º, §3º, CP), além das condições gerais da extraterritorialidade condicionada (Art. 7º, §2º), quais são as condições adicionais específicas para aplicação da lei penal brasileira?",
      "alternativas": {
        "A": "Entrada do agente no Brasil e ser o fato punível no local da prática.",
        "B": "Não ter sido pedida ou ter sido negada a extradição do agente estrangeiro E ter havido requisição do Ministro da Justiça.",
        "C": "O crime ser considerado hediondo pela lei brasileira E o agente possuir bens no Brasil para reparação do dano.",
        "D": "Haver tratado de cooperação penal com o país onde o crime ocorreu E o agente estrangeiro ser reincidente."
      },
      "resposta_correta": "B",
      "pagina_pdf": "29",
      "trecho_consulta": "De outro lado, no caso de crime cometido por estrangeiro contra brasileiro, fora do Brasil, exigem-se outras duas condições, além das anteriormente indicadas, quais sejam: 1. Não ter sido pedida ou ter sido negada a extradição; 2. Ter havido requisição do Ministro da Justiça."
    },
    {
      "enunciado": "A sentença penal estrangeira, para obrigar o condenado à reparação do dano no Brasil, necessita de homologação pelo STJ. Essa homologação ocorre de ofício ou depende de alguma iniciativa?",
      "alternativas": {
        "A": "Ocorre de ofício pelo STJ, assim que toma conhecimento da sentença estrangeira.",
        "B": "Depende de pedido da parte interessada (ex: a vítima ou seus herdeiros).",
        "C": "Depende de requisição do Ministro da Justiça, em qualquer caso.",
        "D": "Depende de acordo bilateral entre o Brasil e o país que proferiu a sentença."
      },
      "resposta_correta": "B",
      "pagina_pdf": "29",
      "trecho_consulta": "SENTENÇA PENAL PRECISA SER HOMOLOGADA PARA... Gerar EFEITOS CIVIS. A HOMOLOGAÇÃO DEPENDE DE... PEDIDO da parte interessada."
    },
    {
      "enunciado": "Um agente é condenado a uma pena de 3 anos, 2 meses e 15 dias de reclusão. Ao aplicar o Art. 11 do CP, como o juiz deve proceder em relação à fração de '15 dias'?",
      "alternativas": {
        "A": "Arredondar para 1 mês, totalizando 3 anos e 3 meses.",
        "B": "Desprezar os 15 dias, fixando a pena em 3 anos e 2 meses.",
        "C": "Converter os 15 dias em pena de multa.",
        "D": "Manter os 15 dias, pois o desprezo de frações se aplica apenas à pena de multa."
      },
      "resposta_correta": "B",
      "pagina_pdf": "30",
      "trecho_consulta": "Destarte, as frações de dia são desprezadas no momento de aplicação da pena privativa de liberdade."
    },
    {
      "enunciado": "Considere a Lei de Drogas (Lei 11.343/2006) como legislação especial. Se esta lei for omissa quanto a um critério de fixação da pena-base, qual norma deverá ser consultada para suprir tal omissão, de acordo com o Art. 12 do CP?",
      "alternativas": {
        "A": "O Código de Processo Penal, por se tratar de matéria processual.",
        "B": "As regras gerais do Código Penal, especificamente o Art. 59 do CP.",
        "C": "A jurisprudência consolidada dos tribunais superiores sobre a Lei de Drogas.",
        "D": "A lei penal especial mais próxima que trate de matéria semelhante, por analogia."
      },
      "resposta_correta": "B",
      "pagina_pdf": "30",
      "trecho_consulta": "Prevista no art. 12 do Código Penal: 'As regras gerais deste Código aplicam-se aos fatos incriminados por lei especial, se esta não dispuser de modo diverso'. Consagra o princípio da convivência das esferas autônomas, ou seja, o Código Penal será aplicado para toda legislação penal especial, é a regra geral."
    },
    {
      "enunciado": "No que tange à revogação tácita de uma lei penal, qual a principal diferença de sua ocorrência em comparação com a revogação global, mesmo que ambas não sejam expressas?",
      "alternativas": {
        "A": "A revogação tácita ocorre apenas quando a lei nova é hierarquicamente superior, enquanto a global se dá entre leis de mesma hierarquia.",
        "B": "A revogação tácita anula apenas artigos específicos da lei anterior que sejam incompatíveis com a nova, enquanto a revogação global torna toda a lei anterior desnecessária por a nova regular inteiramente a matéria.",
        "C": "A revogação tácita sempre depende de manifestação judicial para ser reconhecida, ao passo que a global tem efeitos imediatos.",
        "D": "A revogação tácita afeta apenas a parte sancionatória da lei penal, enquanto a global atinge tanto o preceito primário quanto o secundário."
      },
      "resposta_correta": "B",
      "pagina_pdf": "8-9",
      "trecho_consulta": "Tácita: ocorre quando um lei se mostra incompatível com a anterior, apesar de não haver menção expressa à revogação. Global: ocorre quando a nova lei regula inteiramente a matéria disciplinada pela lei anterior, que passa a ser ultrapassada e desnecessária."
    },
    {
      "enunciado": "A respeito da *abolitio criminis temporária*, exemplificada no material com o Estatuto do Desarmamento, qual a sua característica distintiva em relação à *abolitio criminis* comum?",
      "alternativas": {
        "A": "A *abolitio criminis temporária* só se aplica a crimes de menor potencial ofensivo, enquanto a comum pode incidir sobre qualquer delito.",
        "B": "A *abolitio criminis temporária* prevê a descriminalização transitória de uma conduta, geralmente condicionada a certas ações do agente dentro de um prazo, enquanto a comum é uma supressão definitiva da figura criminosa do ordenamento.",
        "C": "A *abolitio criminis temporária* não extingue os efeitos penais da condenação, apenas os suspende, diferentemente da comum.",
        "D": "A *abolitio criminis temporária* não precisa de lei para ser instituída, bastando portaria ministerial, ao contrário da comum."
      },
      "resposta_correta": "B",
      "pagina_pdf": "10",
      "trecho_consulta": "Além disso, é possível a o reconhecimento da abolitio criminis temporária, nas situações em que a lei prevê a descriminalização transitória de uma conduta. Exemplo recente foi os arts. 30 a 32 da Lei 10.826/2003 - Estatuto do Desarmamento..."
    },
    {
      "enunciado": "A expressão 'de qualquer modo favorecer o agente', contida no parágrafo único do Art. 2º do CP referente à *lex mitior*, deve ser interpretada de forma restritiva ou ampliativa? Qual exemplo ilustra uma interpretação ampliativa?",
      "alternativas": {
        "A": "Restritiva, limitando-se a casos de redução da pena cominada, não abrangendo, por exemplo, a criação de novas causas de diminuição.",
        "B": "Restritiva, aplicando-se apenas se a lei nova expressamente se declarar mais benéfica.",
        "C": "Ampliativa, abrangendo qualquer alteração que beneficie o réu, como a exclusão de uma qualificadora, a criação de uma causa de diminuição de pena, ou a alteração do prazo prescricional para menor.",
        "D": "Ampliativa, mas apenas para crimes sem violência ou grave ameaça, não se aplicando a crimes hediondos."
      },
      "resposta_correta": "C",
      "pagina_pdf": "11",
      "trecho_consulta": "A expressão 'de qualquer modo' deve ser interpretada de forma ampliativa, ou seja, excluísse uma qualificadora, cria-se uma causa de diminuição etc."
    },
    {
      "enunciado": "O fenômeno da ultratividade da lei penal mais benéfica ocorre quando:",
      "alternativas": {
        "A": "Uma lei mais grave entra em vigor e retroage para alcançar fatos praticados sob a lei anterior mais branda.",
        "B": "Uma lei, mesmo após revogada por outra mais prejudicial ao agente, continua a reger os fatos praticados durante sua vigência por ser mais favorável.",
        "C": "Uma lei nova mais benéfica é aplicada a fatos futuros, não alcançando os fatos pretéritos.",
        "D": "Uma lei temporária continua a produzir efeitos mesmo após seu prazo, independentemente de ser benéfica ou maléfica."
      },
      "resposta_correta": "B",
      "pagina_pdf": "11",
      "trecho_consulta": "Além disso, é possível a ocorrência do fenômeno da Ultratividade da lei mais benéfica. Ora, ocorre quando o crime foi praticado durante a vigência de uma lei, posteriormente revogada por outra prejudicial ao agente. Subsistem, no caso, os efeitos da lei anterior, mais favorável."
    },
    {
      "enunciado": "A posição atual e predominante do Supremo Tribunal Federal e do Superior Tribunal de Justiça (conforme Súmula 501 STJ) sobre a combinação de leis penais (*lex tertia*) é:",
      "alternativas": {
        "A": "Pela admissibilidade irrestrita, com base na teoria da ponderação diferenciada, visando sempre o maior benefício ao réu.",
        "B": "Pela inadmissibilidade, acolhendo a teoria da ponderação unitária ou global, que veda a criação de uma terceira lei pelo julgador, devendo este aplicar uma das leis integralmente.",
        "C": "Pela admissibilidade apenas em casos de crimes de tráfico de drogas, como exceção à regra geral de inadmissibilidade.",
        "D": "Pela admissibilidade condicionada à existência de lacuna na lei e ausência de ofensa à separação dos poderes."
      },
      "resposta_correta": "B",
      "pagina_pdf": "14",
      "trecho_consulta": "Entretanto, a inovação jurisprudencial não foi unânime, pois o Supremo Tribunal Federal rapidamente retomou sua posição tradicional, voltando a acolher a teoria da ponderação unitária, ou global, de modo a repelir a combinação de leis penais. Este é o entendimento atualmente adotado pela Corte Suprema, contrário à combinação de leis penais: (...) Súmula n.º 501, STJ: É cabível a aplicação retroativa da Lei n. 11.343/2006, desde que o resultado da incidência das suas disposições, na integra, seja mais favorável ao réu do que o advindo da aplicação da Lei n. 6.368/1976, sendo vedada a combinação de leis."
    },
    {
      "enunciado": "No contexto do conflito aparente de normas, o princípio da subsidiariedade tácita difere da expressa porque:",
      "alternativas": {
        "A": "Na tácita, a norma principal sempre absorve a subsidiária, enquanto na expressa ocorre o inverso.",
        "B": "Na tácita, a relação de dependência é identificada pelo intérprete através da análise dos bens jurídicos e da gravidade das condutas, sem que a lei contenha uma cláusula de exclusão; na expressa, a própria lei se declara subsidiária.",
        "C": "A subsidiariedade tácita só se aplica entre crimes da mesma espécie, e a expressa entre crimes de espécies diferentes.",
        "D": "A subsidiariedade tácita é uma criação doutrinária não aceita pela jurisprudência, que apenas reconhece a expressa."
      },
      "resposta_correta": "B",
      "pagina_pdf": "19",
      "trecho_consulta": "Subsidiariedade expressa ou explícita: a própria norma penal se declara subsidiária... Subsidiariedade tácita ou implícita: a norma penal não se declara subsidiária, mas esta circunstância é extraída da análise do caso concreto."
    },
    {
      "enunciado": "O crime complexo, como o roubo (furto + ameaça/lesão), é uma hipótese de aplicação do princípio da consunção. Como se dá essa absorção?",
      "alternativas": {
        "A": "Os crimes componentes (furto e ameaça) são punidos em concurso material com o roubo.",
        "B": "O crime complexo (roubo) absorve os delitos autônomos que compõem sua estrutura típica, respondendo o agente apenas pelo crime complexo.",
        "C": "O crime menos grave (ameaça) absorve o mais grave (furto) dentro da estrutura do roubo.",
        "D": "Aplica-se apenas o crime componente que tiver a pena mais alta, desprezando-se o outro."
      },
      "resposta_correta": "B",
      "pagina_pdf": "19",
      "trecho_consulta": "Crime complexo: da fusão de dois ou mais crimes, que passam a desempenhar a função de elementares ou circunstâncias daquele, tal como se dá no roubo, união do furto e ameaça/lesão corporal. O crime complexo absorve os delitos autônomos que compõe a sua estrutura típica."
    },
    {
      "enunciado": "Quanto aos atos impuníveis (anteriores, simultâneos e posteriores) no âmbito da consunção, como se caracterizam os atos anteriores impuníveis?",
      "alternativas": {
        "A": "São condutas praticadas após a consumação do crime principal para assegurar sua vantagem, e são punidas autonomamente.",
        "B": "São atos que funcionam como meios de execução do tipo principal, ficando por este absorvidos, desde que não constituam crimes mais graves.",
        "C": "São atos praticados concomitantemente ao crime principal, mas que possuem punição independente por protegerem bens jurídicos diversos.",
        "D": "São atos que, embora anteriores, não guardam qualquer relação de causalidade com o crime principal, sendo sempre irrelevantes."
      },
      "resposta_correta": "B",
      "pagina_pdf": "20",
      "trecho_consulta": "Atos impuníveis: são divididos em três grupos: anteriores, simultâneos e posteriores. Os anteriores são os que funcionam como meios de execução do tipo principal, ficando por estes absorvidos."
    },
    {
      "enunciado": "O princípio da alternatividade própria (ou nos tipos mistos alternativos) implica que:",
      "alternativas": {
        "A": "Se o agente realizar mais de um núcleo do tipo contra objetos materiais distintos, responderá por um único crime devido à alternatividade.",
        "B": "A realização de múltiplos núcleos do mesmo tipo penal contra o mesmo objeto material configura um único crime, pois as diversas condutas são fungíveis dentro do tipo.",
        "C": "O agente pode escolher por qual núcleo do tipo penal deseja ser processado, caso pratique mais de um.",
        "D": "A alternatividade própria é um princípio que soluciona o conflito entre duas leis distintas que preveem o mesmo fato, aplicando-se a mais específica."
      },
      "resposta_correta": "B",
      "pagina_pdf": "20",
      "trecho_consulta": "Alternatividade Própria: ocorre nos tipos mistos alternativos (ação múltipla ou conteúdo variado), são aqueles que possuem dois ou mais núcleos e se o agente realizar mais de um núcleo, contra o mesmo objeto material, estará realizado um único crime."
    },
    {
      "enunciado": "Existe previsão legal expressa no Código Penal brasileiro para a solução do conflito aparente de leis penais e os princípios que o regem?",
      "alternativas": {
        "A": "Sim, o Código Penal dedica um capítulo específico para tratar do conflito aparente de normas e elenca os princípios da especialidade, subsidiariedade e consunção.",
        "B": "Não, o Código Penal não disciplinou expressamente o assunto, sendo os princípios solucionadores construções doutrinárias e jurisprudenciais.",
        "C": "Sim, o Art. 1º do Código Penal estabelece a prevalência da norma mais específica em caso de conflito.",
        "D": "Não, mas a Lei de Introdução às Normas do Direito Brasileiro (LINDB) traz as regras para solucionar esses conflitos no âmbito penal."
      },
      "resposta_correta": "B",
      "pagina_pdf": "20",
      "trecho_consulta": "O conflito aparente de leis penais não tem previsão legal. O Código Penal não disciplinou expressamente o assunto."
    },
    {
      "enunciado": "No crime habitual, caracterizado pela reiteração de condutas, se durante a prática delitiva sobrevém lei nova mais severa e o agente persiste na conduta criminosa sob a égide da nova lei, qual lei se aplica?",
      "alternativas": {
        "A": "Aplica-se a lei anterior mais branda, pois o início da atividade criminosa se deu sob sua vigência.",
        "B": "Aplica-se a nova lei mais severa a toda a conduta habitual, inclusive aos atos praticados antes de sua vigência, por ficção jurídica.",
        "C": "Aplica-se a nova lei mais severa, pois a reiteração da conduta sob seu império configura a prática do crime também sob a nova legislação.",
        "D": "Cinde-se a aplicação: a lei antiga para os atos anteriores e a nova para os atos posteriores à sua vigência, calculando-se a pena proporcionalmente."
      },
      "resposta_correta": "C",
      "pagina_pdf": "21",
      "trecho_consulta": "No crime habitual em que haja sucessão de leis, deve ser aplicada a nova, ainda que mais severa, se o agente insistir em reiterar a conduta criminosa."
    },
    {
      "enunciado": "O Art. 5º, §2º, do CP estabelece a aplicabilidade da lei brasileira a crimes praticados a bordo de aeronaves ou embarcações estrangeiras de propriedade privada sob certas condições. Quais são essas condições?",
      "alternativas": {
        "A": "Apenas se o crime for cometido contra brasileiro ou por brasileiro, independentemente da localização da aeronave/embarcação.",
        "B": "Se as aeronaves estiverem em pouso no território nacional ou em voo no espaço aéreo correspondente, e as embarcações em porto ou mar territorial do Brasil.",
        "C": "Somente se houver tratado de reciprocidade com o país de bandeira da aeronave/embarcação.",
        "D": "Independentemente de sua localização, desde que o comandante solicite a intervenção das autoridades brasileiras."
      },
      "resposta_correta": "B",
      "pagina_pdf": "23",
      "trecho_consulta": "§ 2º - É também aplicável a lei brasileira aos crimes praticados a bordo de aeronaves ou embarcações estrangeiras de propriedade privada, achando-se aquelas em pouso no território nacional ou em vôo no espaço aéreo correspondente, e estas em porto ou mar territorial do Brasil."
    },
    {
      "enunciado": "O princípio da personalidade passiva, como forma de extraterritorialidade, permite a aplicação da lei brasileira quando:",
      "alternativas": {
        "A": "O agente do crime é brasileiro, não importando a nacionalidade da vítima.",
        "B": "O crime é cometido no Brasil por agente estrangeiro contra vítima estrangeira.",
        "C": "A vítima do crime é brasileira, mesmo que o crime tenha sido cometido no exterior por agente estrangeiro, observadas as condições legais (ex: Art. 7º, §3º CP).",
        "D": "O agente é domiciliado no Brasil, ainda que estrangeiro, e o crime ocorre no exterior."
      },
      "resposta_correta": "C",
      "pagina_pdf": "24",
      "trecho_consulta": "Já o princípio da personalidade passiva aplica-se nos casos em que a vítima é brasileira. O autor do delito que se encontrar em território brasileiro, embora seja estrangeiro, deverá ser julgado de acordo com a nossa lei penal. É adotado pelo art. 7.º, § 3.º, do Código Penal."
    },
    {
      "enunciado": "O princípio da defesa (real ou da proteção) fundamenta a extraterritorialidade da lei brasileira em quais situações principais?",
      "alternativas": {
        "A": "Quando o crime é cometido por brasileiro no exterior contra qualquer bem jurídico.",
        "B": "Quando o crime é praticado no estrangeiro, por qualquer agente, e ofende bens jurídicos relevantes para o Estado brasileiro, como a vida do Presidente, o patrimônio público ou a fé pública.",
        "C": "Quando a vítima do crime é brasileira e o delito ocorre em país que não o pune adequadamente.",
        "D": "Quando o Brasil se obriga, por tratado, a reprimir determinado crime, independentemente do local ou da nacionalidade do agente/vítima."
      },
      "resposta_correta": "B",
      "pagina_pdf": "24",
      "trecho_consulta": "Princípio da defesa, real ou da proteção: permite submeter à lei penal brasileira os crimes praticados no estrangeiro que ofendam bens jurídicos pertencentes ao Brasil, qualquer que seja a nacionalidade do agente e o local do delito. Adotado pelo Código Penal, em seu art. 7.º, I, alíneas 'a', 'b' e 'c'..."
    },
    {
      "enunciado": "O princípio da justiça universal (ou cosmopolita) autoriza a aplicação da lei penal brasileira a crimes que, por sua natureza, afetam a comunidade internacional. Qual hipótese do Art. 7º, II, do CP exemplifica sua adoção?",
      "alternativas": {
        "A": "Crimes praticados por brasileiro no exterior (Art. 7º, II, 'b').",
        "B": "Crimes cometidos em aeronaves ou embarcações brasileiras privadas no estrangeiro e aí não julgados (Art. 7º, II, 'c').",
        "C": "Os crimes que, por tratado ou convenção, o Brasil se obrigou a reprimir (Art. 7º, II, 'a').",
        "D": "Crimes contra a administração pública, por quem está a seu serviço, mesmo no exterior (Art. 7º, I, 'c')."
      },
      "resposta_correta": "C",
      "pagina_pdf": "24",
      "trecho_consulta": "Princípio da justiça universal: (...) Fundamenta-se no dever de solidariedade na repressão de certos delitos cuja punição interessa a todos os povos. É adotado no art. 7.º, II, 'a', do Código Penal: 'os crimes que, por tratado ou convenção, o Brasil se obrigou a reprimir'."
    },
    {
      "enunciado": "O princípio da representação (pavilhão ou bandeira) aplica-se especificamente a qual situação de extraterritorialidade condicionada, prevista no Art. 7º, II, 'c', do CP?",
      "alternativas": {
        "A": "Crimes cometidos por brasileiros no exterior, independentemente do local exato.",
        "B": "Crimes contra a vida ou liberdade do Presidente da República, onde quer que ocorram.",
        "C": "Crimes cometidos em aeronaves ou embarcações brasileiras, mercantes ou de propriedade privada, quando em território estrangeiro e aí não sejam julgados.",
        "D": "Crimes de genocídio, quando o agente for brasileiro ou domiciliado no Brasil."
      },
      "resposta_correta": "C",
      "pagina_pdf": "24",
      "trecho_consulta": "Princípio da representação: também denominado princípio do pavilhão, da bandeira, subsidiário ou da substituição. Segundo esse princípio, deve ser aplicada a lei penal brasileira aos crimes cometidos em aeronaves ou embarcações brasileiras, mercantes ou de propriedade privada, quando estiverem em território estrangeiro e aí não sejam julgados. É adotado pelo art. 7.º, II, 'c', do Código Penal."
    },
    {
      "enunciado": "Além do espaço territorial físico e do mar territorial, o que mais o conceito de território brasileiro abrange para fins de aplicação da lei penal, segundo a descrição de Cleber Masson citada no material?",
      "alternativas": {
        "A": "Apenas as embaixadas e consulados brasileiros no exterior.",
        "B": "A plataforma continental, o espaço aéreo correspondente, e navios e aeronaves públicas onde quer que se encontrem, além de navios/aeronaves particulares em alto-mar ou espaço aéreo correspondente.",
        "C": "Qualquer local onde um cidadão brasileiro esteja presente, por extensão da soberania pessoal.",
        "D": "Exclusivamente o solo continental e as ilhas, excluindo-se o mar e o espaço aéreo por serem de uso internacional."
      },
      "resposta_correta": "B",
      "pagina_pdf": "25",
      "trecho_consulta": "O território brasileiro compreende (Cleber Masson): O espaço territorial delimitado... O mar territorial... A plataforma continental... O espaço aéreo... Os navios e aeronaves, de natureza particular, em alto-mar ou no espaço aéreo correspondente ao alto-mar; Os navios e aeronaves, de natureza pública, onde quer que se encontrem..."
    },
    {
      "enunciado": "A teoria da ubiquidade, adotada pelo Art. 6º do CP para o lugar do crime, tem especial relevância para os chamados 'crimes à distância' ou 'de espaço máximo'. O que caracteriza esses crimes?",
      "alternativas": {
        "A": "São crimes em que a conduta e o resultado ocorrem no mesmo país, mas em comarcas muito distantes entre si.",
        "B": "São crimes em que a conduta é praticada em um país e o resultado ocorre em outro país diverso.",
        "C": "São crimes cometidos exclusivamente por meio da internet, transcendendo fronteiras físicas.",
        "D": "São crimes cuja investigação é extremamente complexa devido à distância entre o local do fato e a sede do juízo."
      },
      "resposta_correta": "B",
      "pagina_pdf": "26",
      "trecho_consulta": "O art. 6º do CP aplica-se apenas aos crimes à distância, também conhecidos como crimes de espaço máximo, em que a conduta e o resultado ocorrem em países diversos."
    },
    {
      "enunciado": "Uma das exceções à aplicação da teoria da ubiquidade do Art. 6º CP para fins de definição da lei aplicável ou competência refere-se aos atos infracionais. Qual critério o Estatuto da Criança e do Adolescente (Lei 8.069/1990, Art. 147, §1º) estabelece para determinar a competência nesses casos?",
      "alternativas": {
        "A": "O lugar onde o resultado do ato infracional se produziu.",
        "B": "O lugar da ação ou da omissão, independentemente do resultado (teoria da atividade).",
        "C": "Tanto o lugar da ação/omissão quanto o do resultado (teoria da ubiquidade), à escolha do representante do Ministério Público.",
        "D": "O domicílio dos pais ou responsável pelo adolescente."
      },
      "resposta_correta": "B",
      "pagina_pdf": "27",
      "trecho_consulta": "Atos infracionais: para os crimes ou contravenções penais praticados por crianças e adolescentes, será competente a autoridade do lugar da ação ou da omissão (Lei 8.069/1990 ECA, art. 147, § 1.°)."
    },
    {
      "enunciado": "Conforme o Art. 2º do Decreto-Lei nº 3.688/1941 (Lei das Contravenções Penais), qual é a regra de aplicabilidade da lei brasileira às contravenções penais praticadas no estrangeiro?",
      "alternativas": {
        "A": "Aplica-se a lei brasileira, desde que o autor da contravenção seja brasileiro e retorne ao Brasil.",
        "B": "Não se admite a aplicação da lei penal brasileira às contravenções penais praticadas no estrangeiro.",
        "C": "Aplica-se a lei brasileira apenas se a contravenção também for punível no país onde foi praticada.",
        "D": "Aplica-se a lei brasileira se a contravenção for cometida contra patrimônio público brasileiro no exterior."
      },
      "resposta_correta": "B",
      "pagina_pdf": "27",
      "trecho_consulta": "Não se admite a aplicação da lei penal brasileira às contravenções penais praticadas no estrangeiro, de acordo com a regra estabelecida pelo art. 2.º do Decreto-lei 3.688/1941 Lei das Contravenções Penais."
    },
    {
      "enunciado": "Dentre as hipóteses de extraterritorialidade incondicionada (Art. 7º, I, CP), qual delas se refere a crimes contra bens jurídicos da administração pública brasileira?",
      "alternativas": {
        "A": "Crimes contra a vida ou a liberdade do Presidente da República.",
        "B": "Crimes de genocídio, quando o agente for brasileiro ou domiciliado no Brasil.",
        "C": "Crimes contra a administração pública, por quem está a seu serviço, e crimes contra o patrimônio ou a fé pública da União, DF, Estados, Municípios, ou entidades da administração indireta.",
        "D": "Crimes que, por tratado ou convenção, o Brasil se obrigou a reprimir."
      },
      "resposta_correta": "C",
      "pagina_pdf": "28",
      "trecho_consulta": "Art. 7º Ficam sujeitos à lei brasileira, embora cometidos no estrangeiro: I - os crimes: (...) b) contra o patrimônio ou a fé pública da União, do Distrito Federal, de Estado, de Território, de Município, de empresa pública, sociedade de economia mista, autarquia ou fundação instituída pelo Poder Público; c) contra a administração pública, por quem está a seu serviço;"
    },
    {
      "enunciado": "Na extraterritorialidade condicionada, uma das condições é que o crime esteja 'incluído entre aqueles pelos quais a lei brasileira autoriza a extradição' (Art. 7º, §2º, 'c', CP). Qual a implicação lógica dessa condição?",
      "alternativas": {
        "A": "Significa que o Brasil só pode punir crimes que ele próprio extraditaria, indicando uma reciprocidade de gravidade delitiva.",
        "B": "Impede que o Brasil julgue crimes políticos ou de opinião cometidos no exterior por brasileiros.",
        "C": "Exige que o país onde o crime ocorreu formalmente solicite a extradição do agente ao Brasil.",
        "D": "Limita a aplicação da lei brasileira a crimes que tenham pena mínima superior a 2 anos, que é o critério para extradição."
      },
      "resposta_correta": "A",
      "pagina_pdf": "29",
      "trecho_consulta": "c) estar o crime incluído entre aqueles pelos quais a lei brasileira autoriza a extradição;"
    },
    {
      "enunciado": "Em que situação específica a homologação de sentença penal estrangeira pelo STJ depende de 'pedido da parte interessada', conforme o Art. 9º do CP?",
      "alternativas": {
        "A": "Para sujeitar o condenado a medida de segurança.",
        "B": "Para gerar efeitos civis, como a obrigação de reparar o dano ou a restituições.",
        "C": "Para que a pena cumprida no exterior seja computada na pena brasileira.",
        "D": "Para reconhecer a reincidência do agente em território nacional."
      },
      "resposta_correta": "B",
      "pagina_pdf": "29",
      "trecho_consulta": "SENTENÇA PENAL PRECISA SER HOMOLOGADA PARA... Gerar EFEITOS CIVIS. A HOMOLOGAÇÃO DEPENDE DE... PEDIDO da parte interessada."
    },
    {
      "enunciado": "Um prazo decadencial para oferecimento de queixa-crime, que é de natureza penal, encerra-se em um domingo. Considerando a regra do Art. 10 do CP sobre contagem de prazos penais, qual o último dia para o exercício desse direito?",
      "alternativas": {
        "A": "O próprio domingo, pois o prazo penal é fatal e improrrogável.",
        "B": "A segunda-feira subsequente, por aplicação subsidiária das regras processuais civis.",
        "C": "A sexta-feira anterior ao domingo, pois o direito deve ser exercido antes do vencimento do prazo improrrogável.",
        "D": "O sábado, se houver expediente forense; caso contrário, a sexta-feira."
      },
      "resposta_correta": "C",
      "pagina_pdf": "30",
      "trecho_consulta": "OS PRAZOS PENAIS SÃO IMPRORROGÁVEIS, MESMO QUE TERMINEM EM SÁBADOS, DOMINGOS OU FERIADOS. Assim, se o prazo decadencial para o oferecimento de queixa-crime encerrar em um domingo, o titular do direito de queixa ou de representação deverá exercê-lo até a sexta-feira anterior."
    },
    {
      "enunciado": "No que se refere à aplicação da lei penal no tempo, se uma lei nova diminui a pena de um crime, mas o agente já iniciou o cumprimento da pena fixada com base na lei antiga (mais gravosa) após o trânsito em julgado, qual o procedimento correto?",
      "alternativas": {
        "A": "A lei nova não se aplica, pois a sentença já transitou em julgado e a execução foi iniciada, prevalecendo a coisa julgada.",
        "B": "A lei nova é aplicada retroativamente pelo juízo da execução, que fará a adequação da pena, mesmo com a execução em curso (Súmula 611 STF).",
        "C": "A aplicação da lei nova dependerá de ação revisional proposta pela defesa perante o tribunal superior.",
        "D": "A lei nova só se aplicará se o agente ainda não tiver cumprido 1/3 da pena imposta pela lei antiga."
      },
      "resposta_correta": "B",
      "pagina_pdf": "12",
      "trecho_consulta": "Art. 2º, parágrafo único, Código Penal - A lei posterior, que de qualquer modo favorecer o agente, aplica-se aos fatos anteriores, ainda que decididos por sentença condenatória transitada em julgado. (...) Súmula n.º 611, STF. Transitada em julgado a sentença condenatória, compete ao juízo das execuções a aplicação de lei mais benéfica."
    },
    {
      "enunciado": "Considere um crime de sequestro (crime permanente) iniciado sob a lei X, que previa pena de 2 a 8 anos. Durante o cativeiro, entra em vigor a lei Y, que eleva a pena para 5 a 10 anos. A vítima é libertada já na vigência da lei Y. Qual pena será considerada para o agente, conforme a Súmula 711 do STF?",
      "alternativas": {
        "A": "A pena da lei X (2 a 8 anos), pois foi a lei vigente no início da execução do crime.",
        "B": "A pena da lei Y (5 a 10 anos), pois sua vigência é anterior à cessação da permanência.",
        "C": "Uma média entre as penas das leis X e Y, por critério de equidade.",
        "D": "A pena da lei X, a menos que a lei Y expressamente determine sua aplicação a crimes em curso."
      },
      "resposta_correta": "B",
      "pagina_pdf": "11",
      "trecho_consulta": "Os crimes permanente e continuado têm uma especificidade, constante na súmula 711 do STF: 'A lei penal mais grave aplica-se ao crime continuado ou ao crime permanente, se a sua vigência é anterior à cessação da continuidade ou da permanência'."
    },
    {
      "enunciado": "A irretroatividade de novo entendimento jurisprudencial mais gravoso (STF HC 161452 AgR) significa que:",
      "alternativas": {
        "A": "Uma mudança na interpretação da lei penal pelos tribunais, se mais severa ao réu, só se aplica a fatos ocorridos após essa nova orientação.",
        "B": "Uma nova súmula vinculante que agrave a situação do réu não pode retroagir para atingir atos pretéritos.",
        "C": "A proibição de retroatividade da lei penal mais gravosa (Art. 5º, XL, CF) não se estende às mudanças de interpretação jurisprudencial, que podem ser aplicadas a fatos passados mesmo que desfavoráveis.",
        "D": "Apenas leis em sentido estrito são irretroativas se mais gravosas; a jurisprudência, por não ser lei, pode retroagir livremente."
      },
      "resposta_correta": "C",
      "pagina_pdf": "13",
      "trecho_consulta": "Os preceitos constitucionais relativos à aplicação retroativa da norma penal benéfica, bem como à irretroatividade da norma mais grave ao acusado (art. 5°, XL, da Constituição Federal), são inaplicáveis aos precedentes jurisprudenciais. STF. 1ª Turma. HC 161452 AgR..."
    },
    {
      "enunciado": "Se um agente furta um objeto (Art. 155 CP) e, para assegurar a posse da coisa, emprega violência contra a vítima que tenta recuperá-la, transformando a conduta em roubo impróprio (Art. 157, §1º CP), qual princípio de solução de conflito aparente de normas se aplica?",
      "alternativas": {
        "A": "Especialidade, pois o roubo impróprio é uma forma especial de furto.",
        "B": "Subsidiariedade, pois o furto é subsidiário em relação ao roubo.",
        "C": "Consunção, pois o roubo impróprio (fato mais complexo e grave) absorve o furto inicial e a violência subsequente como fases de sua constituição.",
        "D": "Alternatividade, pois o agente responderia por furto ou por roubo, conforme o momento da violência."
      },
      "resposta_correta": "C",
      "pagina_pdf": "19 (por analogia à estrutura do crime complexo e progressão)",
      "trecho_consulta": "Princípio da consunção: o fato mais amplo e grave absorve os demais fatos menos amplos e graves. (...) Crime complexo: da fusão de dois ou mais crimes... (O roubo impróprio, embora não seja um crime complexo clássico no sentido de fusão de tipos autônomos preexistentes na sua definição, envolve uma progressão da conduta de furto para roubo mediante violência/grave ameaça, sendo a consunção o princípio aplicável para que o agente responda apenas pelo roubo)."
    },
    {
      "enunciado": "Qual o critério adotado pelo Código Penal para definir o 'tempo do crime' em relação a um menor que pratica um ato infracional análogo a crime aos 17 anos, 11 meses e 29 dias, cujo resultado (morte da vítima) ocorre quando ele já completou 18 anos?",
      "alternativas": {
        "A": "Teoria do resultado: considera-se a data da morte da vítima; logo, responderia como adulto.",
        "B": "Teoria da ubiquidade: considera-se tanto a data da conduta quanto a do resultado; por ter completado 18 antes do resultado, responde como adulto.",
        "C": "Teoria da atividade: considera-se o momento da ação ou omissão; logo, por ser menor à época da conduta, submete-se ao ECA.",
        "D": "Teoria da intenção: avalia-se a capacidade de entendimento no momento do planejamento do ato, independentemente da idade na conduta ou resultado."
      },
      "resposta_correta": "C",
      "pagina_pdf": "21",
      "trecho_consulta": "O Código Penal adotou a TEORIA DA ATIVIDADE (tempus regit actum), em seu Art. 4.°: 'Considera-se praticado o crime no momento da ação ou omissão, AINDA QUE outro seja o momento do resultado'. (...) Exemplo: 'A', com a idade de 17 anos, 11 meses e 20 dias, efetua disparos... Não se aplicará ao autor o Código Penal, em face de sua inimputabilidade ao tempo do crime..."
    },
    {
      "enunciado": "A aplicação da lei penal brasileira a crimes cometidos no espaço aéreo sobrejacente ao mar territorial brasileiro fundamenta-se em qual aspecto da territorialidade?",
      "alternativas": {
        "A": "Território por extensão, aplicando-se apenas se a aeronave for brasileira.",
        "B": "Soberania do Estado sobre seu espaço aéreo, que é parte integrante do território nacional, conforme a teoria da absoluta soberania do país subjacente.",
        "C": "Princípio da justiça universal, se o crime afetar a segurança da aviação internacional.",
        "D": "Princípio da representação, se a aeronave for de propriedade de empresa com sede no Brasil."
      },
      "resposta_correta": "B",
      "pagina_pdf": "25",
      "trecho_consulta": "O espaço aéreo, compreendido como a dimensão estatal da altitude. Em relação ao domínio aéreo, adotou-se a teoria da absoluta soberania do país subjacente, pela qual o Brasil exerce completa e exclusiva soberania sobre o espaço aéreo acima de seu território e mar territorial (art. 11 da Lei 7.565/1986);"
    },
    {
      "enunciado": "A teoria da ubiquidade para o lugar do crime (Art. 6º CP) não se aplica para definir a competência nos crimes de competência do Juizado Especial Criminal (Lei 9.099/95). Qual teoria é adotada pelo Art. 63 da Lei 9.099/95 para este fim?",
      "alternativas": {
        "A": "Teoria do resultado, sendo competente o juizado do local onde ocorreu o resultado da infração.",
        "B": "Teoria da atividade, determinando-se a competência pelo lugar em que foi praticada a infração penal.",
        "C": "Teoria da ubiquidade, mantendo a regra do Código Penal.",
        "D": "Teoria do domicílio da vítima, para facilitar o acesso à justiça."
      },
      "resposta_correta": "B",
      "pagina_pdf": "27",
      "trecho_consulta": "Infrações penais de menor potencial ofensivo: o art. 63 da Lei 9.099/1995 adotou a teoria da atividade: 'A competência do Juizado será determinada pelo lugar em que foi praticada a infração penal'."
    },
    {
      "enunciado": "Um crime de genocídio é cometido no exterior por um agente estrangeiro, porém domiciliado no Brasil. Qual princípio de extraterritorialidade permite a aplicação da lei brasileira, e essa extraterritorialidade é condicionada ou incondicionada?",
      "alternativas": {
        "A": "Princípio da justiça universal; extraterritorialidade condicionada.",
        "B": "Princípio do domicílio (aplicado ao agente) e da defesa (pela natureza do crime); extraterritorialidade incondicionada, conforme Art. 7º, I, 'd', CP.",
        "C": "Princípio da personalidade ativa; extraterritorialidade condicionada à entrada do agente no Brasil.",
        "D": "Princípio da representação; extraterritorialidade incondicionada se houver tratado específico."
      },
      "resposta_correta": "B",
      "pagina_pdf": "24 (Princípio do Domicílio) e 28 (Art. 7º, I, d)",
      "trecho_consulta": "Princípio do domicílio: o autor do crime deve ser julgado em consonância com a lei do país em que for domiciliado... Previsto no art. 7.º, I, alínea 'd' ('domiciliado no Brasil'), do Código Penal, no tocante ao crime de genocídio... (E o Art. 7º, I elenca hipóteses de extraterritorialidade incondicionada)."
    },
    {
      "enunciado": "Se um brasileiro pratica um crime no exterior que também é punível lá, e posteriormente ingressa no Brasil, mas já foi absolvido no país estrangeiro por sentença transitada em julgado, a lei brasileira ainda poderá ser aplicada sob a hipótese de extraterritorialidade condicionada (Art. 7º, II, 'b' c/c §2º)?",
      "alternativas": {
        "A": "Sim, pois a absolvição no estrangeiro não impede novo julgamento no Brasil, pela soberania nacional.",
        "B": "Não, pois uma das condições para a extraterritorialidade condicionada é 'não ter sido o agente absolvido no estrangeiro' (Art. 7º, §2º, 'd').",
        "C": "Sim, mas apenas se o Ministério Público brasileiro discordar dos fundamentos da absolvição estrangeira.",
        "D": "Depende: se o crime for grave, como tráfico de drogas, a absolvição estrangeira pode ser desconsiderada."
      },
      "resposta_correta": "B",
      "pagina_pdf": "29",
      "trecho_consulta": "d) não ter sido o agente absolvido no estrangeiro ou não ter aí cumprido a pena;"
    },
    {
      "enunciado": "Qual o efeito de uma pena de multa cumprida integralmente no estrangeiro sobre uma pena de multa idêntica imposta no Brasil pelo mesmo crime, conforme o Art. 8º do CP?",
      "alternativas": {
        "A": "A pena de multa cumprida no estrangeiro atenua a multa brasileira.",
        "B": "A pena de multa cumprida no estrangeiro é nela computada, resultando na extinção da exigibilidade da multa brasileira.",
        "C": "A pena de multa cumprida no estrangeiro é irrelevante, devendo a multa brasileira ser paga integralmente.",
        "D": "A pena de multa cumprida no estrangeiro só é considerada se o valor for superior ao da multa brasileira."
      },
      "resposta_correta": "B",
      "pagina_pdf": "29",
      "trecho_consulta": "Conforme o Art. 8°, do Código Penal, a pena cumprida no estrangeiro ATENUA a pena imposta no Brasil pelo mesmo crime, quando DIVERSAS, ou nela é computada, quando idênticas."
    },
    {
      "enunciado": "A contagem de um prazo prescricional penal de 2 anos, iniciado em 10 de maio de 2023, se encerra em qual data, considerando a regra do Art. 10 do CP?",
      "alternativas": {
        "A": "10 de maio de 2025.",
        "B": "09 de maio de 2025.",
        "C": "11 de maio de 2025.",
        "D": "31 de dezembro de 2024."
      },
      "resposta_correta": "B",
      "pagina_pdf": "30",
      "trecho_consulta": "Para calcular na prova, diminui um dia. Ex.: se a pena é de um ano e se iniciou em 10/10, estará integralmente cumprida no dia 09/10 do ano subsequente."
    },
    {
      "enunciado": "A revogação expressa de uma lei penal ocorre quando:",
      "alternativas": {
        "A": "A nova lei é implicitamente incompatível com a lei anterior.",
        "B": "A nova lei regula inteiramente a matéria da lei anterior, tornando-a desnecessária.",
        "C": "A lei nova indica taxativamente quais dispositivos da lei anterior estão sendo revogados.",
        "D": "A lei anterior cai em desuso pela não aplicação reiterada pelos tribunais."
      },
      "resposta_correta": "C",
      "pagina_pdf": "8",
      "trecho_consulta": "Expressa: ocorre quando a lei indica quais dispositivos estão revogados."
    },
    {
      "enunciado": "Se uma lei posterior transforma um crime afiançável em inafiançável, essa alteração é considerada *lex gravior* ou *lex mitior*?",
      "alternativas": {
        "A": "*Lex mitior*, pois não altera a pena, apenas um aspecto processual.",
        "B": "*Lex gravior*, pois agrava a situação do réu ao dificultar sua liberdade provisória, e, portanto, não retroage.",
        "C": "Não se classifica nem como *lex gravior* nem *mitior*, pois trata de matéria puramente processual sem impacto na punição.",
        "D": "*Lex gravior*, mas retroage por se tratar de norma de natureza processual penal com aplicação imediata."
      },
      "resposta_correta": "B",
      "pagina_pdf": "11 (por inferência da amplitude de 'de qualquer modo favorecer' para lex mitior, o contrário seria 'de qualquer modo prejudicar' para lex gravior) e 12 (para lex gravior não retroagir)",
      "trecho_consulta": "A expressão 'de qualquer modo' deve ser interpretada de forma ampliativa (para lex mitior). (...) É a lei posterior que prejudica a situação do agente. Como a extra-atividade da lei penal só ocorre benefício do réu, a lex gravior não o prejudica. Não retroage."
    },
    {
      "enunciado": "A teoria da ponderação diferenciada, defendida por José Frederico Marques em relação à *lex tertia*, sustenta que:",
      "alternativas": {
        "A": "O juiz deve aplicar integralmente a lei mais benéfica, sem combinar dispositivos de leis diferentes.",
        "B": "O juiz pode combinar os aspectos mais favoráveis de leis sucessivas, pois não está criando uma nova lei, mas aplicando o direito dentro dos limites postos pelo legislador.",
        "C": "A combinação de leis é vedada por violar a separação de poderes, devendo-se escolher a lei globalmente mais vantajosa.",
        "D": "Apenas o legislador pode criar uma 'terceira lei' que combine aspectos de normas anteriores."
      },
      "resposta_correta": "B",
      "pagina_pdf": "13",
      "trecho_consulta": "2ª Posição (José Frederico Marques) é possível a combinação de leis penais. Não haverá violação ao princípio da separação dos poderes, uma vez que o juiz não está criando uma lei, mas transita dentro dos limites previamente estabelecidos pelo legislador."
    },
    {
      "enunciado": "Qual é a principal razão para a ultratividade das leis penais excepcionais, como aquelas editadas em tempos de calamidade pública?",
      "alternativas": {
        "A": "Garantir que sejam sempre mais benéficas ao réu, mesmo após cessada a excepcionalidade.",
        "B": "Evitar que, devido à sua curta duração, se tornem ineficazes na prevenção e punição de condutas praticadas durante o período de excepcionalidade.",
        "C": "Permitir que retroajam para punir fatos anteriores à sua vigência, dada a gravidade da situação.",
        "D": "Assegurar que sejam revogadas apenas por outra lei expressa, e não por cessarem as circunstâncias que as determinaram."
      },
      "resposta_correta": "B",
      "pagina_pdf": "16",
      "trecho_consulta": "Se assim não fossem, como essas leis são de curtissima duração, seria sancionada uma ineficácia preventiva, ou seja, essas leis não teriam aplicabilidade."
    },
    {
      "enunciado": "No conflito aparente de normas, se o crime de infanticídio (Art. 123 CP) é comparado ao homicídio (Art. 121 CP), qual princípio é aplicado para determinar a norma incidente, considerando as particularidades do infanticídio (estado puerperal, contra o próprio filho)?",
      "alternativas": {
        "A": "Subsidiariedade, pois o homicídio é subsidiário ao infanticídio.",
        "B": "Consunção, pois o infanticídio é uma forma de progressão do homicídio.",
        "C": "Especialidade, pois o infanticídio contém todos os elementos do homicídio e acrescenta elementos especializantes.",
        "D": "Alternatividade, pois a mãe poderia responder por um ou outro, dependendo da interpretação."
      },
      "resposta_correta": "C",
      "pagina_pdf": "18",
      "trecho_consulta": "Ex.: Homicídio e Infanticídio. (Contextualizado no Princípio da especialidade)."
    },
    {
      "enunciado": "O agente que viola o domicílio de alguém (Art. 150 CP) com o fim exclusivo de cometer um furto (Art. 155 CP) no seu interior, responde pelos dois crimes em concurso ou aplica-se algum princípio de solução de conflito aparente de normas?",
      "alternativas": {
        "A": "Responde por violação de domicílio e furto em concurso material, pois são bens jurídicos distintos.",
        "B": "Aplica-se o princípio da consunção (crime-meio), sendo a violação de domicílio (antefato impunível) absorvida pelo furto (crime-fim), respondendo apenas pelo furto.",
        "C": "Aplica-se o princípio da especialidade, pois o furto qualificado pela invasão seria especial.",
        "D": "Responde apenas pela violação de domicílio se o furto não se consumar."
      },
      "resposta_correta": "B",
      "pagina_pdf": "20 (contexto de atos anteriores impuníveis) e 19 (consunção)",
      "trecho_consulta": "Os anteriores são os que funcionam como meios de execução do tipo principal, ficando por estes absorvidos."
    },
    {
      "enunciado": "A alternatividade imprópria, mencionada no material como uma situação de falta de técnica legislativa, ocorreria quando:",
      "alternativas": {
        "A": "Um tipo penal possui vários verbos nucleares e a prática de mais de um contra o mesmo objeto configura crime único.",
        "B": "O legislador disciplina o mesmo fato criminoso mediante duas ou mais leis penais distintas e simultaneamente vigentes, gerando uma duplicidade desnecessária.",
        "C": "Duas leis tratam de fatos completamente diferentes, mas usam nomenclaturas semelhantes, causando confusão.",
        "D": "A lei permite ao juiz escolher alternativamente qual pena aplicar dentre um rol previsto no tipo."
      },
      "resposta_correta": "B",
      "pagina_pdf": "20",
      "trecho_consulta": "Alternatividade imprópria: a qual se verifica quando o legislador disciplina o mesmo fato mediante o emprego de duas ou mais leis penais, deve ser rechaçada de plano. É uma situação clara de falta de técnica legislativa."
    },
    {
      "enunciado": "Para fins de aplicação da Súmula 711 do STF em crime continuado, se uma série de furtos (crime continuado) se inicia sob a lei A (pena X) e, durante a continuidade, entra em vigor a lei B (pena Y, mais grave), e alguns furtos da série ainda ocorrem sob a lei B, qual lei rege toda a unidade delitiva?",
      "alternativas": {
        "A": "A lei A, por ser a lei do primeiro ato da continuidade e mais benéfica.",
        "B": "A lei B, pois sua vigência é anterior à cessação da continuidade, aplicando-se a toda a série de crimes.",
        "C": "A lei A para os crimes sob sua vigência e a lei B para os crimes sob a vigência desta, somando-se as frações de aumento.",
        "D": "A lei mais benéfica após análise global de ambas, aplicando-a integralmente."
      },
      "resposta_correta": "B",
      "pagina_pdf": "22",
      "trecho_consulta": "No crime continuado em que os fatos anteriores eram punidos por uma lei, operando-se o aumento da pena por lei nova, aplica-se esta última toda a unidade delitiva, desde que sob a sua vigência continue a ser praticada. (...) Súmula 711 do Supremo Tribunal Federal: 'A lei penal mais grave aplica-se ao crime continuado...'"
    },
    {
      "enunciado": "O 'território brasileiro por extensão' inclui embarcações e aeronaves brasileiras mercantes ou de propriedade privada. Qual a condição para que a lei brasileira se aplique a crimes cometidos a bordo desses veículos quando não estão em águas/espaço aéreo brasileiros?",
      "alternativas": {
        "A": "Devem estar em águas internacionais (alto-mar) ou no espaço aéreo correspondente; se em território estrangeiro, a lei brasileira não se aplica.",
        "B": "Devem estar, respectivamente, no espaço aéreo correspondente ao território estrangeiro ou em porto estrangeiro, e o crime deve ser contra brasileiro.",
        "C": "Devem achar-se, respectivamente, no espaço aéreo correspondente (a qualquer localidade, inclusive estrangeira, se não houver sobreposição de soberania) ou em alto-mar.",
        "D": "Devem estar a serviço de missão diplomática brasileira, mesmo sendo privadas."
      },
      "resposta_correta": "C",
      "pagina_pdf": "23 e 26",
      "trecho_consulta": "§ 1º Para os efeitos penais, consideram-se como extensão do território nacional (...) bem como as aeronaves e as embarcações brasileiras, mercantes ou de propriedade privada, que se achem, respectivamente, no espaço aéreo correspondente ou em alto-mar."
    },
    {
      "enunciado": "No caso de crimes conexos praticados em parte no Brasil e em parte no estrangeiro, a teoria da ubiquidade (Art. 6º CP) é suficiente para determinar o julgamento de todos os fatos pela justiça brasileira?",
      "alternativas": {
        "A": "Sim, a teoria da ubiquidade atrai a competência para todos os crimes conexos para o Brasil.",
        "B": "Não, pois em crimes conexos, cada delito deve ser processado e julgado no país onde foi cometido, não se aplicando a ubiquidade para unificar a jurisdição sobre todos eles.",
        "C": "Sim, desde que o crime principal tenha ocorrido no Brasil.",
        "D": "Não, a menos que todas as vítimas sejam brasileiras."
      },
      "resposta_correta": "B",
      "pagina_pdf": "26",
      "trecho_consulta": "1. Crimes conexos: são aqueles que de algum modo estão relacionados entre si. Não se aplica a teoria da ubiquidade, eis que os diversos crimes não constituem unidade jurídica. Deve cada um deles, portanto, ser processado e julgado no país em que foi cometido."
    },
    {
      "enunciado": "Qual a regra para a aplicação da lei penal brasileira a crimes falimentares quanto ao lugar do crime, conforme a Lei 11.101/2005?",
      "alternativas": {
        "A": "Aplica-se a teoria da ubiquidade, sendo competente tanto o foro da sede da empresa quanto o local da prática dos atos fraudulentos.",
        "B": "Será competente o foro do local em que foi decretada a falência, concedida a recuperação judicial ou homologado o plano de recuperação extrajudicial.",
        "C": "Aplica-se a teoria da atividade, sendo competente o local do primeiro ato de gestão fraudulenta.",
        "D": "A competência é da Justiça Federal, independentemente do local."
      },
      "resposta_correta": "B",
      "pagina_pdf": "27",
      "trecho_consulta": "Crimes falimentares: será competente o foro do local em que foi decretada a falência, concedida a recuperação judicial ou homologado o plano de recuperação extrajudicial (art. 183 da Lei 11.101/2005)."
    },
    {
      "enunciado": "Na hipótese de extraterritorialidade incondicionada de crime contra o patrimônio de uma empresa pública federal, cometido no exterior (Art. 7º, I, 'b', CP), a aplicação da pena cumprida no estrangeiro pelo mesmo fato (Art. 8º CP) representa uma exceção ao 'ne bis in idem' ou uma forma de observá-lo?",
      "alternativas": {
        "A": "É uma exceção total ao 'ne bis in idem', pois o agente é punido duas vezes integralmente.",
        "B": "É uma forma de observância mitigada do 'ne bis in idem', pois embora o agente possa ser processado e condenado no Brasil (Art. 7º, §1º), a pena cumprida no exterior será atenuada ou computada, evitando uma dupla punição efetiva integral.",
        "C": "Ignora completamente o 'ne bis in idem', pois a soberania brasileira se sobrepõe a qualquer julgamento estrangeiro.",
        "D": "Só se observa o 'ne bis in idem' se a condenação no estrangeiro for por crime idêntico e com pena maior que a brasileira."
      },
      "resposta_correta": "B",
      "pagina_pdf": "28 (referência ao Art. 8º no contexto da extraterritorialidade incondicionada) e 29 (Art. 8º)",
      "trecho_consulta": "Por fim, é importante saber que há proibição do bis in idem, em relação a previsão do Art. 8.º do CP. Desse modo, em face da detração penal determinada pelo art. 8.º do Código Penal, no caso de extraterritorialidade incondicionada, a pena cumprida no estrangeiro atenua a pena imposta no Brasil pelo mesmo crime, quando diversas, ou nela é computada, quando idênticas."
    },
    {
      "enunciado": "Uma das condições para a aplicação da lei brasileira nos casos de extraterritorialidade condicionada (Art. 7º, §2º, CP) é 'ser o fato punível também no país em que foi praticado'. Como se denomina essa exigência?",
      "alternativas": {
        "A": "Condição de procedibilidade.",
        "B": "Princípio da dupla incriminação ou da identidade de normas.",
        "C": "Requisito da nacionalidade do agente.",
        "D": "Cláusula de reciprocidade."
      },
      "resposta_correta": "B",
      "pagina_pdf": "29",
      "trecho_consulta": "b) ser o fato punível também no país em que foi praticado;"
    },
    {
      "enunciado": "Se a pena de um crime é fixada em 5 anos e 10 dias de reclusão, como o Art. 11 do CP impacta essa fração de '10 dias'?",
      "alternativas": {
        "A": "Os 10 dias são arredondados para 1 mês.",
        "B": "Os 10 dias são integralmente cumpridos.",
        "C": "Os 10 dias são desprezados, fixando-se a pena em 5 anos.",
        "D": "Os 10 dias são convertidos em medida restritiva de direitos."
      },
      "resposta_correta": "C",
      "pagina_pdf": "30",
      "trecho_consulta": "Preceitua o art. 11 do Código Penal: 'Desprezam-se, nas penas privativas de liberdade e nas restritivas de direitos, as frações de dia...'"
    },
    {
      "enunciado": "O Art. 12 do CP, que trata da aplicação subsidiária das regras gerais do Código Penal à legislação especial, consagra qual princípio?",
      "alternativas": {
        "A": "Princípio da especialidade da lei penal especial.",
        "B": "Princípio da hierarquia das normas penais.",
        "C": "Princípio da convivência das esferas autônomas (ou da subsidiariedade do Código Penal geral).",
        "D": "Princípio da irretroatividade da lei penal geral sobre a especial."
      },
      "resposta_correta": "C",
      "pagina_pdf": "30",
      "trecho_consulta": "Consagra o princípio da convivência das esferas autônomas, ou seja, o Código Penal será aplicado para toda legislação penal especial, é a regra geral. Havendo previsão específica, será aplicada a lei especial."
    },
    {
      "enunciado": "A derrogação de uma lei penal ocorre quando:",
      "alternativas": {
        "A": "A lei é integralmente revogada por uma nova lei.",
        "B": "A lei é parcialmente revogada, com alguns de seus dispositivos sendo retirados do ordenamento por uma nova lei.",
        "C": "A lei deixa de ser aplicada pelos tribunais por longo período.",
        "D": "A lei tem sua constitucionalidade questionada perante o STF."
      },
      "resposta_correta": "B",
      "pagina_pdf": "8",
      "trecho_consulta": "A revogação pode ser: absoluta ou total, conhecida como ab-rogação (ab-rogação absoluta), ou parcial, denominada derrogação."
    },
    {
      "enunciado": "Se uma lei nova, além de reduzir a pena de um delito, também cria uma nova modalidade de flagrante para esse mesmo delito, como essa alteração processual é tratada em relação ao tempo?",
      "alternativas": {
        "A": "Retroage integralmente, pois a lei é predominantemente mais benéfica.",
        "B": "A parte penal (redução da pena) retroage; a parte processual (nova modalidade de flagrante) tem aplicação imediata (*tempus regit actum* processual), respeitados os atos já praticados.",
        "C": "Não retroage em nenhuma hipótese, pois a alteração processual impede a retroatividade da parte penal.",
        "D": "Retroage apenas a parte processual, por ser mais favorável à eficiência da persecução penal."
      },
      "resposta_correta": "B",
      "pagina_pdf": "11 (para a retroatividade da parte penal) e conhecimento geral sobre aplicação da lei processual penal no tempo (não explicitamente detalhado nesta seção do PDF, mas inferível pelo tratamento separado)",
      "trecho_consulta": "A lei posterior, que de qualquer modo favorecer o agente, aplica-se aos fatos anteriores... (para a parte penal). (A parte processual, por regra geral, tem aplicação imediata - *tempus regit actum*)."
    },
    {
      "enunciado": "Se o complemento de uma lei penal em branco é considerado editado em 'contexto de anormalidade' e sua alteração posterior beneficia o réu, por que, segundo a doutrina de Masson citada, essa alteração não retroage?",
      "alternativas": {
        "A": "Porque o complemento em si não é lei penal, não se sujeitando à retroatividade.",
        "B": "Em razão da ultratividade das leis penais excepcionais (Art. 3º CP), que se estende a esses complementos, visando preservar a eficácia da norma durante a situação de anormalidade.",
        "C": "Porque a retroatividade só é admitida para leis penais em branco homogêneas (complemento da mesma fonte legislativa).",
        "D": "Apenas se a alteração do complemento ocorrer após o trânsito em julgado da condenação."
      },
      "resposta_correta": "B",
      "pagina_pdf": "15",
      "trecho_consulta": "Por outro lado, quando o complemento se inserir em um contexto de anormalidade, de excepcionalidade, a sua modificação, ainda que benéfica ao réu, não pode retroagir. Fundamenta-se essa posição na ultratividade das leis penais excepcionais, alicerçada no art. 3.° do Código Penal."
    },
    {
      "enunciado": "No crime de estelionato (Art. 171 CP), se o agente utiliza um documento falso (crime do Art. 304 c/c Art. 297/298 CP) como meio exclusivo para induzir a vítima a erro e obter a vantagem ilícita, qual a solução comum para o conflito aparente entre o uso de documento falso e o estelionato?",
      "alternativas": {
        "A": "Concurso material entre uso de documento falso e estelionato, pois são crimes distintos.",
        "B": "Consunção, sendo o uso de documento falso (crime-meio) absorvido pelo estelionato (crime-fim), desde que a potencialidade lesiva do falso se esgote no estelionato (Súmula 17 STJ).",
        "C": "Aplica-se apenas o uso de documento falso, por ter pena mais grave em algumas modalidades.",
        "D": "Concurso formal, pois com uma só conduta (uso do falso) o agente pratica dois crimes."
      },
      "resposta_correta": "B",
      "pagina_pdf": "19 (princípio da consunção) - A Súmula 17 do STJ é conhecimento correlato fundamental para essa questão.",
      "trecho_consulta": "Princípio da consunção: o fato mais amplo e grave absorve os demais fatos menos amplos e graves."
    },
    {
      "enunciado": "Um navio de guerra brasileiro está ancorado em um porto estrangeiro. Um crime é cometido a bordo por um tripulante brasileiro contra outro tripulante brasileiro. Qual lei se aplica?",
      "alternativas": {
        "A": "A lei do país estrangeiro onde o navio está ancorado, por cortesia internacional.",
        "B": "A lei brasileira, pois navios públicos são considerados extensão do território nacional onde quer que se encontrem (Art. 5º, §1º CP).",
        "C": "Aplica-se a lei mais favorável ao réu entre a brasileira e a estrangeira.",
        "D": "A lei do país estrangeiro, a menos que o Brasil solicite a extradição do agente."
      },
      "resposta_correta": "B",
      "pagina_pdf": "23",
      "trecho_consulta": "§ 1º Para os efeitos penais, consideram-se como extensão do território nacional as embarcações e aeronaves brasileiras, de natureza pública ou a serviço do governo brasileiro onde quer que se encontrem..."
    },
    {
      "enunciado": "Um cidadão suíço, em viagem pela França, comete um crime contra o patrimônio da União (Brasil). Posteriormente, ele é detido na Alemanha. A lei penal brasileira pode ser aplicada? Se sim, sob qual hipótese de extraterritorialidade?",
      "alternativas": {
        "A": "Não, pois o agente é estrangeiro e o crime ocorreu no exterior.",
        "B": "Sim, pela extraterritorialidade incondicionada (Art. 7º, I, 'b', CP - princípio real ou de defesa), sendo irrelevante sua nacionalidade ou local de detenção para a aplicabilidade da lei brasileira, embora sua punição dependa de outros fatores (ex: presença no Brasil).",
        "C": "Sim, pela extraterritorialidade condicionada, desde que a Suíça ou a França solicitem.",
        "D": "Não, a menos que ele seja encontrado no Brasil."
      },
      "resposta_correta": "B",
      "pagina_pdf": "28",
      "trecho_consulta": "Art. 7º Ficam sujeitos à lei brasileira, embora cometidos no estrangeiro: I - os crimes: (...) b) contra o patrimônio ou a fé pública da União..."
    },
    {
      "enunciado": "Considerando a revogação de uma lei penal, se uma nova lei trata da mesma matéria de forma exaustiva, mas é omissa quanto à revogação da lei anterior, e alguns dispositivos da lei antiga não são explicitamente incompatíveis com a nova, mas se tornam redundantes ou desnecessários, qual modalidade de revogação ocorre preponderantemente em relação a esses dispositivos?",
      "alternativas": {
        "A": "Revogação expressa parcial, pois a nova lei implicitamente aponta os dispositivos substituídos.",
        "B": "Derrogação tácita, apenas para os dispositivos que apresentem conflito direto e insanável com a nova lei.",
        "C": "Revogação global, pois a nova lei, ao regular inteiramente a matéria, torna a lei anterior como um todo ultrapassada, mesmo que alguns de seus dispositivos pudessem, isoladamente, coexistir.",
        "D": "Não há revogação desses dispositivos, que permanecem válidos como direito consuetudinário."
      },
      "resposta_correta": "C",
      "pagina_pdf": "9",
      "trecho_consulta": "Global: ocorre quando a nova lei regula inteiramente a matéria disciplinada pela lei anterior, que passa a ser ultrapassada e desnecessária."
    },
    {
      "enunciado": "No caso de *abolitio criminis* (Art. 2º, caput, CP), qual o impacto sobre os registros criminais e antecedentes do indivíduo que havia sido condenado pelo fato agora descriminalizado?",
      "alternativas": {
        "A": "Os registros criminais são mantidos para fins de reincidência em outros crimes, mas a pena é extinta.",
        "B": "Cessam os efeitos penais da condenação, o que inclui a consideração do fato como antecedente criminal ou para fins de reincidência, devendo os registros serem baixados nesse aspecto.",
        "C": "Os registros são mantidos, mas com uma anotação de que o crime foi abolido, servindo apenas para fins civis.",
        "D": "A *abolitio criminis* não afeta os registros criminais, apenas a execução da pena."
      },
      "resposta_correta": "B",
      "pagina_pdf": "10",
      "trecho_consulta": "Art. 2º, CP Ninguém pode ser punido por fato que lei posterior deixa de considerar crime, cessando em virtude dela a execução e os efeitos penais da sentença condenatória."
    },
    {
      "enunciado": "Se uma nova lei penal (lex mitior) reduz a pena de um crime e também altera o prazo prescricional da pretensão punitiva para este crime, tornando-o menor, como essa alteração no prazo prescricional deve ser tratada em relação a fatos anteriores ainda não prescritos pela lei antiga?",
      "alternativas": {
        "A": "O novo prazo prescricional, por ser mais benéfico, retroage para alcançar os fatos anteriores, podendo extinguir a punibilidade.",
        "B": "O novo prazo prescricional não retroage, pois as regras de prescrição são de natureza processual e têm aplicação imediata apenas para o futuro.",
        "C": "A retroatividade do novo prazo prescricional só ocorre se houver expressa previsão na lei nova.",
        "D": "O prazo prescricional da lei antiga continua a correr, e o da lei nova só se aplica aos fatos ocorridos após sua vigência."
      },
      "resposta_correta": "A",
      "pagina_pdf": "11",
      "trecho_consulta": "A expressão 'de qualquer modo' deve ser interpretada de forma ampliativa, ou seja, excluísse uma qualificadora, cria-se uma causa de diminuição etc. Nos termos do art. 5.°, XL, da Constituição Federal, a abolitio criminis e a novatio legis in mellius devem retroagir, por configurar nítido benefício ao réu. (A redução do prazo prescricional é um benefício)."
    },
    {
      "enunciado": "A Súmula 611 do STF estabelece a competência do juízo da execução para aplicar lei mais benéfica após o trânsito em julgado. Se a lei nova mais benéfica surge durante o prazo para interposição de um recurso extraordinário já admitido, mas ainda não julgado, a quem compete, prioritariamente, analisar sua aplicação?",
      "alternativas": {
        "A": "Ao juízo da execução, pois a sentença de primeiro e segundo grau já transitaram em julgado formalmente.",
        "B": "Ao tribunal superior que julgará o recurso (STF/STJ), pois a relação processual ainda não se encerrou em definitivo.",
        "C": "Ao juiz de primeiro grau, que deve ser provocado para readequar a pena antes da subida do recurso.",
        "D": "Apenas ao juízo da execução, após o esgotamento de todos os recursos possíveis."
      },
      "resposta_correta": "B",
      "pagina_pdf": "12",
      "trecho_consulta": "Tribunal – será aplicado pelo tribunal respectivo. No caso de ação penal em grau de recurso, ou ainda na hipótese de crime de competência originária dos Tribunais, tal mister será tarefa do Tribunal respectivo."
    },
    {
      "enunciado": "Considerando a oscilação histórica do STF sobre a *lex tertia*, mas sua posição atual (e a Súmula 501 do STJ), se um réu foi condenado pela Lei A e surge a Lei B, com alguns aspectos mais brandos e outros mais severos, o que o juiz deve fazer?",
      "alternativas": {
        "A": "Criar uma terceira norma combinando os aspectos favoráveis da Lei A e da Lei B.",
        "B": "Analisar qual das duas leis, aplicada em sua integralidade, é mais benéfica ao réu e aplicá-la por completo, vedando a combinação.",
        "C": "Sempre aplicar a Lei B, por ser posterior, independentemente de ser mais gravosa em alguns pontos.",
        "D": "Aplicar a Lei A, pois a Lei B, sendo parcialmente mais gravosa, não pode retroagir em nenhum aspecto."
      },
      "resposta_correta": "B",
      "pagina_pdf": "14",
      "trecho_consulta": "Este é o entendimento atualmente adotado pela Corte Suprema, contrário à combinação de leis penais: (...) Súmula n.º 501, STJ: É cabível a aplicação retroativa da Lei n. 11.343/2006, desde que o resultado da incidência das suas disposições, na integra, seja mais favorável ao réu..."
    },
    {
      "enunciado": "Em um caso de lei penal em branco cujo complemento é uma portaria administrativa que define substâncias entorpecentes. Se uma nova portaria retira uma substância da lista, em um contexto de política criminal ordinária (normalidade), qual o efeito sobre quem respondia por tráfico daquela substância específica?",
      "alternativas": {
        "A": "Nenhum efeito, pois a lei penal em branco não foi alterada, apenas seu complemento.",
        "B": "A conduta se torna atípica retroativamente, pois a alteração do complemento em normalidade, se benéfica, retroage para favorecer o réu.",
        "C": "A retroatividade só ocorre se a lei penal em branco (tipo penal) também for expressamente modificada.",
        "D": "Aplica-se a ultratividade da portaria antiga, mais gravosa, por se tratar de crime de perigo abstrato."
      },
      "resposta_correta": "B",
      "pagina_pdf": "15",
      "trecho_consulta": "No que tange a normalidade, uma situação que se buscava incriminar passa a ser irrelevante. Nesse caso, a retroatividade é obrigatória."
    },
    {
      "enunciado": "O crime de homicídio qualificado por motivo fútil (Art. 121, §2º, II, CP) e o crime de homicídio simples (Art. 121, caput, CP) apresentam um conflito aparente de normas. Qual princípio o soluciona e por quê?",
      "alternativas": {
        "A": "Subsidiariedade, pois o homicídio simples é um 'soldado de reserva' para o qualificado.",
        "B": "Especialidade, pois o homicídio qualificado contém todos os elementos do simples e acrescenta a circunstância especializante do 'motivo fútil'.",
        "C": "Consunção, pois o motivo fútil absorve a conduta de matar.",
        "D": "Alternatividade, pois o promotor pode escolher qual tipo imputar."
      },
      "resposta_correta": "B",
      "pagina_pdf": "18",
      "trecho_consulta": "Princípio da especialidade: Norma especial afasta a aplicação da norma geral (Lex specialis derrogat generali.). (...) A lei específica deve abrigar todos os elementos da genérica, apresentando ainda outras particulares características que podem ser denominadas elementos especializantes..."
    },
    {
      "enunciado": "No contexto da consunção, a 'progressão criminosa' se diferencia do 'crime progressivo' fundamentalmente pela:",
      "alternativas": {
        "A": "Inexistência de dolo inicial para o resultado mais grave na progressão criminosa, havendo uma alteração do desígnio no curso da ação.",
        "B": "Maior gravidade do resultado na progressão criminosa em comparação com o crime progressivo.",
        "C": "Necessidade de representação da vítima na progressão criminosa, o que não ocorre no crime progressivo.",
        "D": "Aplicação exclusiva da progressão criminosa a crimes patrimoniais, enquanto o crime progressivo se aplica a crimes contra a pessoa."
      },
      "resposta_correta": "A",
      "pagina_pdf": "20",
      "trecho_consulta": "Crime progressivo: quando o agente, almejando desde o início alcançar o resultado mais grave... Progressão criminosa: quando o agente pretende inicialmente produzir um resultado e, depois de alcança-lo, opta por prosseguir na prática ilícita e reinicia outra conduta, produzindo um evento mais grave. Pluralidade de designios, havendo alteração em seu dolo."
    },
    {
      "enunciado": "A Súmula 711 do STF, ao tratar da aplicação da lei penal mais grave ao crime continuado ou permanente, pressupõe que a vigência da lei mais gravosa seja anterior à cessação da continuidade ou permanência. Se uma lei intermediária mais branda vigorou durante parte da continuidade delitiva, mas foi revogada antes da cessação por outra ainda mais grave que a inicial, qual lei deve ser aplicada?",
      "alternativas": {
        "A": "A lei inicial, por ser a vigente no começo da atividade criminosa.",
        "B": "A lei intermediária mais branda, por ter sido a mais favorável em algum momento, aplicando-se o princípio da retroatividade e ultratividade da lei mais benigna.",
        "C": "A última lei (a mais grave de todas), pois a continuidade delitiva cessou sob sua vigência.",
        "D": "Faz-se uma combinação das três leis, aplicando-se os dispositivos mais favoráveis de cada uma."
      },
      "resposta_correta": "B",
      "pagina_pdf": "14 (Lei Penal Intermediária) e 22 (Súmula 711) - A questão combina os institutos. A lei intermediária mais benéfica deve ser aplicada, mesmo que a Súmula 711 trate da lei mais grave. A Súmula não impede a aplicação de lei intermediária mais benéfica, mas sim disciplina a aplicação da mais grave quando esta é a que vige na cessação. Se houve uma intermediária mais favorável, esta prevalece sobre a lei do início e sobre a lei do fim, se esta for mais grave que a intermediária.",
      "trecho_consulta": "A lei intermediária (ou intermédia) é aquela que deverá ser aplicada porque benéfica ao réu, muito embora não fosse a lei vigente ao tempo do fato, tampouco seja a lei vigente no momento do julgamento. (...) Nada impede a aplicação da lei 'B', desde que se trate, entre todas, da mais favorável ao agente."
    },
    {
      "enunciado": "O conceito de território brasileiro abrange rios e lagos internacionais. Se um rio serve de fronteira entre o Brasil e outro país (rio simultâneo ou fronteiriço), como se define a parte pertencente ao Brasil para fins de aplicação da lei penal?",
      "alternativas": {
        "A": "Todo o rio é considerado território brasileiro se a margem brasileira for mais extensa.",
        "B": "Aplica-se a lei do país que primeiro reivindicou soberania sobre o rio.",
        "C": "A delimitação da parte pertencente ao Brasil é fixada por tratados ou convenções internacionais entre os Estados interessados.",
        "D": "Aplica-se a lei brasileira até a metade do rio, por presunção."
      },
      "resposta_correta": "C",
      "pagina_pdf": "25",
      "trecho_consulta": "Caso sejam simultâneos ou fronteiriços, isto é, separarem os territórios de dois ou mais países, a delimitação da parte pertencente ao Brasil é fixada por tratados ou convenções internacionais entre os Estados interessados."
    },
    {
      "enunciado": "Um crime é praticado a bordo de uma aeronave brasileira a serviço do governo brasileiro, enquanto sobrevoava território argentino. Qual princípio e regra de aplicação da lei penal brasileira incide?",
      "alternativas": {
        "A": "Territorialidade por extensão (Art. 5º, §1º CP), aplicando-se a lei brasileira, pois a aeronave é considerada território nacional onde quer que se encontre.",
        "B": "Extraterritorialidade condicionada pelo princípio da representação, dependendo de não julgamento na Argentina.",
        "C": "Extraterritorialidade incondicionada pelo princípio da defesa, se o crime afetar a função governamental.",
        "D": "Lei argentina, por estar sobrevoando seu território, salvo se o crime for contra brasileiro."
      },
      "resposta_correta": "A",
      "pagina_pdf": "26",
      "trecho_consulta": "Conforme o art. 5.º, § 1.º, do CP, consideram-se como extensão do território nacional as embarcações e aeronaves brasileiras, de natureza pública ou a serviço do governo brasileiro onde quer que se encontrem..."
    },
    {
      "enunciado": "No caso de um crime à distância, onde a conduta (ex: disparo de arma de fogo) ocorre no país A e o resultado (morte) no país B (Brasil), e o agente é encontrado no país C, qual teoria sobre o lugar do crime o Art. 6º do CP consagra para definir a aplicabilidade da lei penal brasileira?",
      "alternativas": {
        "A": "Teoria da atividade, aplicando-se a lei brasileira apenas se o agente estivesse no Brasil ao agir.",
        "B": "Teoria do resultado, aplicando-se a lei brasileira porque o resultado ocorreu no Brasil.",
        "C": "Teoria da ubiquidade, considerando-se o crime praticado tanto no local da ação (país A) quanto onde se produziu o resultado (país B - Brasil), tornando a lei brasileira aplicável.",
        "D": "Teoria da intencionalidade, aplicando-se a lei do país que o agente pretendia lesar."
      },
      "resposta_correta": "C",
      "pagina_pdf": "26",
      "trecho_consulta": "Art. 6º. Considera-se praticado o crime no lugar em que ocorreu a ação ou omissão, no todo ou em parte, bem como onde se produziu ou deveria produzir-se o resultado."
    },
    {
      "enunciado": "Um agente comete no estrangeiro um crime que, por tratado internacional, o Brasil se obrigou a reprimir (Art. 7º, II, 'a', CP). Para que a lei brasileira seja aplicada, essa hipótese de extraterritorialidade é incondicionada ou condicionada? E qual uma das condições, se houver?",
      "alternativas": {
        "A": "Incondicionada, bastando a existência do tratado.",
        "B": "Condicionada, exigindo-se, entre outras, que o agente entre no território nacional.",
        "C": "Incondicionada, desde que a vítima seja brasileira.",
        "D": "Condicionada, dependendo exclusivamente da requisição do Ministro da Justiça."
      },
      "resposta_correta": "B",
      "pagina_pdf": "28",
      "trecho_consulta": "II – os crimes: a) que, por tratado ou convenção, o Brasil se obrigou a reprimir; (...) A aplicação da lei penal brasileira aos crimes cometidos no exterior se sujeita às condições cumulativas descritas pelo art. 7.°, § 2.º (...) Entrar o agente no território nacional;"
    },
    {
      "enunciado": "Se um brasileiro comete um crime comum (ex: lesão corporal grave) na Argentina e retorna ao Brasil, para que a lei brasileira seja aplicada (Art. 7º, II, 'b', CP), qual das seguintes NÃO é uma condição exigida pelo §2º do Art. 7º?",
      "alternativas": {
        "A": "Ser o fato punível também na Argentina.",
        "B": "O crime estar incluído entre aqueles pelos quais a lei brasileira autoriza a extradição.",
        "C": "Haver requisição do Ministro da Justiça ou representação da vítima.",
        "D": "Não ter sido o agente absolvido na Argentina ou não ter lá cumprido a pena."
      },
      "resposta_correta": "C",
      "pagina_pdf": "28-29",
      "trecho_consulta": "A aplicação da lei penal brasileira aos crimes cometidos no exterior se sujeita às condições cumulativas descritas pelo art. 7.°, § 2.º, alíneas 'a', 'b', 'c', 'd' e 'e'... (A requisição do Ministro da Justiça é para o §3º, ou seja, estrangeiro contra brasileiro no exterior)."
    },
    {
      "enunciado": "A aplicação da lei brasileira a crimes praticados em aeronaves ou embarcações brasileiras, mercantes ou de propriedade privada, quando em território estrangeiro e aí não sejam julgados (Art. 7º, II, 'c', CP), configura qual princípio de extraterritorialidade e qual sua natureza (condicionada/incondicionada)?",
      "alternativas": {
        "A": "Princípio da defesa; incondicionada.",
        "B": "Princípio da representação (ou do pavilhão); condicionada.",
        "C": "Princípio da justiça universal; incondicionada.",
        "D": "Princípio da personalidade ativa; condicionada."
      },
      "resposta_correta": "B",
      "pagina_pdf": "24 (princípio da representação) e 28 (localização no Art. 7º, II, c, que é condicionada)",
      "trecho_consulta": "Princípio da representação: (...) deve ser aplicada a lei penal brasileira aos crimes cometidos em aeronaves ou embarcações brasileiras, mercantes ou de propriedade privada, quando estiverem em território estrangeiro e aí não sejam julgados. É adotado pelo art. 7.º, II, 'c', do Código Penal."
    },
    {
      "enunciado": "A Lei das Contravenções Penais (Decreto-Lei 3.688/1941) veda a aplicação da lei brasileira a contravenções praticadas no estrangeiro. Essa vedação é absoluta ou admite exceções por tratados internacionais?",
      "alternativas": {
        "A": "Admite exceções, se houver tratado específico de repressão à contravenção.",
        "B": "É absoluta, não havendo extraterritorialidade para contravenções penais brasileiras.",
        "C": "Admite exceção se a contravenção for praticada por brasileiro contra patrimônio público.",
        "D": "É relativa, podendo o juiz aplicar a lei brasileira se considerar a contravenção grave."
      },
      "resposta_correta": "B",
      "pagina_pdf": "27",
      "trecho_consulta": "Não se admite a aplicação da lei penal brasileira às contravenções penais praticadas no estrangeiro, de acordo com a regra estabelecida pelo art. 2.º do Decreto-lei 3.688/1941 Lei das Contravenções Penais."
    },
    {
      "enunciado": "Conforme o Art. 8º do CP, se um agente cumpre pena no exterior por um crime e, posteriormente, é julgado no Brasil pelo mesmo fato, e as penas são de naturezas diversas (ex: prisão no exterior e restritiva de direitos no Brasil), como a pena estrangeira impacta a brasileira?",
      "alternativas": {
        "A": "A pena estrangeira é desconsiderada, pois são de naturezas diferentes.",
        "B": "A pena estrangeira atenua a pena brasileira, devendo o juiz considerar o tempo de prisão ao fixar a duração da restritiva de direitos ou até mesmo substituí-la.",
        "C": "A pena brasileira é extinta automaticamente.",
        "D": "A pena estrangeira só é computada se for idêntica (prisão com prisão)."
      },
      "resposta_correta": "B",
      "pagina_pdf": "29",
      "trecho_consulta": "Conforme o Art. 8°, do Código Penal, a pena cumprida no estrangeiro ATENUA a pena imposta no Brasil pelo mesmo crime, quando DIVERSAS, ou nela é computada, quando idênticas."
    },
    {
      "enunciado": "Além da reparação do dano e da sujeição à medida de segurança, a homologação de sentença penal estrangeira pelo STJ (Art. 9º CP) pode ser necessária para outros efeitos. Qual alternativa apresenta outro efeito que dependeria dessa homologação?",
      "alternativas": {
        "A": "Para caracterizar a reincidência no Brasil.",
        "B": "Para gerar 'outros efeitos civis' além da reparação do dano, como a perda de um bem em favor da União, se previsto na sentença estrangeira e compatível com a lei brasileira.",
        "C": "Para permitir a transferência do preso para cumprir pena no Brasil.",
        "D": "Para instruir um processo de extradição contra o condenado."
      },
      "resposta_correta": "B",
      "pagina_pdf": "29",
      "trecho_consulta": "O art. 9º traz duas exceções, ou seja, duas situações em que a sentença penal estrangeira precisa ser homologada no Brasil para gerar: Gerar EFEITOS CIVIS (...) Sujeitar o condenado a MEDIDA DE SEGURANÇA. (A tabela indica 'Gerar EFEITOS CIVIS', que é mais amplo que apenas 'reparação de danos')."
    },
    {
      "enunciado": "A regra de contagem de prazo penal do Art. 10 do CP, que inclui o dia do começo e considera o calendário comum, aplica-se a que tipo de prazos no âmbito criminal?",
      "alternativas": {
        "A": "Apenas a prazos prescricionais, não se aplicando a prazos de cumprimento de pena.",
        "B": "A todos os prazos de natureza penal (material), como os prescricionais, decadenciais e de cumprimento de pena, mas não aos prazos processuais puros.",
        "C": "Apenas a prazos recursais no processo penal.",
        "D": "Exclusivamente a prazos para pagamento de fiança ou multa."
      },
      "resposta_correta": "B",
      "pagina_pdf": "30",
      "trecho_consulta": "O prazo sempre terá natureza penal quando guardar pertinência com o jus puniendi."
    },
    {
      "enunciado": "O Art. 11 do CP determina que se desprezem as frações de cruzeiro na pena de multa. Considerando a obsolescência do 'cruzeiro', qual a interpretação atual e lógica dessa disposição para a moeda vigente (Real)?",
      "alternativas": {
        "A": "A disposição perdeu totalmente a eficácia, devendo as frações de Real serem integralmente cobradas.",
        "B": "Desprezam-se as frações de Real (centavos) na pena de multa, por analogia à intenção do legislador de evitar cobranças de valores irrisórios ou complexos.",
        "C": "As frações de Real são sempre arredondadas para a unidade inteira superior.",
        "D": "Aplica-se apenas se a multa for fixada em dias-multa, não em valor monetário direto."
      },
      "resposta_correta": "B",
      "pagina_pdf": "30",
      "trecho_consulta": "...e, na pena de multa, as frações de cruzeiro. (A lógica é o desprezo de frações da unidade monetária)."
    },
    {
      "enunciado": "Uma lei especial de crimes ambientais estabelece um rito processual próprio e prazos prescricionais específicos, divergentes do Código Penal. Conforme o Art. 12 do CP, como se resolve essa situação?",
      "alternativas": {
        "A": "As regras do Código Penal sempre prevalecem sobre a lei especial, por ser a norma geral.",
        "B": "Aplicam-se as disposições da lei especial, pois esta dispôs de modo diverso do Código Penal sobre a matéria.",
        "C": "O juiz deve combinar as regras do Código Penal e da lei especial, aplicando as mais favoráveis ao réu.",
        "D": "A lei especial só se aplica se for posterior ao Código Penal; caso contrário, prevalece o CP."
      },
      "resposta_correta": "B",
      "pagina_pdf": "30",
      "trecho_consulta": "As regras gerais deste Código aplicam-se aos fatos incriminados por lei especial, se esta não dispuser de modo diverso. (...) Havendo previsão específica, será aplicada a lei especial."
    },
    {
      "enunciado": "A irretroatividade da *lex gravior* é um princípio fundamental. Se uma nova lei aumenta a pena para um crime, mas também introduz uma nova causa de diminuição de pena não existente antes, essa lei pode ser considerada integralmente gravosa e, portanto, totalmente irretroativa?",
      "alternativas": {
        "A": "Sim, o aumento da pena máxima sempre a torna integralmente gravosa, impedindo qualquer retroatividade.",
        "B": "Não necessariamente. A lei seria uma *lex tertia* (híbrida). Conforme a posição majoritária (vedação à combinação), o juiz teria que analisar se a lei, em sua totalidade (com o aumento de pena e a nova causa de diminuição), é mais benéfica ou mais gravosa que a anterior para decidir sobre sua aplicação integral.",
        "C": "A parte que aumenta a pena não retroage, mas a parte que introduz a causa de diminuição retroage por ser benéfica, permitindo-se a cisão da lei.",
        "D": "A lei só retroagirá se a causa de diminuição compensar totalmente o aumento da pena."
      },
      "resposta_correta": "B",
      "pagina_pdf": "13 (Lex Tertia) e 14 (Súmula 501 STJ)",
      "trecho_consulta": "Ocorre quando, por exemplo, partes da lei antiga são benéficas ao réu e partes da lei nova também são benéficas. (A situação inversa é quando a nova lei tem partes mais gravosas e partes mais brandas). (...) sendo vedada a combinação de leis."
    },
    {
      "enunciado": "Um crime de dano (Art. 163 CP) é cometido para possibilitar a prática de um furto (Art. 155 CP) subsequente no mesmo contexto fático (ex: quebrar uma janela para entrar e furtar). Se o agente responde apenas pelo furto, qual princípio explica a não punição autônoma do dano?",
      "alternativas": {
        "A": "Princípio da especialidade, sendo o furto especial em relação ao dano.",
        "B": "Princípio da subsidiariedade, sendo o dano menos grave que o furto.",
        "C": "Princípio da consunção, considerando o dano como antefato impunível (crime-meio) absorvido pelo furto (crime-fim).",
        "D": "Princípio da alternatividade, pois o agente optou pelo furto."
      },
      "resposta_correta": "C",
      "pagina_pdf": "19-20",
      "trecho_consulta": "Princípio da consunção: o fato mais amplo e grave absorve os demais fatos menos amplos e graves. (...) Atos impuníveis: (...) Os anteriores são os que funcionam como meios de execução do tipo principal, ficando por estes absorvidos."
    },
    {
      "enunciado": "Se um indivíduo está sendo processado por um crime (fato A). Durante o processo, surge a lei X, que é mais benéfica. Antes do julgamento, a lei X é revogada pela lei Y, que é idêntica à lei original do tempo do crime (lei do fato A) ou até mais gravosa. Qual lei deve ser aplicada ao caso?",
      "alternativas": {
        "A": "A lei do tempo do fato A, pois a lei X foi revogada.",
        "B": "A lei Y, por ser a lei vigente ao tempo do julgamento.",
        "C": "A lei X (intermediária mais benéfica), pois, mesmo revogada, ela retroage para alcançar o fato praticado sob a lei A e possui ultratividade em relação à lei Y.",
        "D": "Nenhuma das leis, devendo o processo ser extinto por atipicidade temporária."
      },
      "resposta_correta": "C",
      "pagina_pdf": "14",
      "trecho_consulta": "A lei intermediária (ou intermédia) é aquela que deverá ser aplicada porque benéfica ao réu, muito embora não fosse a lei vigente ao tempo do fato, tampouco seja a lei vigente no momento do julgamento. (...) Nada impede a aplicação da lei 'B' [intermediária], desde que se trate, entre todas, da mais favorável ao agente."
    },
    {
      "enunciado": "A Súmula 711 do STF aplica-se ao crime continuado ou permanente se a vigência da lei penal mais grave é anterior à cessação da continuidade ou permanência. Esta súmula conflita com o princípio da irretroatividade da lei penal mais gravosa?",
      "alternativas": {
        "A": "Sim, é uma exceção expressa ao princípio da irretroatividade.",
        "B": "Não, pois se entende que o crime ainda está sendo praticado sob a égide da nova lei mais grave, não havendo propriamente retroatividade.",
        "C": "Sim, mas só se aplica se houver benefício para a sociedade, mesmo prejudicando o réu.",
        "D": "Não, porque a súmula se refere apenas a aspectos processuais da aplicação da pena."
      },
      "resposta_correta": "B",
      "pagina_pdf": "11 (explicação da aplicação da lei B mesmo sendo novatio legis in pejus) e 40 (comentário da questão 3 sobre a Súmula 711)",
      "trecho_consulta": "Deverá ser aplicada a lei B, mesmo que configure novatio legis in pejus. (p.11) (...) Nesses casos, não configura-se a violação do princípio da irretroatividade da lei penal mais grave. (p.40, Q3-Comentário)."
    }
  ]
}

Total de perguntas unificadas: 130
